[
  {
    "id": 7,
    "course_codes": "AFRICAAM 54N / AMSTUD 54N / CSRE 54N / FEMGEN 54N / HISTORY 54N",
    "course_title": "The Inner Lives of Black Women",
    "original_descr": "This course encourages students to use creative and rigorous historical methods to recover Black women's lives from the nineteenth century to the present.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: The Inner Lives of Black Women\n\nExpanded Description: This course invites students to explore the multifaceted experiences and contributions of Black women from the nineteenth century to the present. Through a blend of creative expression and rigorous historical analysis, students will examine primary sources, literature, and personal narratives to uncover the complexities of identity, resilience, and activism. Engaging in discussions and projects, participants will reflect on societal challenges and triumphs faced by Black women throughout history, fostering a deeper understanding of their pivotal roles. By the end of the course, students will appreciate the rich tapestry of Black women's lives and their enduring impact on society.",
    "expanded_word_count": 108
  },
  {
    "id": 15,
    "course_codes": "AMHRLANG 3",
    "course_title": "First-Year Amharic, Third Quarter",
    "original_descr": "Continuation of AMHRLANG 2. Prerequisite AMHRLANG 2. Fulfills the University Foreign Language Requirement.",
    "original_word_count": 13,
    "expanded_descr": "Course Title: First-Year Amharic, Third Quarter\n\nThis course serves as a continuation of AMHRLANG 2, building on foundational skills acquired in prior classes. Students will enhance their proficiency in Amharic through immersive language exercises, focusing on vocabulary expansion, grammar intricacies, and conversational practice. Emphasis will be placed on cultural context, enabling students to engage meaningfully with Amharic-speaking communities. By the end of the quarter, learners will confidently navigate everyday conversations, comprehend simple texts, and appreciate the nuances of Ethiopian culture. This course fulfills the University Foreign Language Requirement, making it an essential step for students seeking to deepen their language learning journey.",
    "expanded_word_count": 102
  },
  {
    "id": 25,
    "course_codes": "ANES 199",
    "course_title": "Undergraduate Research",
    "original_descr": "Allows for qualified students to undertake investigations sponsored by individual faculty members. Prerequisite: consent of instructor.",
    "original_word_count": 16,
    "expanded_descr": "Course Title: Undergraduate Research\n\nExpanded Description: This course provides qualified students with the unique opportunity to engage in independent research projects under the mentorship of individual faculty members. Students will collaborate closely with their instructors to develop research questions, design experiments, and analyze data within their field of study. Through this hands-on experience, participants will enhance their critical thinking, problem-solving, and analytical skills, while gaining valuable insights into the research process. Students must obtain consent from their instructor prior to enrollment, ensuring alignment with faculty expertise and resources. This course is ideal for those seeking to deepen their understanding of academic research and contribute to ongoing scholarly work.",
    "expanded_word_count": 108
  },
  {
    "id": 31,
    "course_codes": "ARABLANG 2A",
    "course_title": "Accelerated First-Year Arabic, Part II",
    "original_descr": "Completes first-year sequence in two rather than three quarters.  Prerequisite: Placement Test, completion of ARABLANG 1A.  This course fulfills the University Foreign Language Requirement.",
    "original_word_count": 24,
    "expanded_descr": "Course Title: Accelerated First-Year Arabic, Part II\n\nExpanded Description: Accelerated First-Year Arabic, Part II is designed to complete the first-year Arabic language sequence in an intensive format over two quarters. Building on skills developed in ARABLANG 1A, students will enhance their proficiency in speaking, listening, reading, and writing Arabic. The course emphasizes practical communication and cultural understanding, utilizing immersive activities, interactive exercises, and authentic materials. Students will engage in conversations, explore Arabic literature, and gain insights into various Arab cultures. Successful completion of this course fulfills the University Foreign Language Requirement, equipping students with essential language skills for future studies or travel.",
    "expanded_word_count": 102
  },
  {
    "id": 32,
    "course_codes": "ARABLANG 3",
    "course_title": "First-Year Arabic, Third Quarter",
    "original_descr": "Continuation of ARABLANG 2.  One-year sequence designed to develop beginning proficiency, emphasizing reading and writing standard Arabic. Fulfills the University Foreign Language Requirement. Prerequisite: Placement Test, ARABLANG 2.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: First-Year Arabic, Third Quarter\n\nExpanded Description: This course is a continuation of ARABLANG 2 and is part of a comprehensive one-year sequence aimed at developing foundational proficiency in Arabic. Students will further enhance their reading and writing skills in standard Arabic, focusing on vocabulary expansion and grammatical structures. Expect engaging activities that promote conversational practice, cultural insights, and exposure to Arabic literature. This class emphasizes practical language use, preparing students for real-world communication. Successful completion fulfills the University Foreign Language Requirement. Prerequisites include a placement test or successful completion of ARABLANG 2, ensuring students are adequately prepared for this level.",
    "expanded_word_count": 102
  },
  {
    "id": 33,
    "course_codes": "ARABLANG 21A",
    "course_title": "Accelerated Second-Year Arabic, Part I",
    "original_descr": "Completes second-year sequence in two rather than three quarters. For students with previous knowledge of Arabic. Prerequisite: Placement Test, ARABLANG 2A or 3.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Accelerated Second-Year Arabic, Part I\n\nExpanded Description: This intensive course is designed to complete the second-year Arabic curriculum within two quarters, catering to students who possess prior knowledge of the language. Through immersive lessons, students will enhance their proficiency in reading, writing, listening, and speaking Arabic, focusing on expanding vocabulary and complex grammatical structures. Engaging with authentic materials, including literature, media, and cultural texts, students will deepen their understanding of Arabic-speaking cultures. Active participation in discussions and collaborative projects will foster communication skills. Prerequisites include a placement test or successful completion of ARABLANG 2A or 3, ensuring an appropriate skill level for all participants.",
    "expanded_word_count": 106
  },
  {
    "id": 34,
    "course_codes": "ARABLANG 23",
    "course_title": "Second-Year Arabic, Third Quarter",
    "original_descr": "Continuation of ARABLANG 22. One-year sequence designed to develop intermediate proficiency, with additional emphasis on functional applications and reading and writing standard Arabic. Prerequisite: Placement Test, ARABLANG 22.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Second-Year Arabic, Third Quarter\n\nExpanded Description: This course serves as a continuation of ARABLANG 22, furthering students' journey towards intermediate proficiency in Arabic. Emphasizing practical communication skills, students will engage in immersive activities that enhance their ability to use Arabic in real-world contexts. The curriculum focuses on expanding vocabulary, refining grammar, and improving reading and writing skills in standard Arabic. Through diverse texts, cultural discussions, and interactive exercises, students will deepen their understanding of the language and its nuances. Successful completion requires a placement test or prior completion of ARABLANG 22, ensuring that all participants are adequately prepared for this enriching experience.",
    "expanded_word_count": 104
  },
  {
    "id": 1952,
    "course_codes": "MLA 398",
    "course_title": "MLA Thesis in Progress",
    "original_descr": "Group meetings provide peer critiques, motivations, and advice under the direction of the Associate Dean.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: MLA Thesis in Progress\n\nDescription: This course facilitates a collaborative and supportive environment where students actively engage in group meetings focused on their thesis projects. Under the guidance of the Associate Dean, participants will present their work for peer critiques, fostering constructive feedback that enhances their research quality. Students will also receive motivational support and strategic advice tailored to their specific challenges and goals. Emphasizing the importance of community in academic success, this course encourages interdisciplinary dialogue, helping students refine their arguments, strengthen their writing, and develop a clear thesis statement, ultimately progressing toward the successful completion of their MLA thesis.",
    "expanded_word_count": 103
  },
  {
    "id": 55,
    "course_codes": "ARTSTUDI 145",
    "course_title": "Painting I",
    "original_descr": "Introduction to techniques, materials, and vocabulary in oil painting. Still life, landscape, and figure used as subject matter. Emphasis is on painting and drawing from life. (lower level)",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Painting I\n\nExpanded Description: This foundational course introduces students to the essential techniques, materials, and vocabulary of oil painting. Through engaging projects focusing on still life, landscape, and figure painting, students will explore the nuances of color theory, composition, and brushwork. A significant emphasis is placed on painting and drawing from life, enabling learners to develop their observational skills and artistic expression. Students will also engage in critiques to foster a deeper understanding of artistic concepts and personal styles. By the end of the course, participants will have a solid foundation in oil painting, preparing them for more advanced artistic endeavors.",
    "expanded_word_count": 103
  },
  {
    "id": 63,
    "course_codes": "ASLLANG 2A",
    "course_title": "Accelerated First- Year American Sign Language -2nd Qtr",
    "original_descr": "Completes first-year sequence in two rather than three quarters. Course emphasizes development of comprehension and production skills using daily life topics. Focus on cultural awareness necessary for communication.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Accelerated First-Year American Sign Language - 2nd Qtr\n\nThis accelerated course completes the first-year American Sign Language sequence in just two quarters, allowing students to rapidly develop essential ASL skills. Emphasizing both comprehension and production, students will engage with practical topics related to daily life, enhancing their ability to communicate effectively in various contexts. Additionally, the course will incorporate cultural awareness components, providing insights into Deaf culture and the nuances of non-verbal communication. Through interactive activities, group discussions, and immersive practice, students will build confidence and fluency in ASL, preparing them for further studies and meaningful interactions within the Deaf community.",
    "expanded_word_count": 103
  },
  {
    "id": 105,
    "course_codes": "CHINLANG 1",
    "course_title": "First-Year Modern Chinese, First Quarter",
    "original_descr": "Conversation, grammar, reading, elementary composition. Daily sections may be set at the beginning of the quarter to suit schedule requirements.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: First-Year Modern Chinese, First Quarter\n\nExpanded Description: This introductory course in Modern Chinese is designed for beginners eager to embark on a journey into the Chinese language and culture. Students will engage in fundamental conversational skills, essential grammar rules, and basic reading comprehension, all tailored to enhance language acquisition. Emphasis will be placed on developing elementary composition skills, allowing students to express themselves in written Chinese. Daily sections will be organized at the beginning of the quarter to accommodate various schedules, ensuring flexibility. Through interactive activities, students will build confidence and a solid foundation in Mandarin Chinese, preparing them for continued language learning.",
    "expanded_word_count": 105
  },
  {
    "id": 106,
    "course_codes": "CHINLANG 2",
    "course_title": "First-Year Modern Chinese, Second Quarter",
    "original_descr": "Continuation of CHINLANG 1.  Daily sections may be set at the beginning of the quarter to suit schedule requirements.Prerequisite: placement test, CHINLANG 1.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: First-Year Modern Chinese, Second Quarter\n\nExpanded Description: Building upon the foundational skills acquired in CHINLANG 1, this course continues to develop proficiency in Modern Chinese through interactive lessons that emphasize speaking, listening, reading, and writing. Students will engage in daily activities designed to enhance vocabulary and grammar understanding while exploring cultural contexts. Structured to accommodate diverse schedules, daily sections will be arranged at the beginning of the quarter to maximize accessibility. Students are required to complete a placement test or have successfully completed CHINLANG 1. By the end of this course, learners will gain increased confidence in their language abilities and cultural awareness.",
    "expanded_word_count": 105
  },
  {
    "id": 107,
    "course_codes": "CHINLANG 3",
    "course_title": "First-Year Modern Chinese, Third Quarter",
    "original_descr": "Continuation of CHINLANG 2. Daily sections may be set at the beginning of the quarter to suit schedule requirements. Fulfills the University language requirement. Prerequisite: Placement Test, CHINLANG 2.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: First-Year Modern Chinese, Third Quarter\n\nDescription: This course serves as a continuation of CHINLANG 2, further enhancing students’ proficiency in Modern Chinese through an immersive and interactive approach. Students will expand their vocabulary, grammar, and conversational skills, focusing on practical applications in everyday contexts. Daily sections will be organized at the start of the quarter to accommodate various student schedules. Engaging activities such as role-plays, dialogues, and cultural discussions will enrich the learning experience, fostering a deeper understanding of Chinese culture. Completion fulfills the University language requirement. Prerequisites include a successful placement test or completion of CHINLANG 2. Join us for an exciting linguistic journey!",
    "expanded_word_count": 107
  },
  {
    "id": 113,
    "course_codes": "CHINLANG 23",
    "course_title": "Second-Year Modern Chinese, Third Quarter",
    "original_descr": "Continuation of CHINLANG 22. Listening, speaking, reading, writing. Daily sections may be set at the beginning of the quarter to suit schedule requirements. Prerequisite: Placement Test, CHINLANG 22.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Second-Year Modern Chinese, Third Quarter\n\nExpanded Description: This course serves as a continuation of CHINLANG 22, focusing on enhancing students’ proficiency in listening, speaking, reading, and writing in Modern Chinese. Through engaging activities such as interactive dialogues, group discussions, and written assignments, students will deepen their understanding of Chinese culture and language nuances. Daily sections will be tailored at the start of the quarter to accommodate varied schedule needs, ensuring flexibility and accessibility for all participants. A prerequisite for enrollment includes either a successful placement test or completion of CHINLANG 22, ensuring that all students are adequately prepared for this immersive learning experience.",
    "expanded_word_count": 105
  },
  {
    "id": 114,
    "course_codes": "CHINLANG 23B",
    "course_title": "Second-Year Chinese for Bilingual Students, Third Quarter",
    "original_descr": "Continuation of CHINLANG 22B. For students with advanced comprehension and speaking skills, but lacking equivalent knowledge of grammar, reading, and writing Chinese characters. Prerequisite: Placement Test, CHINLANG 22B.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Second-Year Chinese for Bilingual Students, Third Quarter\n\nExpanded Description: This course serves as a continuation of CHINLANG 22B, designed specifically for bilingual students who possess advanced listening and speaking skills in Chinese yet need further development in grammar, reading, and writing Chinese characters. Students will engage in immersive learning experiences, enhancing their grammatical understanding through practical exercises and dialogues. The curriculum focuses on expanding vocabulary and refining reading comprehension, while students practice writing characters to improve literacy. Through interactive discussions, multimedia resources, and collaborative projects, participants will enhance their linguistic proficiency and cultural awareness, preparing them for more advanced studies in Chinese language and literature.",
    "expanded_word_count": 107
  },
  {
    "id": 117,
    "course_codes": "CHINLANG 43",
    "course_title": "Intermediate-to-Advanced Chinese Conversation, Third Quarter",
    "original_descr": "Continuation of CHINLANG 42. Repeatable once for units. Prerequisite: CHINLANG 23.",
    "original_word_count": 11,
    "expanded_descr": "Course Title: Intermediate-to-Advanced Chinese Conversation, Third Quarter\n\nCourse Description: This course serves as a continuation of CHINLANG 42, designed for students who wish to enhance their conversational proficiency in Mandarin Chinese. Building upon the foundations established in CHINLANG 23, participants will engage in dynamic discussions, role-playing scenarios, and group activities that promote fluency and confidence. Students will explore complex topics such as culture, politics, and current events, while expanding their vocabulary and refining their grammatical skills. Emphasis will be placed on listening comprehension and pronunciation. This course is repeatable for additional units, allowing students further opportunities for mastery and nuanced conversation.",
    "expanded_word_count": 101
  },
  {
    "id": 120,
    "course_codes": "CHINLANG 103B",
    "course_title": "Third-Year Modern Chinese for Bilingual Students, Third Quarter",
    "original_descr": "Continuation of CHINLANG 102B. Equivalent of CHINLANG 103. For students with advanced listening and speaking abilities, but lacking equivalent knowledge in reading and writing. Prerequisite: CHINLANG 102B.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Third-Year Modern Chinese for Bilingual Students, Third Quarter\n\nExpanded Description: This course is a continuation of CHINLANG 102B and is equivalent to CHINLANG 103, designed specifically for bilingual students who possess advanced listening and speaking skills in Mandarin. However, these students may not have the same proficiency in reading and writing. Throughout the quarter, students will enhance their literacy by engaging with authentic texts, expanding vocabulary, and mastering complex grammatical structures. Interactive activities, such as discussions and presentations, will foster communication skills, while culturally relevant materials will deepen understanding of contemporary Chinese society. Prerequisite: successful completion of CHINLANG 102B is required for enrollment.",
    "expanded_word_count": 105
  },
  {
    "id": 125,
    "course_codes": "CLASSICS 3G",
    "course_title": "Beginning Greek",
    "original_descr": "Vocabulary and syntax of the classical language. Prerequisite: CLASSICS 2G or equivalent placement. CLASSICS 3G fulfills University language requirement.",
    "original_word_count": 19,
    "expanded_descr": "Course Title: Beginning Greek\n\nThis foundational course introduces students to the vocabulary and syntax of ancient Greek, a pivotal language for understanding classical literature, history, and philosophy. Through engaging lectures, interactive exercises, and readings of selected texts, students will develop essential language skills, including grammar and sentence structure. Emphasis will be placed on translating prose and poetry, enabling students to appreciate the nuances of the language. Prerequisites include CLASSICS 2G or equivalent placement. Successful completion of CLASSICS 3G satisfies the University’s language requirement, making this course an excellent choice for those seeking to enhance their linguistic and cultural knowledge of the ancient world.",
    "expanded_word_count": 103
  },
  {
    "id": 126,
    "course_codes": "CLASSICS 3L",
    "course_title": "Beginning Latin",
    "original_descr": "Vocabulary and syntax of the classical language. Prerequisite: CLASSICS 2L or equivalent placement. CLASSICS 3L fulfills the University language requirement.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Beginning Latin\n\nIn this introductory Latin course, students will explore the fundamental vocabulary and syntax of this classical language, laying a strong foundation for further study. Through a variety of engaging activities, including reading passages from ancient texts, students will gain insights into Roman culture and literature while developing their linguistic skills. Emphasis will be placed on understanding grammatical structures, enhancing translation abilities, and expanding vocabulary. This course is designed for those who have completed CLASSICS 2L or have equivalent placement knowledge. Successful completion of CLASSICS 3L will satisfy the University language requirement, enriching students' academic portfolios.",
    "expanded_word_count": 99
  },
  {
    "id": 132,
    "course_codes": "CLASSICS 103L",
    "course_title": "Advanced Latin: Seneca's Moral Epistles",
    "original_descr": "Description forthcoming.",
    "original_word_count": 2,
    "expanded_descr": "In \"Advanced Latin: Seneca's Moral Epistles,\" students will explore the profound philosophical insights of Seneca, one of Rome's most influential Stoic thinkers. This course delves into selected letters from Seneca's collection, focusing on themes such as ethics, virtue, and the human condition. Students will enhance their Latin language skills through close reading and analysis of the text, while also engaging with historical and cultural contexts. Class discussions will encourage critical thinking about the relevance of Stoic philosophy in contemporary life. By the end, students will gain a deeper appreciation of Seneca's contributions to literature and moral philosophy.",
    "expanded_word_count": 97
  },
  {
    "id": 154,
    "course_codes": "COMPMED 198",
    "course_title": "Undergraduate Directed Reading in Comparative Medicine",
    "original_descr": "May be taken as a prelude to research and may also involve participation in a lab or research group seminar and/or library research.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Undergraduate Directed Reading in Comparative Medicine\n\nExpanded Description: This course offers students a unique opportunity to explore foundational concepts in comparative medicine through directed reading. Students will engage with primary literature and seminal texts, fostering critical thinking and analytical skills relevant to the field. Participation in a lab or research group seminar allows students to discuss findings, share insights, and collaborate with peers and faculty. Additionally, library research will enhance their understanding of current methodologies and advancements in comparative medicine. By the end of the course, students will be well-prepared for future research endeavors, equipped with knowledge and experience in this interdisciplinary area of study.",
    "expanded_word_count": 107
  },
  {
    "id": 171,
    "course_codes": "CS 194W",
    "course_title": "Software Project (WIM)",
    "original_descr": "Restricted to Computer Science and Electrical Engineering undergraduates.  Writing-intensive version of CS194. Preference given to seniors. Prerequisites: CS109 and CS161.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Software Project (WIM)\n\nExpanded Description: This writing-intensive course, designed specifically for Computer Science and Electrical Engineering undergraduates, offers an immersive experience in software project development. Students will engage in comprehensive project planning, design, implementation, and documentation, honing their technical and communication skills. The course emphasizes collaborative teamwork and real-world problem-solving, allowing students to apply theoretical knowledge to practical applications. With a preference for seniors, participants will build on prerequisites CS109 and CS161, gaining valuable insights into software engineering principles and practices. By the end of the course, students will produce a polished project portfolio and enhance their professional writing capabilities.",
    "expanded_word_count": 102
  },
  {
    "id": 226,
    "course_codes": "ENGLISH 90",
    "course_title": "Fiction Writing",
    "original_descr": "The elements of fiction writing: narration, description, and dialogue. Students write complete stories and participate in story workshops.",
    "original_word_count": 18,
    "expanded_descr": "Course Title: Fiction Writing\n\nIn this engaging Fiction Writing course, students will explore the essential elements of storytelling, including narration, vivid description, and authentic dialogue. Through a series of writing exercises, students will develop their unique voices while crafting complete short stories. Participants will engage in collaborative workshops, providing constructive feedback and learning to revise their work effectively. The course will also cover various narrative techniques and styles, allowing students to experiment with structure and character development. By the end of the course, students will have a portfolio of polished stories and a deeper understanding of the creative writing process.",
    "expanded_word_count": 100
  },
  {
    "id": 228,
    "course_codes": "ENGLISH 91",
    "course_title": "Creative Nonfiction",
    "original_descr": "Historical and contemporary as a broad genre including travel and nature writing, memoir, biography, journalism, and the personal essay. Students use creative means to express factual content.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Creative Nonfiction\n\nExpanded Description: This course delves into the rich and diverse genre of creative nonfiction, encompassing historical and contemporary works in travel writing, nature writing, memoir, biography, journalism, and personal essays. Students will explore the art of blending factual content with creative expression, honing their skills in storytelling and narrative construction. Through readings, discussions, and writing exercises, participants will learn to craft compelling narratives that resonate with authenticity and emotional depth. By analyzing various forms, students will develop their unique voice and style, ultimately producing polished pieces that reflect both their perspectives and the intricacies of real-life experiences.",
    "expanded_word_count": 101
  },
  {
    "id": 229,
    "course_codes": "ENGLISH 92",
    "course_title": "Reading and Writing Poetry",
    "original_descr": "Issues of poetic craft. How elements of form, music, structure, and content work together to create meaning and experience in a poem.",
    "original_word_count": 22,
    "expanded_descr": "Course Description: In \"Reading and Writing Poetry,\" students will explore the intricate interplay of poetic craft, delving into how form, rhythm, structure, and content coalesce to convey profound meaning and evoke emotional experiences. Through analyzing a diverse range of poems, participants will gain insight into various styles and techniques, enhancing their understanding of poetic voice and imagery. Writing exercises will encourage experimentation with different forms, fostering creativity and personal expression. By the end of the course, students will develop critical skills in both reading and crafting poetry, enabling them to appreciate the art form while honing their unique poetic voices.",
    "expanded_word_count": 100
  },
  {
    "id": 245,
    "course_codes": "FEMGEN 199C",
    "course_title": "Feminist, Gender, and Sexuality Studies Honors Workshop",
    "original_descr": "Required of seniors in the Feminist, Gender, and Sexuality Studies honors program. Particippants share ongoing work on their honors theses.  Prerequisite:  consent of instructor.",
    "original_word_count": 24,
    "expanded_descr": "Course Title: Feminist, Gender, and Sexuality Studies Honors Workshop\n\nExpanded Description: This workshop serves as a crucial capstone for seniors enrolled in the Feminist, Gender, and Sexuality Studies honors program. Participants will engage deeply with their ongoing research, sharing drafts and receiving constructive feedback from peers and the instructor. Emphasis will be placed on refining thesis arguments, enhancing analytical skills, and effectively articulating complex ideas. Additionally, students will explore interdisciplinary methodologies and frameworks, fostering a collaborative intellectual environment. This enriching experience not only prepares participants for their final thesis submissions but also encourages critical dialogue around contemporary issues in feminist, gender, and sexuality studies. Prerequisite: consent of instructor.",
    "expanded_word_count": 108
  },
  {
    "id": 247,
    "course_codes": "FEMGEN 293D / HISTORY 293D / HISTORY 393D",
    "course_title": "Queer and Trans History in Comparative Perspective",
    "original_descr": "This course explores the comparative history of queer and transgender desires, relationships, and identities through highlights of recent and classic scholarship on different periods and parts of the world.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: Queer and Trans History in Comparative Perspective\n\nExpanded Description: This course delves into the multifaceted history of queer and transgender identities, desires, and relationships across various cultures and historical periods. Students will engage with both classic and contemporary scholarship, examining how societal norms have shaped queer and trans experiences globally. Through critical analysis of primary texts, historical documents, and case studies, learners will uncover the intersections of sexuality, gender, and power. By comparing diverse perspectives, students will develop a nuanced understanding of the evolution of queer and trans histories, fostering critical thinking and promoting awareness of contemporary issues within LGBTQ+ communities worldwide.",
    "expanded_word_count": 104
  },
  {
    "id": 250,
    "course_codes": "FILMEDIA 102 / FILMEDIA 302",
    "course_title": "Theories of the Moving Image: The Technologically Mediated Image",
    "original_descr": "This course examines influential theories of film and media from the early twentieth century to the present. Prerequisites: FILMEDIA 4.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Theories of the Moving Image: The Technologically Mediated Image\n\nExpanded Description: This course provides an in-depth exploration of pivotal theories surrounding film and media, tracing their evolution from the early twentieth century to contemporary practices. Students will analyze key texts and concepts that have shaped our understanding of the moving image and its relationship with technology. Through lectures, discussions, and screenings, participants will engage critically with various theoretical frameworks, examining the impact of technological advancements on visual culture. By the end of the course, students will develop a nuanced perspective on how media influences perception, representation, and narrative in today’s digital landscape. Prerequisites: FILMEDIA 4.",
    "expanded_word_count": 107
  },
  {
    "id": 1302,
    "course_codes": "EDUC 387 / SOC 311A",
    "course_title": "Workshop: Comparative Sociology",
    "original_descr": "Analysis of quantitative and longitudinal data on national educational systems and political structures. May be repeated for credit. Prerequisite: consent of instructor.",
    "original_word_count": 22,
    "expanded_descr": "Course Title: Workshop: Comparative Sociology\n\nExpanded Description: This workshop provides an in-depth analysis of quantitative and longitudinal data concerning various national educational systems and their corresponding political structures. Students will engage in hands-on data collection, interpretation, and comparison, enhancing their understanding of how different sociopolitical contexts influence educational outcomes. Through collaborative projects and discussions, participants will develop critical thinking skills and methodological expertise applicable to real-world scenarios. The course encourages students to explore diverse sociological theories while fostering an appreciation for cultural differences. Students may repeat the workshop for additional credit, with participation contingent upon obtaining consent from the instructor.",
    "expanded_word_count": 100
  },
  {
    "id": 253,
    "course_codes": "FRENLANG 1",
    "course_title": "First-Year French, First Quarter",
    "original_descr": "Proficiency-based. Development of discourse appropriate in French and Francophone contexts. Prerequisite: no previous exposure to French",
    "original_word_count": 16,
    "expanded_descr": "Course Title: First-Year French, First Quarter\n\nExpanded Description: This introductory course is designed for students with no prior exposure to the French language. Emphasizing proficiency, students will develop essential communication skills tailored for various French and Francophone contexts. Through engaging activities, including interactive dialogues, listening exercises, and cultural immersion, learners will practice vocabulary and grammatical structures that facilitate meaningful discourse. Topics will encompass everyday conversations, basic expressions, and cultural insights. Additionally, students will explore the rich tapestry of Francophone cultures, enhancing their global perspective. By the end of this course, students will confidently engage in basic conversations and express themselves in simple French.",
    "expanded_word_count": 103
  },
  {
    "id": 255,
    "course_codes": "FRENLANG 2",
    "course_title": "First-Year French, Second Quarter",
    "original_descr": "Continuation of FRENLANG 1. Proficiency-based. Development of discourse appropriate in French and Francophone contexts. Recent placement Test, completion of FRENLANG 1 or consent of French coordinator.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: First-Year French, Second Quarter\n\nExpanded Description: This course is a continuation of FRENLANG 1, designed for students seeking to enhance their proficiency in French. Building on foundational skills, students will engage in interactive activities that foster the development of discourse suitable for diverse French and Francophone contexts. Emphasis will be placed on expanding vocabulary, improving grammar, and enhancing conversational abilities through immersive practices such as role-playing, discussions, and multimedia resources. Students will also explore cultural aspects, enriching their understanding of the Francophone world. Successful completion requires either a recent placement test, previous course completion, or the consent of the French coordinator.",
    "expanded_word_count": 103
  },
  {
    "id": 264,
    "course_codes": "GERLANG 1",
    "course_title": "First-Year German, First Quarter",
    "original_descr": "First-quarter of three-quarter First-Year Gerlang sequence. Emphasis is on developing beginning proficiency in interpersonal, interpretive, and presentational spheres.Prerequisite:  no experience with German or Placement.",
    "original_word_count": 24,
    "expanded_descr": "Course Title: First-Year German, First Quarter\n\nExpanded Description: This course represents the first of a comprehensive three-quarter sequence designed for beginners in the German language. Students will focus on developing foundational proficiency across interpersonal, interpretive, and presentational communication skills. Through engaging activities such as dialogues, reading exercises, and presentations, learners will gain essential vocabulary and grammar, enabling them to navigate everyday situations in German. Cultural insights will enhance understanding and appreciation of German-speaking countries. No prior experience is required, making this an ideal starting point for those eager to explore the language. Placement tests are available for those with some previous exposure to German.",
    "expanded_word_count": 104
  },
  {
    "id": 265,
    "course_codes": "GERLANG 2",
    "course_title": "First-Year German, Second Quarter",
    "original_descr": "Continuation of GERLANG1. Further development of socially and culturally appropriate proficiency in interpersonal, interpretive, and presentational spheres.Prerequisite: Placement, GERLANG1.",
    "original_word_count": 19,
    "expanded_descr": "Course Title: First-Year German, Second Quarter\n\nExpanded Description: This course is a continuation of GERLANG1, designed to enhance students' proficiency in German across interpersonal, interpretive, and presentational contexts. Students will engage in dynamic activities that promote conversational skills, listening comprehension, and reading proficiency, while exploring culturally relevant topics. Instruction will include interactive exercises, group discussions, and multimedia resources that foster deeper understanding of the German-speaking world. Prerequisite requirements include a successful placement or completion of GERLANG1. By the end of this quarter, students will be equipped with essential vocabulary and grammatical structures, enabling them to communicate effectively in everyday situations and cultural exchanges.",
    "expanded_word_count": 103
  },
  {
    "id": 271,
    "course_codes": "HEBRLANG 3 / JEWISHST 101C",
    "course_title": "First-Year Hebrew, Third Quarter",
    "original_descr": "Continuation of HEBRLANG 2. Prerequisite: Placement Test, HEBRLANG 2. Fulfill the University Foreign Language Requirement.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: First-Year Hebrew, Third Quarter\n\nExpanded Description: This course serves as a continuation of HEBRLANG 2, enhancing students' proficiency in Hebrew through immersive language activities. Building on foundational grammar, vocabulary, and conversational skills, students will engage in reading, writing, and speaking exercises that emphasize practical application and cultural context. Course materials include contemporary texts, audio resources, and interactive dialogues, fostering a dynamic learning environment. Students will also explore aspects of Israeli culture and society to deepen their understanding of the language. Successful completion fulfills the University Foreign Language Requirement, preparing students for advanced study or personal enrichment in Hebrew language and culture.",
    "expanded_word_count": 103
  },
  {
    "id": 274,
    "course_codes": "HINDLANG 23",
    "course_title": "Second-Year Hindi, Third Quarter",
    "original_descr": "Continuation of HINDLANG 22. Prerequisite: HINDLANG 22.",
    "original_word_count": 7,
    "expanded_descr": "Course Title: Second-Year Hindi, Third Quarter\n\nThis course serves as a continuation of HINDLANG 22, building upon the foundational skills developed in previous Hindi language studies. Students will deepen their understanding of grammar, expand their vocabulary, and enhance their conversational proficiency through interactive exercises and immersive activities. Cultural context will be integrated, allowing learners to explore contemporary Indian society, literature, and traditions. Emphasis will be placed on reading and interpreting various texts, writing short essays, and engaging in discussions. By the end of the course, students will confidently communicate in Hindi while appreciating the nuances of language and culture. Prerequisite: HINDLANG 22.",
    "expanded_word_count": 102
  },
  {
    "id": 292,
    "course_codes": "IGBOLANG 3",
    "course_title": "First-Year Igbo, Third Quarter",
    "original_descr": "Continuation of IGBOLANG 2. Prerequisite: IGBOLANG 2. Fulfills the University Foreign Language requirement.",
    "original_word_count": 13,
    "expanded_descr": "Course Title: First-Year Igbo, Third Quarter\n\nExpanded Description: This course serves as a continuation of IGBOLANG 2, further enhancing students’ proficiency in the Igbo language through immersive learning experiences. Building on foundational vocabulary and grammar, students will engage in conversational practice, reading comprehension, and cultural exploration. The curriculum includes interactive activities, such as role-playing and group discussions, designed to reinforce language skills and promote fluency. Additionally, students will delve into various aspects of Igbo culture, traditions, and history, fostering a deeper understanding and appreciation of the language. Successful completion fulfills the University Foreign Language requirement, making it a vital step in language acquisition.",
    "expanded_word_count": 103
  },
  {
    "id": 299,
    "course_codes": "ITALIC 99SI",
    "course_title": "Immersion in the Arts",
    "original_descr": "Student-led courses in the arts. Topics change quarterly. Open to ALL students but current ITALIC students and alumni will be given priority.",
    "original_word_count": 22,
    "expanded_descr": "Course Title: Immersion in the Arts\n\nExpanded Description: Immerse yourself in a vibrant exploration of the arts through this student-led course, where creativity knows no bounds. Each quarter, diverse topics will be introduced, allowing students to engage with various artistic disciplines, including visual arts, music, theater, and dance. Participants will collaborate, share ideas, and develop projects that reflect their passions and perspectives. Open to all students, this course particularly prioritizes current ITALIC students and alumni, fostering a dynamic community of artists. Enhance your skills, gain valuable insights, and connect with peers while celebrating the transformative power of the arts in a supportive environment.",
    "expanded_word_count": 103
  },
  {
    "id": 304,
    "course_codes": "JAPANLNG 1",
    "course_title": "First-Year Japanese Language, Culture, and Communication, First Quarter",
    "original_descr": "First-year sequence enables students to converse, write, and read essays on topics such as personal history, experiences, familiar people.  72 kanji characters will be taught.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: First-Year Japanese Language, Culture, and Communication, First Quarter\n\nExpanded Description: This introductory course immerses students in the basics of the Japanese language, focusing on conversational skills, reading, and writing. Students will engage in structured lessons that cover essential topics such as personal history, everyday experiences, and descriptions of familiar people, allowing for practical communication. Throughout the quarter, participants will learn to recognize and write 72 fundamental kanji characters, enhancing their literacy and understanding of Japanese culture. Interactive activities, including role-playing and cultural discussions, will enrich the learning experience, fostering a deeper appreciation of Japan’s traditions and social nuances while building a strong foundation for future language studies.",
    "expanded_word_count": 109
  },
  {
    "id": 309,
    "course_codes": "JEWISHST 104C / YDDSHLNG 3",
    "course_title": "First-Year Yiddish, Third Quarter",
    "original_descr": "Continuation of YDDSHLNG 2. Prerequisite: YDDSHLNG 2. Fulfills the University Foreign Language Requirement.",
    "original_word_count": 13,
    "expanded_descr": "Course Title: First-Year Yiddish, Third Quarter\n\nThis course serves as a continuation of YDDSHLNG 2, designed for students who have successfully completed the prerequisite. In this third quarter, learners will deepen their understanding of Yiddish language and culture through expanded vocabulary, grammar, and conversational skills. Students will engage with authentic texts, including literature, songs, and films, to enhance comprehension and appreciation of Yiddish heritage. Emphasis will be placed on speaking and listening skills through interactive activities, fostering confidence in real-life communication. By the end of the course, students will have the foundational skills necessary to engage in basic conversations and explore Yiddish traditions.",
    "expanded_word_count": 103
  },
  {
    "id": 313,
    "course_codes": "KORLANG 103",
    "course_title": "Third-Year Korean, Third Quarter",
    "original_descr": "Continuation of KORLANG 102. Materials about Korean culture and society. Proficiency in interpersonal, interpretive, and presentational communication. Vocabulary, reading, and aural/oral skills. Prerequisite: Placement Test, or KORLANG 102.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Third-Year Korean, Third Quarter\n\nThis course is a continuation of KORLANG 102, designed to deepen students' understanding of the Korean language and its cultural context. Students will engage with a variety of materials that explore contemporary Korean society, enhancing their proficiency in interpersonal, interpretive, and presentational communication. Emphasis will be placed on expanding vocabulary, improving reading comprehension, and developing aural/oral skills through interactive activities and discussions. Students will also explore cultural themes relevant to modern Korean life, fostering a more nuanced appreciation of the language. Prerequisite: Successful completion of a placement test or KORLANG 102 is required for enrollment.",
    "expanded_word_count": 101
  },
  {
    "id": 326,
    "course_codes": "MATH 122",
    "course_title": "Modules and Group Representations",
    "original_descr": "Modules over PID. Tensor products over fields. Group representations and group rings. Maschke's theorem and character theory. Character tables, construction of representations. Prerequisite: Math 113 and 120.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Modules and Group Representations\n\nIn this course, students will explore the fascinating world of modules over principal ideal domains (PIDs) and delve into the intricacies of tensor products over fields. The curriculum will cover group representations and group rings, with a special emphasis on Maschke's theorem, which addresses the complete reducibility of representations over fields. Students will also study character theory, including the construction and interpretation of character tables. Through rigorous problem-solving and theoretical exploration, students will gain a deep understanding of how algebraic structures interact. A solid foundation in Math 113 and 120 is required for enrollment in this course.",
    "expanded_word_count": 103
  },
  {
    "id": 347,
    "course_codes": "MUSIC 24B / MUSIC 24C",
    "course_title": "Ear Training II",
    "original_descr": "Class is closed by design.  Please contact instructor Erika Arul (mailto:earul@stanford.edu) for permission to enroll. Preference to Music majors and minors.",
    "original_word_count": 21,
    "expanded_descr": "Course Title: Ear Training II\n\nExpanded Description: Ear Training II is an advanced course designed for students who have successfully completed Ear Training I. This class focuses on refining auditory skills essential for music comprehension, including interval recognition, chord identification, and rhythmic dictation. Students will engage in a variety of exercises, including singing, listening, and transcription, to enhance their musical ear. The course emphasizes practical applications in various musical styles and contexts. Enrollment is limited and by permission only, prioritizing Music majors and minors. Interested students should contact instructor Erika Arul at earul@stanford.edu for enrollment inquiries and to discuss prerequisites.",
    "expanded_word_count": 100
  },
  {
    "id": 349,
    "course_codes": "MUSIC 42",
    "course_title": "Music History Since 1830",
    "original_descr": "Pre- or corequisite: 23.",
    "original_word_count": 4,
    "expanded_descr": "This course, \"Music History Since 1830,\" explores the evolution of Western music from the Romantic era to contemporary styles. Students will examine significant composers, genres, and movements, including Romanticism, Impressionism, and Modernism. We will analyze notable works and their cultural contexts, focusing on how historical events influenced musical trends. Additionally, students will engage in listening exercises, discussions, and research projects to deepen their understanding of the relationship between music and society. By the end of the course, participants will be equipped with a comprehensive knowledge of key developments in music history and how they resonate in today’s musical landscape.",
    "expanded_word_count": 99
  },
  {
    "id": 353,
    "course_codes": "MUSIC 127C",
    "course_title": "Band Arranging",
    "original_descr": "Develop skills and techniques related to arranging for marching and concert bands; emphasizes instrumentation, transposition, and voicing.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Band Arranging\n\nIn this comprehensive course, students will immerse themselves in the art of arranging music specifically for marching and concert bands. Participants will develop essential skills and techniques, focusing on critical aspects such as instrumentation, transposition, and effective voicing. Through hands-on projects and collaborative exercises, students will explore various genres and styles, learning to craft arrangements that enhance performance quality and engage audiences. Additionally, the course will cover the use of software tools for arranging, helping students to realize their musical ideas. By the end of the course, students will confidently create original arrangements tailored for diverse band settings.",
    "expanded_word_count": 102
  },
  {
    "id": 361,
    "course_codes": "MUSIC 220C",
    "course_title": "Research Seminar in Computer-Generated Music",
    "original_descr": "Individual projects in composition, psychoacoustics, or signal processing. See http://ccrma.stanford.edu. May be repeated for credit. Prerequisite: 220B.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Research Seminar in Computer-Generated Music\n\nThis seminar offers an in-depth exploration of individual projects focusing on composition, psychoacoustics, and signal processing within the realm of computer-generated music. Students will engage in hands-on research, developing innovative sound compositions and analyzing auditory perception through psychoacoustic principles. Participants will also investigate advanced signal processing techniques to enhance their creative works. Emphasis is placed on interdisciplinary collaboration and critical listening skills. This course may be repeated for credit, allowing students to refine their projects and deepen their expertise. Prerequisite knowledge from course 220B is essential for a successful experience in this seminar.",
    "expanded_word_count": 100
  },
  {
    "id": 402,
    "course_codes": "PSYCH 10 / STATS 60",
    "course_title": "Introduction to Statistical Methods: Precalculus",
    "original_descr": "Techniques for organizing data, computing, and interpreting measures of central tendency, variability, and association. Estimation, confidence intervals, tests of hypotheses, correlation, and regression.",
    "original_word_count": 23,
    "expanded_descr": "In \"Introduction to Statistical Methods: Precalculus,\" students will explore essential techniques for effectively organizing and analyzing data. The course covers the computation and interpretation of key measures, including central tendency, variability, and association, providing a foundational understanding of data relationships. Students will learn to construct and interpret confidence intervals, perform hypothesis testing, and apply correlation and regression analysis to real-world scenarios. Through hands-on projects and practical examples, participants will develop critical thinking skills necessary for data-driven decision-making. This course is designed to equip students with the statistical tools required for further study in various fields, enhancing their analytical capabilities.",
    "expanded_word_count": 99
  },
  {
    "id": 394,
    "course_codes": "POLSHLNG 103",
    "course_title": "Third-Year Polish, Third Quarter",
    "original_descr": "Continuation of POLSHLNG 102. Prerequisite: POLSHLNG 102.",
    "original_word_count": 7,
    "expanded_descr": "Course Title: Third-Year Polish, Third Quarter\n\nThis course serves as a continuation of POLSHLNG 102, designed for students who have successfully completed the second quarter of third-year Polish. Building on previously acquired language skills, students will deepen their understanding of Polish grammar, vocabulary, and sentence structure through immersive reading, writing, and conversation exercises. Emphasis will be placed on enhancing fluency and comprehension by engaging with contemporary Polish literature, media, and cultural topics. Students will participate in discussions, presentations, and collaborative projects, fostering an interactive learning environment. By the end of the quarter, students will confidently communicate on a variety of subjects in Polish.",
    "expanded_word_count": 103
  },
  {
    "id": 406,
    "course_codes": "PUNJLANG 3",
    "course_title": "First Year Punjabi, Third Quarter",
    "original_descr": "Continuation of PUNJLANG 2.",
    "original_word_count": 4,
    "expanded_descr": "Course Title: First Year Punjabi, Third Quarter\n\nExpanded Description: This course serves as a continuation of PUNJLANG 2, designed to deepen students' understanding and proficiency in the Punjabi language. Building on foundational skills, students will enhance their vocabulary, grammar, and conversational abilities through engaging activities and real-life scenarios. The curriculum includes reading comprehension exercises, writing assignments, and cultural discussions that explore Punjabi traditions and customs. Students will participate in group discussions and presentations to improve fluency and confidence. By the end of this course, learners will be better equipped to communicate effectively in various contexts while appreciating the rich cultural heritage of Punjabi-speaking communities.",
    "expanded_word_count": 104
  },
  {
    "id": 415,
    "course_codes": "PWR 1ST",
    "course_title": "Writing & Rhetoric 1:  The Rhetoric of Biomedical Ethics",
    "original_descr": "Rhetorical and contextual analysis of readings; research; and argument. Focus is on development of a substantive research-based argument using multiple sources. Individual conferences with instructor.  See http://www.stanford.edu/dept/undergrad/cgi-bin/drupal_ual/AP_univ_req_PWR_Courses.html.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Writing & Rhetoric 1: The Rhetoric of Biomedical Ethics\n\nIn this course, students will engage in an in-depth rhetorical and contextual analysis of selected readings in biomedical ethics. The curriculum emphasizes the development of a well-researched, substantive argument that synthesizes multiple scholarly sources. Students will learn to critically evaluate ethical dilemmas in the biomedical field and articulate their perspectives effectively. Individual conferences with the instructor provide personalized feedback and guidance to enhance writing skills. By the end of the course, students will have honed their research capabilities and argumentative strategies, preparing them for advanced discourse in both academic and professional contexts.",
    "expanded_word_count": 103
  },
  {
    "id": 437,
    "course_codes": "SNSKTLNG 3",
    "course_title": "First-Year Sanskrit, Third Quarter",
    "original_descr": "Continuation of SNSKTLNG 2. Prerequisite: SNSKTLNG 2. The completion of this course fulfills the University Language Requirement",
    "original_word_count": 17,
    "expanded_descr": "Course Title: First-Year Sanskrit, Third Quarter\n\nExpanded Description: This course serves as a continuation of SNSKTLNG 2, further enhancing students' understanding and proficiency in Sanskrit. Building on previously acquired skills, students will delve deeper into grammar, vocabulary, and sentence structure, enabling them to read and translate simple texts. Emphasis will be placed on conversational practice, fostering fluency and confidence in speaking. Additionally, the course will explore cultural and historical contexts of Sanskrit literature, enriching students’ appreciation of its significance. Successful completion of this course will fulfill the University Language Requirement and prepare students for advanced studies in language and literature.",
    "expanded_word_count": 100
  },
  {
    "id": 460,
    "course_codes": "SUSTAIN 100",
    "course_title": "Research Preparation for Undergraduates",
    "original_descr": "For undergraduates planning to conduct research during the summer with faculty in the Doerr School of Sustainability. Readings, oral presentations, proposal development.  May be repeated for credit.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Research Preparation for Undergraduates\n\nExpanded Description: This course is designed for undergraduates eager to engage in summer research alongside faculty at the Doerr School of Sustainability. Students will explore foundational research methodologies, engage in critical readings relevant to their fields, and develop effective oral presentation skills. The course emphasizes the creation of well-structured research proposals, equipping students with the tools necessary to articulate their research questions and objectives clearly. Collaborative discussions and peer feedback sessions will foster a supportive learning environment. This course may be repeated for credit, allowing students to refine their skills and explore diverse research interests over multiple terms.",
    "expanded_word_count": 104
  },
  {
    "id": 464,
    "course_codes": "SWAHLANG 3",
    "course_title": "First-Year Swahili, Third Quarter",
    "original_descr": "Continuation of SWAHLANG 2. Prerequisite: SWAHLANG 2. Fulfills the University foreign language requirement.",
    "original_word_count": 13,
    "expanded_descr": "Course Title: First-Year Swahili, Third Quarter\n\nThis course is a continuation of SWAHLANG 2, designed to deepen students' understanding of the Swahili language and culture. Building on prior knowledge, students will enhance their vocabulary, grammar, and conversational skills through interactive activities, including dialogues, role-playing, and multimedia resources. Cultural components will explore traditions, music, and literature, fostering a holistic appreciation for the Swahili-speaking world. Participation in group discussions and projects will encourage collaborative learning and practical application of language skills. Successful completion fulfills the University’s foreign language requirement, equipping students with essential communication competencies for personal and professional contexts in Swahili-speaking environments.",
    "expanded_word_count": 101
  },
  {
    "id": 473,
    "course_codes": "TURKLANG 23",
    "course_title": "Second-Year Turkish, Third Quarter",
    "original_descr": "Continuation of TURKLANG 22. The main focus is on class discussions and essay-writing practices about daily life in Turkey. End of quarter presentation in Turkish. Prerequisite: TURKLANG 22.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Second-Year Turkish, Third Quarter\n\nExpanded Description: This course serves as a continuation of TURKLANG 22, enhancing students' proficiency in Turkish through immersive class discussions and focused essay-writing exercises that explore various aspects of daily life in Turkey. Students will engage with contemporary topics, cultural nuances, and social issues, fostering a deeper understanding of Turkish society. The curriculum emphasizes active participation and encourages students to express their thoughts and perspectives in Turkish. As a culmination of their learning, students will deliver a presentation in Turkish at the end of the quarter, showcasing their language skills and insights gained throughout the course. Prerequisite: TURKLANG 22.",
    "expanded_word_count": 105
  },
  {
    "id": 474,
    "course_codes": "UKRNLANG 3",
    "course_title": "First-Year Ukrainian, Third Quarter",
    "original_descr": "Continuation of UKRNLANG 2. Prerequisite: UKRNLANG 2. Completion of this course fulfills the language requirement.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: First-Year Ukrainian, Third Quarter\n\nExpanded Description: This course serves as a continuation of UKRNLANG 2, designed for students who have successfully completed the previous level. Building on foundational skills, students will enhance their proficiency in Ukrainian through immersive language practice, focusing on advanced vocabulary, grammatical structures, and conversational fluency. Emphasis will be placed on cultural contexts, enabling students to engage with authentic texts and media. Collaborative activities, including group discussions and presentations, will foster a supportive learning environment. Successful completion of this course not only fulfills the language requirement but also equips students with essential communication skills for further language studies and cultural appreciation.",
    "expanded_word_count": 106
  },
  {
    "id": 478,
    "course_codes": "URDULANG 3",
    "course_title": "First-Year Urdu, Third Quarter",
    "original_descr": "Grammatical structures, vocabulary, and sentence patterns through speaking, reading, writing, and listening. Urdu culture.",
    "original_word_count": 14,
    "expanded_descr": "Course Title: First-Year Urdu, Third Quarter\n\nIn this immersive course, students will deepen their understanding of Urdu by exploring essential grammatical structures and expanding their vocabulary. Through engaging activities, learners will practice speaking, reading, writing, and listening skills to enhance their fluency and comprehension. The course will incorporate authentic materials, including literature and media, to expose students to the rich nuances of Urdu culture. Additionally, students will engage in conversational practice, enabling them to communicate effectively in real-life situations. By the end of this quarter, participants will possess a solid foundation in Urdu, fostering both language proficiency and cultural appreciation.",
    "expanded_word_count": 100
  },
  {
    "id": 479,
    "course_codes": "PSYC 199 / UROL 199",
    "course_title": "Undergraduate Research",
    "original_descr": "Students undertake investigations sponsored by individual faculty members. Prerequisite: consent of instructor.",
    "original_word_count": 12,
    "expanded_descr": "Course Title: Undergraduate Research\n\nIn this hands-on course, students engage in original investigative projects under the mentorship of experienced faculty members. Participants will explore various research methodologies and techniques relevant to their field of study while contributing to ongoing scholarly work. The course emphasizes critical thinking, data analysis, and effective communication of research findings through presentations and written reports. Students will gain valuable insights into the research process, enhance their problem-solving skills, and develop a deeper understanding of their disciplines. Prerequisite for enrollment is the consent of the instructor, ensuring a tailored experience that aligns with individual academic interests and goals.",
    "expanded_word_count": 101
  },
  {
    "id": 483,
    "course_codes": "YDDSHLNG 23",
    "course_title": "Second-Year Yiddish, Third Quarter",
    "original_descr": "Continuation of YDDSHLNG 22. Prerequisite: YDDSHLNG 22.",
    "original_word_count": 7,
    "expanded_descr": "Course Title: Second-Year Yiddish, Third Quarter\n\nThis course serves as a continuation of YDDSHLNG 22, focusing on advancing students' proficiency in the Yiddish language. Building on previously acquired skills, students will engage in immersive activities that enhance conversational fluency, reading comprehension, and cultural understanding. Through interactive exercises, literary analysis of Yiddish texts, and multimedia resources, learners will explore themes of identity, history, and tradition within Yiddish culture. Additionally, students will participate in group discussions and presentations to foster collaborative learning. By the end of the quarter, participants will have a deeper appreciation for Yiddish language and culture, preparing them for further studies.",
    "expanded_word_count": 102
  },
  {
    "id": 485,
    "course_codes": "AA 240B",
    "course_title": "Analysis of Structures",
    "original_descr": "Finite deformations: strain and stress measures, balance laws, and constitutive models. Plasticity and fracture. Introduction to finite element analysis.",
    "original_word_count": 19,
    "expanded_descr": "In the Analysis of Structures course, students will delve into the intricate world of finite deformations, exploring essential concepts such as strain and stress measures, as well as the fundamental balance laws governing structural integrity. The curriculum includes an in-depth study of constitutive models, focusing on plasticity and fracture mechanics to understand material behavior under various loading conditions. Furthermore, students will receive a comprehensive introduction to finite element analysis (FEA), equipping them with the skills to model and solve complex structural problems. Through theoretical discussions and practical applications, participants will develop a robust foundation for analyzing and designing safe, efficient structures.",
    "expanded_word_count": 101
  },
  {
    "id": 488,
    "course_codes": "ANES 299",
    "course_title": "Directed Reading in Anesthesiology",
    "original_descr": "Prerequisite: consent of instructor.",
    "original_word_count": 4,
    "expanded_descr": "Course Title: Directed Reading in Anesthesiology\n\nExpanded Description: This course offers an in-depth exploration of anesthesiology through curated readings and discussions, tailored to individual interests and academic goals. Students will engage with seminal texts, contemporary research, and clinical case studies under the guidance of a faculty mentor. Emphasis will be placed on critical analysis, synthesis of information, and application of theoretical knowledge to practical scenarios in anesthesiology. Participants will develop a comprehensive understanding of anesthetic techniques, pharmacology, and patient safety. The course culminates in a presentation, allowing students to showcase their insights and foster dialogue among peers, enhancing their learning experience and professional development.",
    "expanded_word_count": 104
  },
  {
    "id": 499,
    "course_codes": "APPPHYS 483",
    "course_title": "Optics and Electronics Seminar",
    "original_descr": "Current research topics in lasers, quantum electronics, optics, and photonics by faculty, students, and invited outside speakers. May be repeated for credit.",
    "original_word_count": 22,
    "expanded_descr": "Course Title: Optics and Electronics Seminar\n\nExpanded Description: This seminar offers an in-depth exploration of cutting-edge research topics in lasers, quantum electronics, optics, and photonics. Students will engage with presentations from faculty, fellow students, and esteemed invited speakers from both academia and industry, fostering a collaborative learning environment. The seminar will cover recent advancements, innovative applications, and theoretical foundations, encouraging critical discussion and questions. Participants will gain insights into ongoing research projects and emerging technologies, enhancing their understanding of the field. This course may be repeated for credit, allowing students to deepen their knowledge and stay current with evolving trends in optics and electronics.",
    "expanded_word_count": 104
  },
  {
    "id": 502,
    "course_codes": "ARTHIST 467 / FILMEDIA 467",
    "course_title": "Intimacies as Method: Studying Black and Brown Relation",
    "original_descr": "Intimacies as Method: Studying Black and Brown Relation",
    "original_word_count": 8,
    "expanded_descr": "In \"Intimacies as Method: Studying Black and Brown Relation,\" students will explore the intricate dynamics of relationships within Black and Brown communities. This course examines how intimacy shapes cultural identities, social structures, and resistance practices. Through a combination of theoretical frameworks, case studies, and personal narratives, participants will engage in critical discussions about the significance of relationality in understanding lived experiences. Students will also analyze various forms of intimacy—familial, communal, and political—while employing methods that prioritize empathy and connection. By the end of the course, students will develop a nuanced appreciation of intimacy as a vital tool for social inquiry and activism.",
    "expanded_word_count": 102
  },
  {
    "id": 546,
    "course_codes": "CHEM 299",
    "course_title": "Teaching of Chemistry",
    "original_descr": "Required of all teaching assistants in Chemistry. Techniques of teaching chemistry by means of lectures and labs.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Teaching of Chemistry\n\nExpanded Description: This course is essential for all teaching assistants in the Chemistry department, focusing on effective instructional strategies tailored for chemistry education. Participants will explore various teaching methodologies, including lecture design, interactive learning, and laboratory instruction. Emphasis will be placed on fostering critical thinking and problem-solving skills among students. Through hands-on workshops, teaching assistants will develop lesson plans, engage in peer teaching, and receive constructive feedback. Additionally, the course will cover assessment techniques and student engagement strategies to create a dynamic learning environment. By the end, participants will be equipped to inspire and educate future chemists effectively.",
    "expanded_word_count": 103
  },
  {
    "id": 547,
    "course_codes": "CHEM 300 / PHYSICS 302",
    "course_title": "Department Colloquium",
    "original_descr": "Required of graduate students. May be repeated for credit.",
    "original_word_count": 9,
    "expanded_descr": "Course Title: Department Colloquium\n\nExpanded Description: The Department Colloquium is a vital component of the graduate program, designed to enhance students' academic experience and professional development. This course offers a platform for students to engage with faculty and guest speakers, explore current research topics, and participate in discussions that foster critical thinking. Students will present their own research and receive constructive feedback, honing their presentation skills and academic discourse. The colloquium encourages networking and collaboration among peers, making it an invaluable opportunity for intellectual growth. Enrollment is required for all graduate students and can be repeated for additional credit throughout their studies.",
    "expanded_word_count": 102
  },
  {
    "id": 542,
    "course_codes": "CHEM 275",
    "course_title": "Quantum mechanics with spectroscopy examples",
    "original_descr": "Quantum mechanics with examples related to spectroscopy. Includes time dependent perturbation theory, matrix formalism, density matrix formalism and angular momentum.  Required: CHEM 271 or equivalent quantum mechanics course.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Quantum Mechanics with Spectroscopy Examples\n\nThis course delves into the principles of quantum mechanics, emphasizing applications in spectroscopy. Students will explore fundamental concepts such as time-dependent perturbation theory, matrix formalism, and density matrix formalism, which are crucial for understanding quantum systems. Additionally, the course will cover angular momentum, providing students with a comprehensive framework to analyze quantum phenomena. Through a combination of theoretical lectures and practical examples from various spectroscopic techniques, students will gain insight into how quantum mechanics underpins the behavior of molecules and atoms. Prerequisite: CHEM 271 or an equivalent course in quantum mechanics is required for enrollment.",
    "expanded_word_count": 102
  },
  {
    "id": 549,
    "course_codes": "CHEMENG 699",
    "course_title": "Colloquium",
    "original_descr": "Weekly lectures by experts from academia and industry in the field of chemical engineering. Course may be repeated for credit.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Colloquium\n\nExpanded Description: The Colloquium course offers students a unique opportunity to engage with weekly lectures delivered by esteemed experts in chemical engineering from both academia and industry. Each session will explore cutting-edge research, innovative technologies, and real-world applications that shape the future of the field. Students will not only gain insights into current trends and challenges but also participate in discussions that foster critical thinking and networking opportunities. This course encourages active participation and reflection on topics presented, enhancing students’ understanding and appreciation of chemical engineering. Students may repeat this course for additional credit, enriching their learning experience.",
    "expanded_word_count": 101
  },
  {
    "id": 553,
    "course_codes": "CME 300Q",
    "course_title": "ICME QUALIFYING EXAMS WORKSHOP",
    "original_descr": "Prepares ICME students for the qualifying exams by reviewing relevant course topics and problem solving strategies. Senior ICME students share experiences and lead discussions revolving around ICME core courses.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: ICME QUALIFYING EXAMS WORKSHOP\n\nExpanded Description: This intensive workshop is designed to equip ICME students with the skills necessary to excel in their qualifying exams. Participants will engage in comprehensive reviews of essential topics across core courses, enhancing their understanding and reinforcing critical concepts. Experienced senior ICME students will lead interactive discussions, sharing invaluable insights and personal strategies for effective problem solving. Through collaborative problem-solving sessions and peer support, students will gain confidence and clarity in their approach to exam preparation. This workshop fosters a supportive learning environment, encouraging students to ask questions, share challenges, and develop effective study techniques for academic success.",
    "expanded_word_count": 105
  },
  {
    "id": 556,
    "course_codes": "COMM 308 / POLISCI 321 / PSYCH 284",
    "course_title": "Graduate Seminar in Political Psychology",
    "original_descr": "For students interested in research in political science, psychology, or communication. Methodological techniques for studying political attitudes and behaviors. May be repeated for credit.",
    "original_word_count": 24,
    "expanded_descr": "Course Title: Graduate Seminar in Political Psychology\n\nIn this dynamic seminar, students delve into the intersection of political science, psychology, and communication, exploring the psychological underpinnings of political attitudes and behaviors. Through a combination of theoretical frameworks and empirical research, participants will engage with various methodological techniques, including surveys, experiments, and qualitative analyses. Students will critically evaluate existing literature and design their own research projects, fostering a deep understanding of how psychological factors shape political decision-making. This course encourages collaboration and discussion, making it an enriching experience for those aiming to advance their knowledge and skills in political psychology. May be repeated for credit.",
    "expanded_word_count": 104
  },
  {
    "id": 570,
    "course_codes": "CS 355",
    "course_title": "Advanced Topics in Cryptography",
    "original_descr": "Topics: Pseudo randomness, multiparty computation, pairing-based and lattice-based cryptography, zero knowledge protocols, and new encryption and integrity paradigms. May be repeated for credit. Prerequisite: CS255.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: Advanced Topics in Cryptography\n\nExpanded Description: This course delves into sophisticated concepts in cryptography, emphasizing the role of pseudo randomness in secure systems. Students will explore multiparty computation techniques that enable collaborative data processing without compromising privacy. The curriculum includes an in-depth study of pairing-based and lattice-based cryptography, which are pivotal in modern cryptographic schemes. Additionally, participants will learn about zero-knowledge protocols that ensure information security without revealing the data itself. The course also introduces emerging encryption and integrity paradigms, fostering critical thinking and innovation. Prerequisite knowledge from CS255 is required. This course may be repeated for credit to deepen understanding.",
    "expanded_word_count": 103
  },
  {
    "id": 590,
    "course_codes": "ECON 300",
    "course_title": "Third-Year Seminar",
    "original_descr": "Restricted to Economics Ph.D. students. Students present current research. May be repeated for credit.",
    "original_word_count": 14,
    "expanded_descr": "Course Title: Third-Year Seminar\n\nExpanded Description: This seminar is exclusively designed for Economics Ph.D. students, fostering a collaborative environment where participants present and critique ongoing research projects. Students will engage deeply with contemporary economic theories and methodologies, enhancing their analytical and presentation skills. Each session encourages constructive feedback, promoting scholarly dialogue and peer learning. Additionally, students will explore various research topics, refining their own work while gaining insights from colleagues. The seminar can be taken multiple times for credit, allowing for continuous growth and development in research acumen. This course is essential for cultivating a robust academic foundation in economics research.",
    "expanded_word_count": 101
  },
  {
    "id": 591,
    "course_codes": "ECON 310",
    "course_title": "Macroeconomic Seminar",
    "original_descr": "Macroeconomic Seminar. Prerequisites: Econ 210, Econ 211 and Econ 212. To obtain credit, enrolled students need to satisfy the macro field presentation requirements.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Macroeconomic Seminar\n\nExpanded Description: The Macroeconomic Seminar offers an in-depth exploration of advanced macroeconomic theories and their real-world applications. Building on foundational knowledge from Econ 210, Econ 211, and Econ 212, students will engage in rigorous discussions and critical analyses of current macroeconomic issues. The seminar format encourages active participation, requiring students to prepare and deliver presentations focused on specific macroeconomic topics. Participants will enhance their research skills and deepen their understanding of economic indicators, policy implications, and global economic trends. Successful completion of the presentation requirements is essential for earning credit, fostering both academic and professional growth in economics.",
    "expanded_word_count": 102
  },
  {
    "id": 592,
    "course_codes": "ECON 315 / ECON 355 / ECON 370",
    "course_title": "Development Seminar",
    "original_descr": "Information and meeting times are available on the Department of Economics Website: https://economics.stanford.edu/seminars-events/list-seminars",
    "original_word_count": 13,
    "expanded_descr": "Course Title: Development Seminar\n\nExpanded Description: The Development Seminar offers students a dynamic platform to explore contemporary issues in economic development through a series of expert-led discussions and presentations. Participants will engage with leading researchers and practitioners in the field, examining topics such as poverty alleviation, sustainable growth, and policy interventions. This seminar encourages critical thinking and collaborative learning, allowing students to analyze real-world case studies and theoretical frameworks. Attendance and active participation are essential, as students will gain invaluable insights into the complexities of economic development. For schedules and additional information, please visit the Department of Economics website: https://economics.stanford.edu/seminars-events/list-seminars.",
    "expanded_word_count": 100
  },
  {
    "id": 593,
    "course_codes": "ECON 335",
    "course_title": "Experimental/Behavioral Seminar",
    "original_descr": "Field seminar in experimental and behavioral economics.",
    "original_word_count": 7,
    "expanded_descr": "Course Title: Experimental/Behavioral Seminar\n\nThis seminar offers an in-depth exploration of experimental and behavioral economics, focusing on the intersection of psychology and economic decision-making. Students will engage with cutting-edge research methodologies, including laboratory and field experiments, to investigate how psychological factors influence economic behavior. Through discussions of seminal studies and contemporary findings, participants will learn to design their own experiments, analyze data, and critically evaluate results. The course emphasizes real-world applications, encouraging students to consider policy implications of behavioral insights. By the end, students will have a robust understanding of how experimental economics can inform better decision-making in various contexts.",
    "expanded_word_count": 100
  },
  {
    "id": 602,
    "course_codes": "EDUC 456 / SOC 210",
    "course_title": "Seminar in Organizations and Institutions",
    "original_descr": "This seminar considers ongoing work in organization studies through a speaker series featuring Stanford faculty, visiting scholars, and guests from academic institutions throughout North America and elsewhere.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Seminar in Organizations and Institutions\n\nExpanded Description: This engaging seminar delves into contemporary research in organization studies, fostering a dynamic learning environment through an interactive speaker series. Students will have the unique opportunity to hear from Stanford faculty, distinguished visiting scholars, and prominent guests from various academic institutions across North America and beyond. Each session will focus on cutting-edge topics, theories, and methodologies pertinent to organizational behavior, institutional dynamics, and management practices. Participants will critically analyze the implications of these insights, encouraging robust discussions and collaborative learning, and enhancing their understanding of how organizations operate within complex institutional frameworks.",
    "expanded_word_count": 101
  },
  {
    "id": 617,
    "course_codes": "ENERGY 352",
    "course_title": "ESE Graduate Seminar",
    "original_descr": "Current research topics. Presentations by guest speakers from Stanford and elsewhere. May be repeated for credit.",
    "original_word_count": 16,
    "expanded_descr": "Course Title: ESE Graduate Seminar\n\nExpanded Description: The ESE Graduate Seminar offers an engaging platform for students to explore cutting-edge research topics in electrical and systems engineering. Through a series of presentations by esteemed guest speakers from Stanford University and other leading institutions, students will gain insights into current advancements and methodologies in the field. This seminar encourages active participation and critical discussion, allowing students to deepen their understanding of complex concepts and emerging technologies. By attending, students will not only enhance their academic knowledge but also expand their professional networks. The course may be repeated for credit, enabling ongoing exploration of evolving subjects.",
    "expanded_word_count": 104
  },
  {
    "id": 622,
    "course_codes": "ESOLLANG 698A",
    "course_title": "Writing Academic English",
    "original_descr": "Strategies and conventions for graduate writing. Emphasis is placed on fluency, organization, documentation, and appropriateness for writing tasks required in coursework.  May be repeated once for credit.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Writing Academic English\n\nExpanded Description: This course provides graduate students with essential strategies and conventions for mastering academic writing. Students will focus on developing fluency in their writing style, organizing ideas cohesively, and adhering to proper documentation practices. Emphasis will be placed on the specific writing tasks required in various coursework, including research papers, essays, and presentations. Through guided practice, peer reviews, and instructor feedback, students will refine their skills and learn to tailor their writing to diverse academic audiences. This course may be repeated once for additional credit, allowing for continued growth and deeper exploration of academic writing techniques.",
    "expanded_word_count": 102
  },
  {
    "id": 634,
    "course_codes": "INDE 254",
    "course_title": "Advanced English for Non-Native Speakers",
    "original_descr": "Course designed to refine the proficiency and fluency in academic speaking and writing for non-native English speakers.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Advanced English for Non-Native Speakers\n\nThis comprehensive course is tailored for non-native English speakers seeking to elevate their academic speaking and writing skills to a professional level. Students will engage in intensive practice sessions focusing on advanced vocabulary, complex sentence structures, and effective argumentation techniques. Through interactive discussions, peer reviews, and presentations, participants will enhance their fluency and confidence in articulating ideas clearly. Additionally, the course will cover academic writing conventions, including thesis development and citation practices. By the end, students will be equipped with the tools necessary to succeed in an English-speaking academic environment and communicate effectively in diverse contexts.",
    "expanded_word_count": 103
  },
  {
    "id": 675,
    "course_codes": "PHYSICS 373",
    "course_title": "Condensed Matter Theory II",
    "original_descr": "Superfluidity and superconductivity. Quantum magnetism. Prerequisite: PHYSICS 372.",
    "original_word_count": 8,
    "expanded_descr": "Course Title: Condensed Matter Theory II\n\nExpanded Description: In Condensed Matter Theory II, students will delve into advanced topics such as superfluidity and superconductivity, exploring the underlying quantum mechanical principles that govern these fascinating phenomena. The course will also examine quantum magnetism, including the behavior of magnetic materials at the quantum level. Through a combination of theoretical framework and practical applications, students will develop a deeper understanding of how quantum effects influence macroscopic properties in condensed matter systems. Prerequisite knowledge from PHYSICS 372 is essential, ensuring that participants are prepared to engage with complex concepts and contribute to discussions on cutting-edge research in condensed matter physics.",
    "expanded_word_count": 106
  },
  {
    "id": 682,
    "course_codes": "PSYCH 235",
    "course_title": "Human Motivation",
    "original_descr": "This graduate seminar will explore social-cognitive perspectives on motivation and emotion. Meetings will be discussion based. Prerequisites: Psychology 207 and consent of instructor.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Human Motivation\n\nExpanded Description: This graduate seminar delves into the intricate dynamics of human motivation and emotion through social-cognitive perspectives. Students will engage in lively discussions, analyzing foundational theories and contemporary research that illuminate the psychological mechanisms driving behavior. Key topics include the interplay between intrinsic and extrinsic motivators, emotional regulation, and goal-setting strategies. Through collaborative discourse and critical analysis of case studies, participants will deepen their understanding of how motivation influences personal and social outcomes. Prerequisites include Psychology 207 and instructor consent, ensuring students are well-prepared to contribute to discussions and apply concepts to real-world situations effectively.",
    "expanded_word_count": 100
  },
  {
    "id": 683,
    "course_codes": "PSYCH 257",
    "course_title": "Affective Neuroscience",
    "original_descr": "Theory and research. Comparative and human research approaches map affective function to neuroanatomical and neurochemical substrates. Prerequisite: consent of instructor.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Affective Neuroscience\n\nThis course delves into the intricate relationship between emotions and brain function, emphasizing both theoretical frameworks and empirical research. Students will explore various methodologies, comparing findings from human studies with those from animal models to understand how affective processes are represented within neuroanatomical and neurochemical systems. Key topics include the neural correlates of emotion, the impact of neurotransmitters, and the evolutionary significance of affective responses. Through lectures, discussions, and hands-on research projects, students will critically analyze current literature and contribute to ongoing debates in the field. Enrollment requires the consent of the instructor, ensuring a focused learning environment.",
    "expanded_word_count": 102
  },
  {
    "id": 750,
    "course_codes": "LAW 1010",
    "course_title": "Corporate Income Taxation",
    "original_descr": "This course will cover the basic principles and rules regarding the taxation of domestic corporations. Elements used in grading: attendance, class participation, and final exam.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: Corporate Income Taxation\n\nExpanded Description: This comprehensive course delves into the fundamental principles and regulations governing the taxation of domestic corporations. Students will explore key topics such as taxable income determination, deductions, tax credits, and the implications of corporate tax structures. Through engaging lectures and interactive discussions, participants will gain a solid understanding of tax compliance, planning strategies, and the impact of tax legislation on corporate operations. Grading will be based on attendance, active participation in discussions, and a final exam that assesses students' grasp of course material. This course is essential for those pursuing careers in accounting, finance, and corporate law.",
    "expanded_word_count": 104
  },
  {
    "id": 875,
    "course_codes": "CHINA 168 / CHINA 268",
    "course_title": "The Chinese Family",
    "original_descr": "History and literature. Institutional, ritual, affective, and symbolic aspects. Perspectives of gender, class, and social change.",
    "original_word_count": 16,
    "expanded_descr": "Course Title: The Chinese Family\n\nThis course delves into the intricate history and literature surrounding the Chinese family, exploring its institutional, ritualistic, affective, and symbolic dimensions. Students will examine how gender roles, class structures, and social changes shape family dynamics across different historical periods. Through an analysis of literary texts, historical documents, and contemporary case studies, participants will gain insights into the evolving roles within the family unit, including the impact of modernization and globalization. Engaging discussions and collaborative projects will encourage students to critically reflect on the significance of family in Chinese society and its broader implications in a global context.",
    "expanded_word_count": 102
  },
  {
    "id": 922,
    "course_codes": "CZECLANG 23",
    "course_title": "Second-Year Czech, Third Quarter",
    "original_descr": "Continuation of CZECLANG 22. Prerequisite: CZECLANG 22.",
    "original_word_count": 7,
    "expanded_descr": "Course Title: Second-Year Czech, Third Quarter\n\nThis course serves as a continuation of CZECLANG 22, building on the foundational skills developed in previous semesters. Students will enhance their proficiency in Czech through immersive activities that involve reading, writing, listening, and speaking. The curriculum focuses on expanding vocabulary, mastering complex grammatical structures, and improving conversational fluency. Cultural elements will be integrated, allowing students to explore Czech traditions, literature, and contemporary issues. Engaging group discussions, multimedia resources, and practical exercises will foster a collaborative learning environment. Prerequisite: Successful completion of CZECLANG 22 is required to ensure readiness for the advanced topics covered in this course.",
    "expanded_word_count": 103
  },
  {
    "id": 970,
    "course_codes": "ENGLISH 292",
    "course_title": "Advanced Poetry Writing",
    "original_descr": "The focus of the course will be both on the generation of new work and on strategies to solve artistic problems through studies in poetic craft.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Advanced Poetry Writing\n\nIn this immersive course, students will delve into the intricacies of poetic craft, focusing on generating innovative new work while tackling common artistic challenges. Participants will explore various techniques, such as imagery, sound, and form, to enhance their writing. Through peer critiques and guided discussions, students will refine their voice and style, learning to articulate and resolve creative obstacles effectively. Additionally, the course will include analyses of contemporary and classic poetry, providing inspiration and context for their own writing. By the end, students will cultivate a robust portfolio and gain confidence in their poetic abilities.",
    "expanded_word_count": 100
  },
  {
    "id": 980,
    "course_codes": "ESS 108",
    "course_title": "Research Preparation for Undergraduates",
    "original_descr": "For undergraduates planning to conduct research during the summer with faculty through the MUIR and SUPER programs. Readings, oral presentations, proposal development. May be repeated for credit.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Research Preparation for Undergraduates\n\nExpanded Description: This course is designed for undergraduates eager to engage in research during the summer with faculty mentors through the MUIR and SUPER programs. Students will explore essential research methodologies, participate in critical readings, and enhance their communication skills through oral presentations. Emphasis will be placed on developing a compelling research proposal, equipping students with the tools needed to articulate their research ideas effectively. Collaborative discussions and peer feedback will foster a supportive learning environment. This course may be repeated for credit, allowing students to refine their skills and pursue diverse research interests throughout their academic journey.",
    "expanded_word_count": 104
  },
  {
    "id": 993,
    "course_codes": "FILMEDIA 290 / FILMEDIA 490",
    "course_title": "Movies and Methods: Coming of Age Films",
    "original_descr": "TBD. Limited in size. Preference given to film and media studies seniors.",
    "original_word_count": 12,
    "expanded_descr": "Course Title: Movies and Methods: Coming of Age Films\n\nThis course delves into the rich genre of coming-of-age films, exploring their themes, narrative techniques, and cultural significance. Students will analyze a curated selection of films that capture the complexities of adolescence and personal growth, examining how filmmakers portray identity, relationships, and societal challenges. Through discussions, screenings, and critical essays, participants will develop a deeper understanding of cinematic storytelling and its impact on viewers. Limited in size to foster in-depth dialogue, this course prioritizes film and media studies seniors, encouraging them to engage critically with both classic and contemporary works in this compelling genre.",
    "expanded_word_count": 103
  },
  {
    "id": 1046,
    "course_codes": "MATH 108",
    "course_title": "Introduction to Combinatorics and Its Applications",
    "original_descr": "Topics: graphs, trees (Cayley's Theorem, application to phylogony), eigenvalues, basic enumeration (permutations, Stirling and Bell numbers), recurrences, generating functions, basic asymptotics.",
    "original_word_count": 21,
    "expanded_descr": "Course Description: This course serves as a comprehensive introduction to combinatorics, exploring fundamental concepts and their diverse applications. Students will delve into graph theory, including the study of trees and Cayley's Theorem, with practical applications in phylogeny. The curriculum covers eigenvalues relevant to combinatorial structures, basic enumeration techniques such as permutations, and the use of Stirling and Bell numbers. Students will learn to solve recurrences and utilize generating functions as powerful tools for counting and analysis. Additionally, the course introduces basic asymptotic analysis, equipping students with essential skills to tackle complex combinatorial problems and real-world scenarios effectively.",
    "expanded_word_count": 97
  },
  {
    "id": 1040,
    "course_codes": "JAPAN 164 / JAPAN 264",
    "course_title": "Introduction to Premodern Japanese",
    "original_descr": "Readings from Heian, Kamakura, Muromachi, and early Edo periods with focus on grammar and reading comprehension. Prerequisite: JAPANLNG 129B or 103, or equivalent.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Introduction to Premodern Japanese\n\nThis course offers an in-depth exploration of readings from pivotal periods in Japanese history, including the Heian, Kamakura, Muromachi, and early Edo eras. Students will engage with a variety of texts, focusing on enhancing their understanding of classical Japanese grammar and improving reading comprehension skills. Emphasis will be placed on linguistic structures, historical context, and literary themes that shaped premodern Japanese culture. Through guided analysis and discussion, learners will develop a deeper appreciation for the intricacies of the language and its evolution. Prerequisites include JAPANLNG 129B or 103, or an equivalent background in Japanese language studies.",
    "expanded_word_count": 102
  },
  {
    "id": 1045,
    "course_codes": "MATH 106",
    "course_title": "Functions of a Complex Variable",
    "original_descr": "Complex numbers, analytic functions, Cauchy-Riemann equations, complex integration, Cauchy integral formula, residues, elementary conformal mappings. (Math 116 offers a more theoretical treatment).",
    "original_word_count": 22,
    "expanded_descr": "Course Title: Functions of a Complex Variable\n\nExpanded Description: This course delves into the fascinating world of complex numbers and their applications in mathematics. Students will explore analytic functions and the pivotal Cauchy-Riemann equations, which establish the foundation for differentiability in complex analysis. Through rigorous study of complex integration, the course highlights the Cauchy integral formula and its implications. Additionally, learners will investigate the concept of residues and their significance in evaluating integrals. The curriculum will also cover elementary conformal mappings, showcasing their transformative properties. This course is ideal for those seeking practical applications of complex analysis while enhancing their analytical skills in this rich mathematical field.",
    "expanded_word_count": 107
  },
  {
    "id": 1049,
    "course_codes": "MATH 147",
    "course_title": "Differential Topology",
    "original_descr": "Introduction to smooth methods in topology including tranvsersality, intersection number, fixed point theorems, as well as differential forms and integration. Prerequisites: Math 144 or equivalent.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: Differential Topology\n\nExpanded Description: This course provides an in-depth introduction to the rich field of differential topology, focusing on smooth methods that illuminate the structure of manifolds. Students will explore essential concepts such as transversality, which facilitates the study of intersections within manifolds, and the intersection number, a fundamental invariant in topology. Additionally, the course covers fixed point theorems that have applications in various mathematical contexts. Emphasis is placed on differential forms and their role in integration on manifolds, equipping students with the necessary tools for advanced study. Prerequisites include Math 144 or an equivalent foundational course in mathematics.",
    "expanded_word_count": 101
  },
  {
    "id": 1065,
    "course_codes": "MS&E 180",
    "course_title": "Organizations: Theory and Management",
    "original_descr": "For undergraduates only. Classical and contemporary organization theory; the behavior of individuals, groups, and organizations. Limited enrollment; preference to declared MS&E majors and seniors from other departments.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Organizations: Theory and Management\n\nExpanded Description: This undergraduate course explores both classical and contemporary organization theories, focusing on the dynamics of individual and group behavior within various organizational contexts. Students will engage in critical analysis of different management styles and organizational structures, examining how they influence performance and employee satisfaction. Through case studies, group discussions, and practical applications, participants will gain insights into real-world organizational challenges and strategies. The course is designed for a limited number of students, prioritizing declared Management Science and Engineering majors and senior students from other disciplines, ensuring a rich learning environment that fosters diverse perspectives.",
    "expanded_word_count": 102
  },
  {
    "id": 1071,
    "course_codes": "MUSIC 74C",
    "course_title": "Classical Guitar Class",
    "original_descr": "May be repeated for credit a total of 14 times. Zero unit enrollment option available with instructor permission. See website: (http://music.stanford.edu) for policy and procedure.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: Classical Guitar Class\n\nExpanded Description: This engaging Classical Guitar Class is designed for students of all skill levels, offering a comprehensive exploration of classical guitar techniques, repertoire, and performance practices. Students will learn fundamental skills, including fingerstyle techniques, sight-reading, and music theory, while developing a diverse repertoire that spans various historical periods and styles. The course encourages creativity and individual expression through group performances and collaborative projects. With opportunities to repeat the course for credit up to 14 times, students can deepen their understanding and mastery of the instrument. A zero-unit enrollment option is also available with instructor permission. Visit our website for details.",
    "expanded_word_count": 106
  },
  {
    "id": 1076,
    "course_codes": "MUSIC 122C",
    "course_title": "Introduction to Post-Tonal Analysis",
    "original_descr": "Survey and analysis of a broad array of 20th-century examples, including compositional options.  Prerequisites: MUSIC 23 and MUSIC 24C; passing piano-proficiency examination; or, consent of instructor.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Introduction to Post-Tonal Analysis\n\nExpanded Description: This course offers an in-depth exploration of post-tonal music, focusing on a diverse selection of 20th-century compositions. Students will engage in critical analysis of various musical styles and techniques, examining the compositional choices made by influential composers. Topics of study include twelve-tone techniques, atonality, modal systems, and contemporary harmonic structures. Through listening assignments, score analysis, and practical exercises, students will develop analytical skills necessary to interpret and understand modern music. Prerequisites include successful completion of MUSIC 23 and MUSIC 24C, along with passing a piano-proficiency examination or obtaining consent from the instructor for enrollment.",
    "expanded_word_count": 102
  },
  {
    "id": 1085,
    "course_codes": "NVJOLANG 23",
    "course_title": "Second-Year Navajo, Third Quarter",
    "original_descr": "Second-Year Navajo - third in series with NVJOLANG 21 and 22.",
    "original_word_count": 11,
    "expanded_descr": "Course Title: Second-Year Navajo, Third Quarter\n\nThis course, the third in the Second-Year Navajo series, builds upon the foundational skills acquired in NVJOLANG 21 and 22. Students will deepen their understanding of Navajo language structures, vocabulary, and cultural nuances through interactive lessons, storytelling, and immersive activities. Emphasis will be placed on developing conversational proficiency and reading comprehension, alongside exploring traditional narratives and contemporary contexts. Participants will engage in collaborative exercises that foster linguistic confidence while also gaining insights into Navajo culture, history, and customs. By the end of the course, students will enhance their ability to communicate effectively in Navajo and appreciate its rich heritage.",
    "expanded_word_count": 105
  },
  {
    "id": 1091,
    "course_codes": "OUTDOOR 12",
    "course_title": "Indoor Lead Climbing",
    "original_descr": "Learn technical and safety skills pertaining to sport lead climibing. Apply specific physical and mental training principals to assist improving lead climbing performance and preventing over use injuries.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Indoor Lead Climbing\n\nExpanded Description: This course focuses on the essential technical and safety skills required for sport lead climbing in an indoor environment. Students will engage in hands-on training that emphasizes proper belaying techniques, clip placement, and fall management. Additionally, participants will explore targeted physical conditioning exercises and mental strategies designed to enhance climbing performance and resilience. The curriculum includes injury prevention tactics, ensuring climbers understand their bodies' limits and how to avoid overuse injuries. By the end of the course, students will feel confident in their abilities to lead climb safely and effectively, ready to tackle more challenging routes.",
    "expanded_word_count": 103
  },
  {
    "id": 1095,
    "course_codes": "PERSLANG 103",
    "course_title": "Third-Year Persian, Third Quarter",
    "original_descr": "Continuation of PERSLANG 102. Prerequisite: Placement Test, PERSLANG 102.",
    "original_word_count": 9,
    "expanded_descr": "Course Title: Third-Year Persian, Third Quarter\n\nExpanded Description: This course serves as a continuation of PERSLANG 102, designed for students who have successfully completed the prerequisite or placed into this level through a placement test. Throughout the quarter, students will deepen their understanding of Persian language structures, vocabulary, and cultural nuances. Emphasis will be placed on advanced reading, writing, and conversational skills, enabling students to engage with a variety of texts and discussions. Multimedia resources, literary works, and contemporary Persian media will enrich the learning experience. Students will also explore aspects of Persian culture, enhancing their language proficiency and cultural appreciation.",
    "expanded_word_count": 101
  },
  {
    "id": 1097,
    "course_codes": "PHIL 138W / PHIL 238W",
    "course_title": "The History of Analytic Philosophy: 1884-1953",
    "original_descr": "A survey of foundational texts from the early analytic period, with primary readings from Frege, Russell, Moore, Wittgenstein, Ramsey, Carnap, Strawson and Quine. Pre-requisite: at least one philosophy class.",
    "original_word_count": 29,
    "expanded_descr": "This course offers an in-depth survey of the foundational texts that shaped analytic philosophy from 1884 to 1953. Students will engage critically with primary readings from key philosophers, including Frege, Russell, Moore, Wittgenstein, Ramsey, Carnap, Strawson, and Quine. Through rigorous analysis and discussion, participants will explore pivotal concepts such as meaning, reference, and logical structure, while examining the philosophical shifts that influenced contemporary thought. The course emphasizes the development of analytical techniques and their implications for various philosophical inquiries. A prerequisite of at least one philosophy class ensures that students are prepared for this intellectually stimulating journey into analytic tradition.",
    "expanded_word_count": 100
  },
  {
    "id": 1101,
    "course_codes": "PHIL 173A / PHIL 273A",
    "course_title": "Moral Psychology",
    "original_descr": "Grads enroll in 273A.",
    "original_word_count": 4,
    "expanded_descr": "Course Title: Moral Psychology\n\nExpanded Description: This course, designated as 273A for graduate students, delves into the intricate relationship between moral reasoning and psychological processes. Students will explore foundational theories of moral development, the role of emotions in ethical decision-making, and the impact of social influences on moral behavior. Through engaging discussions and critical analyses of contemporary research, participants will examine case studies that illustrate moral dilemmas in various contexts. The course encourages students to reflect on their moral beliefs and consider how psychological principles shape our understanding of morality. By the end, students will gain valuable insights applicable to both personal and professional realms.",
    "expanded_word_count": 105
  },
  {
    "id": 1133,
    "course_codes": "PSYCH 95",
    "course_title": "Introduction to Abnormal Psychology",
    "original_descr": "Theories of and approaches to understanding the phenomenology, etiology, and treatment of psychological disorders among adults and children. Research findings and diagnostic issues. Recommended: PSYCH 1.",
    "original_word_count": 26,
    "expanded_descr": "In \"Introduction to Abnormal Psychology,\" students will explore the complexities of psychological disorders affecting both adults and children. This course emphasizes various theoretical frameworks and approaches to understanding the phenomenology—how disorders manifest—and the etiology, or underlying causes, of mental health issues. Students will engage with current research findings, examining diagnostic criteria and methodologies for assessing psychological disorders. Additionally, the course will cover contemporary treatment options, including psychotherapeutic and pharmacological interventions. Through case studies, discussions, and critical analysis, students will develop a comprehensive understanding of abnormal psychology, equipping them with knowledge applicable to real-world mental health contexts. Recommended: PSYCH 1.",
    "expanded_word_count": 99
  },
  {
    "id": 1138,
    "course_codes": "PSYCH 183",
    "course_title": "SPARQ Lab",
    "original_descr": "Join SPARQ (Social Psychological Answers to Real-world Questions) as a research assistant and help with projects addressing real-world issues.",
    "original_word_count": 19,
    "expanded_descr": "Course Description: \n\nJoin SPARQ (Social Psychological Answers to Real-world Questions) as a research assistant and engage in meaningful projects that address pressing real-world issues through the lens of social psychology. In this hands-on course, you'll collaborate with faculty and peers to design, implement, and analyze research studies that tackle topics such as social justice, health behaviors, and community dynamics. Students will develop critical research skills, learn data collection methods, and gain experience in statistical analysis. This opportunity not only enhances your understanding of social psychological principles but also empowers you to contribute to impactful solutions in society, fostering both personal and professional growth.",
    "expanded_word_count": 103
  },
  {
    "id": 1169,
    "course_codes": "RUSSLANG 103",
    "course_title": "Third-Year Russian, Third Quarter",
    "original_descr": "Continuation of RUSSLANG 102. A snapshot of Russian life. Reading comprehension, conversational competence, grammatical accuracy, and cultural sophistication. Prerequisite: Placement Test or RUSSLANG 102.",
    "original_word_count": 24,
    "expanded_descr": "Course Title: Third-Year Russian, Third Quarter\n\nExpanded Description: Building on the foundations established in RUSSLANG 102, this course offers an in-depth exploration of contemporary Russian life and culture. Students will enhance their reading comprehension through diverse literary texts, while engaging in conversational practice to improve fluency and grammatical precision. Cultural insights will be woven throughout the curriculum, facilitating a deeper understanding of Russian societal norms and traditions. Collaborative projects and discussions will foster interactive learning experiences, encouraging students to express their thoughts in Russian confidently. Prerequisite for enrollment is either a successful placement test or completion of RUSSLANG 102, ensuring readiness for advanced study.",
    "expanded_word_count": 104
  },
  {
    "id": 1189,
    "course_codes": "TIGRYLNG 3",
    "course_title": "First Year Tigrinya, Third Quarter",
    "original_descr": "Continuation of TIGRYLNG 2. Prerequisite TIGRYLNG 2. Fulfills the University Foreign Language requirement.",
    "original_word_count": 13,
    "expanded_descr": "Course Title: First Year Tigrinya, Third Quarter\n\nExpanded Description: This course serves as a continuation of TIGRYLNG 2, designed for students who have successfully completed the prerequisite. In this third quarter, learners will deepen their understanding of Tigrinya through enhanced vocabulary, grammar structures, and conversational skills. Emphasis will be placed on practical language use in everyday situations, cultural contexts, and reading comprehension of simple texts. Students will engage in interactive activities, including dialogues, group discussions, and multimedia resources, fostering a dynamic learning environment. By the end of the course, participants will be better equipped to communicate effectively in Tigrinya, fulfilling the University’s Foreign Language requirement.",
    "expanded_word_count": 105
  },
  {
    "id": 1190,
    "course_codes": "TWILANG 3",
    "course_title": "First-Year Twi, Third Quarter",
    "original_descr": "Continuation of TWILANG 2. Prerequisite: TWILANG 2. Fulfills the University Foreign Language Requirement.",
    "original_word_count": 13,
    "expanded_descr": "Course Title: First-Year Twi, Third Quarter\n\nExpanded Description: This course, First-Year Twi, Third Quarter, builds upon the foundational skills developed in TWILANG 2, focusing on enhancing conversational proficiency and comprehension of the Twi language. Students will engage in interactive activities that promote speaking, listening, reading, and writing in Twi. Emphasis will be placed on expanding vocabulary, mastering complex grammatical structures, and exploring cultural contexts relevant to the Akan people. Through dialogues, role-plays, and multimedia resources, students will deepen their understanding of everyday communication and cultural nuances. Successful completion fulfills the University Foreign Language Requirement, providing essential skills for personal and professional growth.",
    "expanded_word_count": 102
  },
  {
    "id": 1194,
    "course_codes": "URBANST 171",
    "course_title": "Urban Design Studio",
    "original_descr": "The practical application of urban design theory. Projects focus on designing neighborhood and downtown regions to balance livability, revitalization, population growth, and historic preservation.",
    "original_word_count": 24,
    "expanded_descr": "Course Title: Urban Design Studio\n\nExpanded Description: In this hands-on Urban Design Studio course, students will immerse themselves in the practical application of urban design theory through collaborative projects. Focusing on neighborhood and downtown revitalization, students will explore innovative strategies to enhance livability while accommodating population growth and ensuring historic preservation. Through site analysis, community engagement, and design workshops, participants will develop comprehensive urban design proposals that address real-world challenges. By integrating sustainability and social equity into their designs, students will learn to create vibrant, inclusive urban spaces that reflect the needs of diverse communities, ultimately preparing them for careers in urban planning and design.",
    "expanded_word_count": 105
  },
  {
    "id": 1204,
    "course_codes": "ANTHRO 310G",
    "course_title": "Introduction to Graduate Studies",
    "original_descr": "Required graduate seminar. The history of anthropological theory and key theoretical and methodological issues of the discipline. Prerequisite: consent of instructor.",
    "original_word_count": 21,
    "expanded_descr": "Course Title: Introduction to Graduate Studies\n\nExpanded Description: This required graduate seminar serves as a foundational course for students pursuing advanced studies in anthropology. It will explore the evolution of anthropological theory, examining pivotal thinkers and movements that have shaped the discipline. Students will engage with key theoretical frameworks and methodological approaches, fostering critical analysis of anthropological practices. Through discussions, readings, and practical assignments, participants will deepen their understanding of contemporary issues within the field. By the end of the course, students will be equipped to articulate their own research interests and navigate the complexities of anthropological scholarship. Prerequisite: consent of instructor.",
    "expanded_word_count": 102
  },
  {
    "id": 1210,
    "course_codes": "APPPHYS 300 / MATSCI 230",
    "course_title": "Department Colloquium",
    "original_descr": "May be repeated for credit.",
    "original_word_count": 5,
    "expanded_descr": "Course Title: Department Colloquium\n\nExpanded Description: The Department Colloquium serves as a dynamic platform for students to engage with contemporary research and developments within the field. Each session features guest speakers, faculty presentations, and student-led discussions, fostering an interactive learning environment. Participants will explore diverse topics, enhancing their critical thinking and analytical skills. This course emphasizes the importance of collaboration and networking among peers and professionals. Students are encouraged to contribute to discussions and reflect on the material presented. With the option to repeat for credit, participants can deepen their understanding and continually engage with evolving trends in their discipline. Join us for intellectual growth!",
    "expanded_word_count": 105
  },
  {
    "id": 1245,
    "course_codes": "CEE 284W",
    "course_title": "The Dynamics of Wind Turbines",
    "original_descr": "Introduction to the dynamic response of wind energy systems, such as wind energy technology, aerodynamics, and structural and electrical aspects.  Pre-requisites: CEE 280, CEE 282, CEE 283",
    "original_word_count": 27,
    "expanded_descr": "Course Title: The Dynamics of Wind Turbines\n\nThis course provides an in-depth exploration of the dynamic response of wind energy systems, focusing on key elements such as wind energy technology, aerodynamic principles, structural integrity, and electrical components. Students will engage with complex concepts, encompassing turbine design, performance analysis, and the impact of environmental factors on functionality. Through hands-on projects and simulations, participants will develop practical skills in assessing wind turbine efficiency and reliability. The course also emphasizes the integration of theory with real-world applications, preparing students for careers in renewable energy. Pre-requisites include CEE 280, CEE 282, and CEE 283, ensuring a solid foundation for advanced study.",
    "expanded_word_count": 107
  },
  {
    "id": 1251,
    "course_codes": "CHEM 329",
    "course_title": "Organic Chemistry Seminar",
    "original_descr": "(Formerly 229) Required of graduate students majoring in organic chemistry. Students giving seminars register for CHEM 231.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Organic Chemistry Seminar\n\nThis advanced seminar is a critical component for graduate students specializing in organic chemistry, previously designated as course 229. In this interactive and intellectually stimulating environment, students will engage in the presentation of their research findings, fostering skills in scientific communication and critical analysis. Participants will also explore contemporary topics, recent advancements, and methodologies in organic chemistry through peer-led discussions and expert guest lectures. By collaborating and providing constructive feedback, students will refine their presentation techniques and deepen their understanding of the subject. This course is essential for preparing students for careers in academia and industry.",
    "expanded_word_count": 101
  },
  {
    "id": 1261,
    "course_codes": "COMM 372B",
    "course_title": "Social Responses to Technology from TV to AI",
    "original_descr": "TBA",
    "original_word_count": 1,
    "expanded_descr": "Course Title: Social Responses to Technology from TV to AI\n\nExpanded Description: This course explores the dynamic interplay between technology and society, focusing on how various technological advancements—from television to artificial intelligence—shape cultural norms, values, and behaviors. Students will examine historical and contemporary examples, analyzing media narratives, public perceptions, and ethical considerations surrounding these technologies. Through discussions, case studies, and hands-on projects, participants will critically assess the impact of technology on daily life, social interactions, and public policy. By fostering a nuanced understanding of these relationships, students will be equipped to engage thoughtfully with emerging technologies and contribute to informed dialogue about their societal implications.",
    "expanded_word_count": 105
  },
  {
    "id": 1294,
    "course_codes": "EDUC 211A",
    "course_title": "Maker Tools Learning Lab",
    "original_descr": "This project-based lab course introduces students to the use of several maker tools for personal and academic projects.",
    "original_word_count": 18,
    "expanded_descr": "Course Title: Maker Tools Learning Lab\n\nExpanded Description: In the Maker Tools Learning Lab, students will engage in hands-on, project-based learning to explore a variety of innovative maker tools essential for both personal and academic projects. Throughout the course, participants will gain practical experience with equipment such as 3D printers, laser cutters, and electronics kits, enabling them to bring their creative ideas to life. Students will collaborate on projects that foster problem-solving skills and critical thinking while enhancing their technical proficiency. By the end of the course, participants will have developed a portfolio showcasing their projects, reflecting their newfound maker capabilities and creativity.",
    "expanded_word_count": 103
  },
  {
    "id": 1297,
    "course_codes": "EDUC 262D",
    "course_title": "Curriculum & Instruction Elective in English",
    "original_descr": "Methodology of science instruction: teaching for English and language arts; linking the goals of teaching English with interdisciplinary curricula; opportunities to develop teaching materials. For STEP Program students only.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: Curriculum & Instruction Elective in English\n\nExpanded Description: This course focuses on the methodology of science instruction specifically applied to English and language arts education. Students will explore effective teaching strategies that align English language goals with interdisciplinary curricula, fostering a holistic approach to learning. Through collaborative projects, participants will have opportunities to develop innovative teaching materials that enhance student engagement and comprehension. Emphasis will be placed on integrating literature, writing, and critical thinking skills within various subject areas. This course is exclusively tailored for STEP Program students, aiming to prepare future educators to create dynamic, interconnected learning environments that inspire students to thrive.",
    "expanded_word_count": 106
  },
  {
    "id": 1299,
    "course_codes": "EDUC 267D",
    "course_title": "Curriculum & Instruction Elective in Science",
    "original_descr": "Methodology of science instruction: teaching for scientific reasoning; linking the goals of teaching science with literacy and interdisciplinary curricula; opportunities to develop teaching materials. For STEP Program students only.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: Curriculum & Instruction Elective in Science\n\nExpanded Description: This course delves into the methodologies of effective science instruction, emphasizing the development of scientific reasoning skills among students. Participants will explore innovative strategies to intertwine science education with literacy and interdisciplinary approaches, enhancing overall learning experiences. Throughout the course, students will engage in collaborative projects, developing and evaluating teaching materials that foster inquiry-based learning and critical thinking. Additionally, the curriculum will address the diverse needs of learners, equipping future educators with the tools necessary for cultivating a dynamic classroom environment. This course is exclusively designed for STEP Program students eager to enhance their teaching practices in science.",
    "expanded_word_count": 108
  },
  {
    "id": 1305,
    "course_codes": "EDUC 450A",
    "course_title": "Qualitative Analysis in Education",
    "original_descr": "Primarily for doctoral students; part of doctoral research core. Methods for collecting and interpreting qualitative data including case study, ethnography, discourse analysis, observation, and interview.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: Qualitative Analysis in Education\n\nExpanded Description: This course, designed primarily for doctoral students, forms a crucial component of the doctoral research core curriculum. Participants will explore diverse qualitative research methods, including case studies, ethnography, discourse analysis, observation techniques, and structured interviews. Through interactive discussions and hands-on assignments, students will learn to collect, analyze, and interpret qualitative data effectively. The course emphasizes critical thinking and ethical considerations in research design and implementation. By the end, students will be equipped to conduct rigorous qualitative research in educational settings, contributing valuable insights into complex educational phenomena and enhancing their overall research skill set.",
    "expanded_word_count": 102
  },
  {
    "id": 1331,
    "course_codes": "EPI 236",
    "course_title": "Epidemiology Research Seminar",
    "original_descr": "Weekly forum for ongoing epidemiologic research by faculty, staff, guests, and students, emphasizing research issues relevant to disease causation, prevention, and treatment. May be repeated for credit.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Epidemiology Research Seminar\n\nExpanded Description: This weekly seminar serves as a dynamic forum for the presentation and discussion of current epidemiologic research conducted by faculty, staff, guest speakers, and students. Participants will explore critical research issues related to disease causation, prevention strategies, and treatment methodologies. Engaging with diverse perspectives, attendees will enhance their understanding of cutting-edge findings and methodologies in epidemiology. Students will have the opportunity to present their own research projects, receive constructive feedback, and foster collaborative discussions. By actively participating, students will develop essential skills in critical thinking, data analysis, and effective scientific communication, laying a strong foundation for future research endeavors.",
    "expanded_word_count": 106
  },
  {
    "id": 1336,
    "course_codes": "ESOLLANG 697",
    "course_title": "Gateway to Graduate Writing",
    "original_descr": "Focus is on improving grammatical accuracy and vocabulary, building fluency, and learning the structure and conventions of English correspondence, reports, and short academic papers. Enrollment limited to 14.",
    "original_word_count": 28,
    "expanded_descr": "Course Title: Gateway to Graduate Writing\n\nExpanded Description: This course is designed to enhance your writing skills essential for graduate-level success. Emphasis will be placed on improving grammatical accuracy and expanding your vocabulary, enabling you to articulate ideas clearly and effectively. You will learn the structural conventions of various forms of English correspondence, including professional emails, reports, and concise academic papers. Through interactive workshops and peer editing, you will build fluency in your writing process. With a limited enrollment of 14 students, you will benefit from personalized feedback and support aimed at preparing you for the rigorous writing demands of graduate studies.",
    "expanded_word_count": 102
  },
  {
    "id": 1338,
    "course_codes": "FILMPROD 403",
    "course_title": " The Spring Film II",
    "original_descr": "Restricted to M.F.A. Documentary Film students. This course will guide the students through the post-production of their final.",
    "original_word_count": 18,
    "expanded_descr": "Course Title: The Spring Film II\n\nExpanded Description: This advanced course is exclusively designed for M.F.A. Documentary Film students, focusing on the crucial post-production phase of their final projects. Students will engage in hands-on editing, sound design, and color correction, utilizing industry-standard software to refine their documentary films. Emphasis will be placed on narrative structure, pacing, and the integration of visual and auditory elements to enhance storytelling. Additionally, students will participate in peer reviews and workshops, fostering collaborative feedback and creative growth. By the end of the course, each student will complete a polished documentary ready for submission to festivals or professional screenings.",
    "expanded_word_count": 103
  },
  {
    "id": 1349,
    "course_codes": "IMMUNOL 305",
    "course_title": "Immunology Journal Club",
    "original_descr": "Required of first- to third-year graduate students. Graduate students present and discuss recent papers in the literature. May be repeated for credit.",
    "original_word_count": 22,
    "expanded_descr": "Course Title: Immunology Journal Club\n\nExpanded Description: This dynamic course is designed for first- to third-year graduate students interested in deepening their understanding of immunology through active engagement with current literature. Students will take turns presenting recent research papers, fostering critical thinking and analytical skills. Discussions will emphasize the significance of findings, experimental methodologies, and their implications in the broader context of immunological research. Participants will also enhance their presentation skills and ability to critique scientific literature. This course may be repeated for credit, allowing students to explore diverse topics and stay updated on cutting-edge developments in the field of immunology.",
    "expanded_word_count": 101
  },
  {
    "id": 1350,
    "course_codes": "IMMUNOL 311",
    "course_title": "Seminar in Immunology",
    "original_descr": "Enrollment limited to Ph.D., M.D./Ph.D., and medical students whose scholarly concentrations are in Immunology. Current research topics.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Seminar in Immunology\n\nExpanded Description: This advanced seminar is designed exclusively for Ph.D., M.D./Ph.D., and medical students whose research focuses on Immunology. Participants will engage deeply with current research topics, exploring cutting-edge developments and methodologies in the field. Through presentations and discussions, students will critically analyze recent studies, fostering a collaborative learning environment. Each session will feature guest speakers who are leaders in Immunology, providing insights into their research and its implications for clinical practice. Students will also develop skills in scientific communication and critical thinking, preparing them for future academic and professional endeavors in the rapidly evolving landscape of Immunology.",
    "expanded_word_count": 103
  },
  {
    "id": 1358,
    "course_codes": "LINGUIST 217",
    "course_title": "Morphosyntax",
    "original_descr": "An investigation of central issues in the study of the interface between syntax and morphology.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: Morphosyntax\n\nExpanded Description: This course offers an in-depth exploration of the dynamic relationship between syntax and morphology, two fundamental components of linguistic structure. Students will engage with central issues such as word formation, inflectional and derivational processes, and how syntactic structures influence morphological patterns. Through theoretical frameworks and empirical data, participants will analyze various languages to understand morphosyntactic phenomena. Class discussions, hands-on exercises, and research projects will enhance critical thinking and analytical skills. By the end of the course, students will be equipped to articulate the complexities of morphosyntactic interfaces and contribute to ongoing debates in the field of linguistics.",
    "expanded_word_count": 102
  },
  {
    "id": 1359,
    "course_codes": "LINGUIST 258",
    "course_title": "Analysis of Variation",
    "original_descr": "The quantitative study of linguistic variability in time, space, and society emphasizing social constraints in variation. Hands-on work with variable data.",
    "original_word_count": 21,
    "expanded_descr": "Course Title: Analysis of Variation\n\nExpanded Description: This course offers an in-depth quantitative exploration of linguistic variation across different contexts, including temporal shifts, geographical distinctions, and social influences. Students will examine how social factors, such as class, gender, and ethnicity, shape language use and contribute to variation. Through hands-on projects, participants will work with real-world variable data, employing statistical methods to analyze and interpret linguistic patterns. By the end of the course, students will develop a nuanced understanding of the dynamics of language variation, equipping them with essential skills for research, sociolinguistics, and data analysis in linguistic studies.",
    "expanded_word_count": 98
  },
  {
    "id": 1378,
    "course_codes": "ME 338",
    "course_title": "Continuum Mechanics",
    "original_descr": "Introduction to vectors and tensors: kinematics, deformation, forces, and stress concept of continua; balance principles; aspects of objectivity; hyperelastic materials; thermodynamics of materials; variational principles.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: Continuum Mechanics\n\nExpanded Description: This course offers a comprehensive introduction to the fundamental principles of continuum mechanics, emphasizing the role of vectors and tensors in understanding material behavior. Students will explore kinematics, the characterization of deformation, and the critical concepts of force and stress within continuous media. The curriculum covers balance principles, ensuring students grasp conservation laws, and delves into the objectivity of physical laws in mechanics. Additionally, the course examines hyperelastic materials, their properties, and applications. Students will also investigate the thermodynamics of materials and variational principles, fostering a deep understanding of the interplay between mechanical and thermal behaviors in solid materials.",
    "expanded_word_count": 105
  },
  {
    "id": 1386,
    "course_codes": "MS&E 221",
    "course_title": "Stochastic Modeling",
    "original_descr": "Focus is on time-dependent random phenomena. Topics: discrete time Markov chains, Markov jump processes, queueing theory, and applications. Emphasis on model-building, computation, and related calibration and statistical issues.",
    "original_word_count": 28,
    "expanded_descr": "In the Stochastic Modeling course, students will explore the intricacies of time-dependent random phenomena, delving into the foundational concepts of discrete time Markov chains and Markov jump processes. The curriculum encompasses an in-depth examination of queueing theory, equipping students with the skills to analyze and model complex systems in real-world applications. Emphasis will be placed on model-building techniques, computational methods, and the calibration of stochastic models. Additionally, students will address statistical issues related to these models, fostering a comprehensive understanding of how to effectively apply stochastic processes in various fields, including finance, telecommunications, and operations research.",
    "expanded_word_count": 96
  },
  {
    "id": 1393,
    "course_codes": "MS&E 280",
    "course_title": "Organizational Behavior: Evidence in Action",
    "original_descr": "Organization theory; concepts and functions of management; behavior of the individual, work group, and organization. Emphasis is on cases and related discussion.",
    "original_word_count": 22,
    "expanded_descr": "Course Title: Organizational Behavior: Evidence in Action\n\nThis course delves into the intricate dynamics of organizational behavior by exploring foundational theories and principles of management. Students will examine the behaviors of individuals, work groups, and entire organizations, focusing on how these elements influence overall effectiveness and productivity. Through the analysis of real-world case studies, participants will engage in spirited discussions that encourage critical thinking and practical application of concepts. Topics include motivation, team dynamics, leadership styles, and organizational culture. By the end of the course, students will gain valuable insights into improving organizational performance and fostering a positive workplace environment, equipping them for future leadership roles.",
    "expanded_word_count": 106
  },
  {
    "id": 1403,
    "course_codes": "MUSIC 323",
    "course_title": "Doctoral Seminar in Composition",
    "original_descr": "Illustrated discussions of compositional issues and techniques.  Presentation of relevant topics, including students' own compositional practice. May be repeated for credit a total of 14 times.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Doctoral Seminar in Composition\n\nExpanded Description: This seminar offers an in-depth exploration of advanced compositional issues and techniques, fostering a collaborative environment for emerging composers. Students will engage in illustrated discussions that highlight diverse methodologies, theoretical frameworks, and historical contexts relevant to contemporary composition. Each session will feature presentations on significant topics, including analyses of students' own compositions, encouraging peer feedback and critical reflection. Participants will have the opportunity to refine their artistic voices while expanding their technical skills. The course may be repeated for credit, allowing students to deepen their understanding and continually evolve their compositional practices over a total of 14 iterations.",
    "expanded_word_count": 106
  },
  {
    "id": 1418,
    "course_codes": "POLISCI 410C",
    "course_title": "International Relations Theory, Part III",
    "original_descr": "Third of a three-part graduate sequence. History of international relations theory, current debates, and applications to problems of international security and political economy. Prerequisite: POLISCI 410A.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: International Relations Theory, Part III\n\nExpanded Description: This course serves as the final segment of a comprehensive three-part graduate sequence, delving deeply into the evolution of international relations theory. Students will explore historical perspectives, analyze contemporary debates, and assess theoretical applications to pressing issues in international security and political economy. Emphasis will be placed on critical thinking and the evaluation of various theoretical frameworks. Through case studies, scholarly articles, and class discussions, participants will engage with real-world problems and develop the analytical skills necessary to apply theoretical concepts effectively. Prerequisite: POLISCI 410A is required to ensure foundational knowledge for success.",
    "expanded_word_count": 102
  },
  {
    "id": 1419,
    "course_codes": "POLISCI 422",
    "course_title": "Workshop in American Politics",
    "original_descr": "Research seminar. Frontiers in mass political behavior. Course may be repeated for credit.",
    "original_word_count": 13,
    "expanded_descr": "Course Title: Workshop in American Politics\n\nExpanded Description: This research seminar delves into the frontiers of mass political behavior, exploring the dynamic interactions between public opinion, political participation, and electoral outcomes in the United States. Students will engage in critical analysis of contemporary research, participate in discussions, and design their own research projects that investigate current trends and issues in American politics. Emphasis will be placed on empirical methodologies and data analysis to understand voter behavior, political mobilization, and the impact of media. This course encourages repetitive enrollment for credit, allowing students to refine their research skills and deepen their understanding of evolving political landscapes.",
    "expanded_word_count": 105
  },
  {
    "id": 1420,
    "course_codes": "POLISCI 440D",
    "course_title": "Workshop in Comparative Politics",
    "original_descr": "Faculty, guest speakers, and graduate students conducting research in comparative politics present work-in-progress. May be repeated for credit.",
    "original_word_count": 18,
    "expanded_descr": "In the Workshop in Comparative Politics, students engage with faculty, esteemed guest speakers, and fellow graduate researchers deeply immersed in the field of comparative politics. Participants will present and receive constructive feedback on their ongoing research projects, fostering a collaborative academic environment. The workshop emphasizes critical analysis of political systems, methodologies, and emerging trends across various global contexts. Students will enhance their research skills, refine their presentation techniques, and gain insights into scholarly debates. By attending multiple sessions, participants will also expand their professional networks, making the course a valuable opportunity for intellectual growth and development in comparative political research.",
    "expanded_word_count": 100
  },
  {
    "id": 1425,
    "course_codes": "PUBLPOL 311",
    "course_title": "Public Policy Colloquium",
    "original_descr": "Weekly colloquia speaker series required for M.P.P. and M.A. in Public Policy students. Open only to Public Policy graduate students; permission number required to enroll.",
    "original_word_count": 25,
    "expanded_descr": "Course Title: Public Policy Colloquium\n\nExpanded Description: The Public Policy Colloquium is a dynamic weekly speaker series designed exclusively for Master of Public Policy (M.P.P.) and Master of Arts in Public Policy (M.A.) students. This course provides an invaluable platform for students to engage with distinguished experts, practitioners, and thought leaders in the field of public policy. Participants will explore critical contemporary issues, gain insights into various policy-making processes, and develop analytical skills through discussions and Q&A sessions. This interactive environment fosters networking opportunities and deepens understanding of real-world challenges in public policy, enhancing academic and professional growth. Enrollment requires a permission number.",
    "expanded_word_count": 103
  },
  {
    "id": 1431,
    "course_codes": "SOC 380",
    "course_title": "Qualitative Methods",
    "original_descr": "Priority to Sociology doctoral students. Emphasis is on observational and interview-based research. Limited enrollment.",
    "original_word_count": 14,
    "expanded_descr": "Course Title: Qualitative Methods\n\nExpanded Description: This course is designed primarily for Sociology doctoral students, focusing on advanced qualitative research methodologies. Students will engage in observational and interview-based research techniques, developing skills to gather and analyze rich, descriptive data. Through hands-on projects, participants will learn to construct effective interview questions, conduct field observations, and interpret qualitative findings within sociological contexts. The limited enrollment fosters an intimate learning environment, encouraging collaborative discussions and personalized feedback. By the end of the course, students will be equipped to design and execute their own qualitative research projects, contributing valuable insights to the field of sociology.",
    "expanded_word_count": 101
  },
  {
    "id": 1433,
    "course_codes": "STATS 218",
    "course_title": "Introduction to Stochastic Processes II",
    "original_descr": "Renewal theory, Brownian motion, Gaussian processes, second order processes, martingales.Prerequisites: STATS 118, STATS 217. See https://statistics.stanford.edu/course-equiv for equivalent courses in other departments that satisfy these prerequisites.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Introduction to Stochastic Processes II\n\nExpanded Description: This course delves into advanced topics in stochastic processes, focusing on renewal theory, which explores the times of events in a stochastic setting. Students will study Brownian motion, the cornerstone of modern probability theory, alongside Gaussian processes, which model various real-world phenomena. Additionally, the course covers second-order processes essential for understanding correlations within stochastic models and martingales, pivotal for predicting future outcomes based on past information. Through theoretical discussions and practical applications, students will develop a robust understanding of these concepts. Prerequisites include STATS 118 and STATS 217, ensuring a solid foundation for this advanced material.",
    "expanded_word_count": 105
  },
  {
    "id": 1474,
    "course_codes": "POLECON 661",
    "course_title": "Political Economy Research Workshop",
    "original_descr": "Workshop for in-progress work by doctoral students in the PE program. Students present work and get feedback from other students and the faculty instructor.",
    "original_word_count": 24,
    "expanded_descr": "The Political Economy Research Workshop is a dynamic platform designed specifically for doctoral students within the Political Economy program to refine their scholarly work. Participants will present their ongoing research projects, receiving constructive feedback from peers and the faculty instructor, fostering a collaborative and supportive environment. The workshop emphasizes critical thinking, analytical skills, and effective communication of complex ideas. Students will engage in discussions that enhance their understanding of political economy concepts, methodologies, and current debates. This interactive course not only aims to improve individual research quality but also cultivates a sense of community among emerging scholars in the field.",
    "expanded_word_count": 100
  },
  {
    "id": 1674,
    "course_codes": "GEOPHYS 385D",
    "course_title": "Theoretical Geophysics",
    "original_descr": "Research on physics and mechanics of earthquakes, volcanoes, ice sheets, and glaciers. Emphasis is on developing theoretical understanding of processes governing natural phenomena.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Theoretical Geophysics\n\nExpanded Description: This course delves into the fundamental physics and mechanics behind significant geological processes such as earthquakes, volcanic activity, ice sheet dynamics, and glacier movements. Students will explore theoretical models that explain the behavior of these natural phenomena, emphasizing the underlying physical principles. Through a combination of lectures, hands-on simulations, and collaborative research projects, participants will develop a comprehensive understanding of how these processes interact with Earth's systems. Additionally, students will engage in critical analysis of current research literature, equipping them with the skills necessary to contribute to advancements in geophysical science and address real-world geological challenges.",
    "expanded_word_count": 102
  },
  {
    "id": 1511,
    "course_codes": "CBIO 245",
    "course_title": "Lecture Seminar Series in Cancer Biology Program",
    "original_descr": "Invited speakers share insights about state-of-the-art trends. Presents new concepts in the field of cancer biology. Science talks presented by students.",
    "original_word_count": 21,
    "expanded_descr": "The Lecture Seminar Series in Cancer Biology Program offers a dynamic platform where invited expert speakers share their insights on cutting-edge trends and breakthroughs in cancer research. This course emphasizes the exploration of innovative concepts and methodologies within the field, fostering a deeper understanding of cancer biology. Students will engage in critical discussions and participate in presenting their own scientific talks, promoting an interactive learning environment. By attending these seminars, students will enhance their knowledge, develop presentation skills, and gain exposure to diverse perspectives in cancer research, ultimately preparing them for advanced studies or careers in biomedical sciences.",
    "expanded_word_count": 98
  },
  {
    "id": 1521,
    "course_codes": "AFRICAAM 200Z",
    "course_title": "Honors Thesis and Senior Thesis Research",
    "original_descr": "Spring. Required for students writing an Honors Thesis. Optional for Students writing a Senior Thesis.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: Honors Thesis and Senior Thesis Research\n\nExpanded Description: This course is designed for students undertaking significant research projects, specifically those writing an Honors Thesis, while also providing valuable support for those pursuing a Senior Thesis. In this spring semester course, students will engage in advanced research methodologies, critical analysis, and academic writing practices. Participants will receive guidance from faculty advisors, collaborate with peers, and develop their thesis proposals into comprehensive, well-structured documents. Emphasis will be placed on cultivating independent thought, enhancing presentation skills, and addressing ethical considerations in research. By the end, students will be well-prepared to complete their theses with confidence and scholarly rigor.",
    "expanded_word_count": 107
  },
  {
    "id": 1551,
    "course_codes": "ENERGY 199",
    "course_title": "Senior Project and Seminar in Energy Science and Engineering",
    "original_descr": "Individual or group capstone project in Energy Science and Engineering. Emphasis is on report preparation. May be repeated for credit.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Senior Project and Seminar in Energy Science and Engineering\n\nExpanded Description: This capstone course offers students the opportunity to engage in an individual or group project that showcases their knowledge and skills in Energy Science and Engineering. Students will identify a relevant problem, conduct research, and develop innovative solutions, all while emphasizing professional report preparation and presentation skills. Throughout the course, participants will collaborate with peers and faculty, fostering teamwork and critical thinking. Additionally, students will gain valuable experience in project management and technical communication. This course may be repeated for credit, allowing for deeper exploration of diverse energy topics and methodologies.",
    "expanded_word_count": 104
  },
  {
    "id": 1555,
    "course_codes": "ENGLISH 290",
    "course_title": "Advanced Fiction Writing",
    "original_descr": "Workshop critique of original short stories or novel.",
    "original_word_count": 8,
    "expanded_descr": "Course Title: Advanced Fiction Writing\n\nIn this intensive workshop, students will engage in critical analysis and constructive critique of original short stories and novel excerpts. Participants will enhance their storytelling skills through peer feedback, guided discussions, and instructor-led insights into narrative techniques, character development, and thematic depth. The course emphasizes both the craft of writing and the art of revision, encouraging writers to refine their voice and style. Students will explore various genres and storytelling forms, ultimately producing polished works ready for publication. By the end of the course, participants will gain confidence and a deeper understanding of advanced fiction writing principles.",
    "expanded_word_count": 102
  },
  {
    "id": 1619,
    "course_codes": "ARTSTUDI 342C",
    "course_title": "M.F.A Seminar",
    "original_descr": "Professional practices; preparation of documentation; exhibition and presentation. Restricted to M.F.A. studio students only. May be repeat for credit total units allowed 45 and total completion 6",
    "original_word_count": 27,
    "expanded_descr": "Course Title: M.F.A Seminar\n\nExpanded Description: The M.F.A. Seminar focuses on essential professional practices crucial for emerging artists. Students will engage in intensive preparation of documentation, including artist statements, portfolios, and exhibition proposals, tailored to showcase their unique artistic voice. Emphasis will be placed on developing presentation skills necessary for effectively communicating their work in various professional contexts. This course is designed exclusively for M.F.A. studio students, fostering a collaborative environment where peer feedback is encouraged. Students may repeat the seminar for additional credit, allowing for an accumulation of up to 45 units. A total of six completions is permitted, enhancing their professional readiness.",
    "expanded_word_count": 104
  },
  {
    "id": 1631,
    "course_codes": "CHEM 379",
    "course_title": "Physical Chemistry Seminar",
    "original_descr": "(Formerly 279) Required of graduate students majoring in physical chemistry. May be repeated for credit.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: Physical Chemistry Seminar\n\nExpanded Description: This seminar, formerly designated as 279, is a critical requirement for graduate students specializing in physical chemistry. It provides an interactive platform for students to delve into advanced topics, current research, and emerging trends in the field. Participants will engage in discussions, presentations, and collaborative projects that enhance their understanding of theoretical and experimental aspects of physical chemistry. The seminar encourages the exploration of literature and fosters critical thinking skills, allowing students to present their findings and insights. Students may enroll multiple times for credit, facilitating continuous learning and deeper engagement with evolving scientific concepts.",
    "expanded_word_count": 102
  },
  {
    "id": 1633,
    "course_codes": "CME 291",
    "course_title": "Master's Research",
    "original_descr": "Students require faculty sponsor. (Staff)",
    "original_word_count": 5,
    "expanded_descr": "Course Title: Master's Research\n\nExpanded Description: This course is designed for graduate students seeking to engage in independent research under the guidance of a faculty sponsor. Students will formulate research questions, develop methodologies, and conduct original investigations in their field of study. Emphasis will be placed on critical thinking, data analysis, and academic writing, culminating in a comprehensive thesis or project. Participants will also have opportunities to present their findings, receive constructive feedback, and refine their research skills. By fostering a collaborative environment, this course encourages intellectual growth and prepares students for future academic or professional endeavors in their respective disciplines.",
    "expanded_word_count": 101
  },
  {
    "id": 1646,
    "course_codes": "ECON 325",
    "course_title": "Economic History Seminar",
    "original_descr": "May be repeated for credit. Information and meeting times are available on the Department of Economics Website: https://economics.stanford.edu/seminars-events/list-seminars",
    "original_word_count": 18,
    "expanded_descr": "Course Title: Economic History Seminar\n\nExpanded Description: The Economic History Seminar offers students an in-depth exploration of the historical development of economic systems and theories, examining pivotal events and trends that shaped modern economies. Participants will engage in discussions led by faculty and guest speakers, focusing on diverse topics such as industrialization, trade patterns, and the impact of policy decisions. The seminar encourages critical thinking and analytical skills through case studies and research presentations. Students may repeat the course for credit, allowing for deeper investigation into various themes. For meeting times and additional information, please refer to the Department of Economics website.",
    "expanded_word_count": 102
  },
  {
    "id": 1647,
    "course_codes": "ECON 345",
    "course_title": "Labor Economics Seminar",
    "original_descr": "Labor Seminar for Economics.",
    "original_word_count": 4,
    "expanded_descr": "Course Title: Labor Economics Seminar\n\nExpanded Description: This seminar offers an in-depth exploration of labor economics, focusing on the dynamics of labor markets, employment policies, and wage determination. Students will engage in critical discussions about contemporary issues such as unemployment, labor supply and demand, and the impact of globalization on labor markets. The course will include case studies, research presentations, and guest lectures from industry experts to enhance understanding. Participants will develop analytical skills through quantitative and qualitative analysis of labor market data, preparing them for careers in economics, policy-making, or academia. Join us to delve into the complexities of labor economics and its real-world applications.",
    "expanded_word_count": 106
  },
  {
    "id": 1648,
    "course_codes": "ECON 391",
    "course_title": "Microeconomic Theory Seminar",
    "original_descr": "Microeconomic Theory Seminar (Only available for enrollment by ECON PhDs)",
    "original_word_count": 10,
    "expanded_descr": "Course Title: Microeconomic Theory Seminar\n\nExpanded Description: The Microeconomic Theory Seminar is a specialized course exclusively designed for PhD candidates in Economics. This seminar will delve into advanced microeconomic concepts, focusing on the analytical tools used to understand consumer behavior, market dynamics, and strategic interactions between agents. Students will engage in critical discussions of contemporary research papers, honing their ability to evaluate and contribute to academic discourse. Through presentations and peer reviews, participants will develop essential skills in articulating complex economic theories. Additionally, the seminar aims to foster collaboration among future economists, enhancing their research capabilities and preparing them for their academic careers.",
    "expanded_word_count": 103
  },
  {
    "id": 1661,
    "course_codes": "ENGLISH 390 / ENGLISH 392",
    "course_title": "Graduate Fiction Workshop",
    "original_descr": "Open to Stegner Fellows in the Creative Writing Program only. May be repeated for credit.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: Graduate Fiction Workshop\n\nExpanded Description: This exclusive Graduate Fiction Workshop is designed specifically for Stegner Fellows in the Creative Writing Program, offering a unique opportunity for advanced writers to hone their craft. Participants will engage in intensive peer critiques, focusing on developing narrative techniques, character development, and thematic depth. Through in-depth discussions and analyses of contemporary fiction, students will explore diverse styles and genres, enhancing their own storytelling abilities. The workshop emphasizes collaboration and constructive feedback, allowing writers to refine their work while building a supportive community. Students may repeat this course for credit, facilitating ongoing growth in their creative writing journey.",
    "expanded_word_count": 104
  },
  {
    "id": 1678,
    "course_codes": "HRP 390 / MS&E 390",
    "course_title": "Doctoral Research Seminar in Health Systems Modeling",
    "original_descr": "Restricted to PhD students, or by consent of instructor. Doctoral research seminar covering current topics in health policy, health systems modeling, and health innovation. May be repeated for credit.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: Doctoral Research Seminar in Health Systems Modeling\n\nExpanded Description: This exclusive seminar is tailored for PhD students, emphasizing advanced topics in health policy, health systems modeling, and health innovation. Participants will engage in critical discussions, analyze contemporary research, and explore innovative methodologies that shape healthcare delivery and policy-making. The course fosters a collaborative environment where students present their research findings, receive constructive feedback, and refine their academic skills. Through case studies and guest lectures from industry experts, students will gain practical insights into real-world applications of health systems modeling. This seminar may be repeated for credit, allowing for continued exploration of evolving topics in the field.",
    "expanded_word_count": 108
  },
  {
    "id": 1684,
    "course_codes": "JAPAN 396",
    "course_title": "Seminar in Modern Japanese Literature",
    "original_descr": "Works and topics vary each year. May be repeated for credit.  Prerequisite: fourth-year Japanese or consent of instructor.",
    "original_word_count": 18,
    "expanded_descr": "This Seminar in Modern Japanese Literature invites students to explore a diverse array of literary works and themes that reflect Japan’s evolving cultural landscape. Each year, the course focuses on different authors, genres, and historical contexts, fostering a deeper understanding of modern Japanese literature. Students will engage in critical discussions, analyze texts, and examine the socio-political influences shaping these works. Through collaborative projects and presentations, participants will enhance their analytical and communication skills. Prerequisites include fourth-year Japanese proficiency or the instructor's consent, ensuring that all students are equipped for meaningful engagement with complex literary texts. Repeatable for credit.",
    "expanded_word_count": 98
  },
  {
    "id": 1689,
    "course_codes": "ME 390A",
    "course_title": "Thermofluids, Energy, and Propulsion Research Seminar",
    "original_descr": "Review of work in a particular research program and presentations of other related work.",
    "original_word_count": 14,
    "expanded_descr": "Course Title: Thermofluids, Energy, and Propulsion Research Seminar\n\nExpanded Description: This seminar offers an in-depth exploration of cutting-edge research in thermofluids, energy systems, and propulsion technologies. Students will engage in critical reviews of current work within a designated research program, fostering a collaborative environment for discussion and analysis. Additionally, participants will present and critique related studies, enhancing their understanding of the broader context of energy and propulsion challenges. Through guest lectures from industry experts and academic leaders, students will gain insights into emerging trends and innovations. This course aims to develop essential skills in research methodology, technical communication, and interdisciplinary collaboration, preparing students for future endeavors in engineering.",
    "expanded_word_count": 108
  },
  {
    "id": 1954,
    "course_codes": "MS&E 326",
    "course_title": "Advanced Topics in Applied Data Science",
    "original_descr": "Advanced Topics in Applied Data Science",
    "original_word_count": 6,
    "expanded_descr": "Course Title: Advanced Topics in Applied Data Science\n\nThis course delves into cutting-edge methodologies and technologies in applied data science, equipping students with advanced analytical skills. Topics include machine learning algorithms, deep learning techniques, natural language processing, and data visualization strategies. Students will engage in hands-on projects, utilizing real-world datasets to solve complex problems. Emphasis is placed on ethical considerations and best practices in data handling. By collaborating in teams, students will enhance their communication and problem-solving abilities, preparing them for challenges in the data science field. Upon completion, participants will be well-versed in current trends and practices, ready to make impactful contributions to various industries.",
    "expanded_word_count": 106
  },
  {
    "id": 1707,
    "course_codes": "PHIL 359",
    "course_title": "Logic Spring Seminar",
    "original_descr": "Seminar on current logic research topics, cotaught by Johan van Benthem and Thomas Icard.  Prerequisite: serious background in logic (at least 151 level). This course is repeatable.",
    "original_word_count": 27,
    "expanded_descr": "Course Title: Logic Spring Seminar\n\nThis engaging seminar delves into cutting-edge topics in logic, fostering an environment for in-depth discussion and exploration of contemporary research. Co-taught by renowned scholars Johan van Benthem and Thomas Icard, students will analyze key areas of logic, including modal logic, epistemic logic, and computational aspects. Participants are expected to have at least a 151-level understanding of logic, ensuring a robust foundation for advanced study. Through collaborative projects, presentations, and critical analysis, students will sharpen their analytical skills and contribute to ongoing research dialogues. This course is repeatable, allowing for continued exploration of evolving logic themes and theories.",
    "expanded_word_count": 102
  },
  {
    "id": 1710,
    "course_codes": "SOC 305",
    "course_title": "Graduate Proseminar",
    "original_descr": "For first-year Sociology doctoral students only, Introduction and orientation to the field of Sociology. May be repeat for credit",
    "original_word_count": 19,
    "expanded_descr": "Course Title: Graduate Proseminar\n\nExpanded Description: Designed exclusively for first-year Sociology doctoral students, this Graduate Proseminar serves as a comprehensive introduction and orientation to the dynamic field of Sociology. Students will explore foundational theories, key methodologies, and current research trends, fostering a deep understanding of sociological inquiry. Engaging discussions, collaborative activities, and critical readings will enhance analytical skills and promote interdisciplinary connections. Additionally, students will receive guidance on navigating their doctoral journey, including developing research proposals and identifying potential mentors. This course may be repeated for credit, allowing students to further refine their knowledge and skills as they progress through their doctoral studies.",
    "expanded_word_count": 103
  },
  {
    "id": 1788,
    "course_codes": "AA 296 / ME 350",
    "course_title": "Plasma Science and Technology Seminar",
    "original_descr": "Guest speakers present research related to plasma science and engineering, ranging from fundamental plasma physics to industrial applications of plasma.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Plasma Science and Technology Seminar\n\nExpanded Description: In this seminar, students will engage with a diverse lineup of guest speakers who are experts in the field of plasma science and engineering. Each session will cover a spectrum of topics, from the fundamental principles of plasma physics to cutting-edge industrial applications, such as plasma processing, materials modification, and environmental technologies. Students will have the opportunity to explore real-world challenges and innovations, participate in discussions, and deepen their understanding of plasma phenomena. This interactive experience will not only enhance theoretical knowledge but also inspire students to consider future research directions and career opportunities in plasma science.",
    "expanded_word_count": 106
  },
  {
    "id": 1790,
    "course_codes": "ANTHRO 393",
    "course_title": "What is Authority",
    "original_descr": "Significant work outside of class time is expected of the student for this course.",
    "original_word_count": 14,
    "expanded_descr": "Course Title: What is Authority\n\nExpanded Description: In \"What is Authority,\" students will explore the multifaceted concept of authority across various contexts, including political, social, and personal dimensions. The course will encourage critical thinking and debate about the origins, legitimacy, and implications of authority in contemporary society. Through engaging lectures, discussions, and group projects, students will analyze historical and modern examples, fostering a deeper understanding of power dynamics. Significant work outside of class time is expected, including research assignments, reflective essays, and collaborative presentations. By the end of the course, students will cultivate a nuanced perspective on authority and its impact on human interactions.",
    "expanded_word_count": 104
  },
  {
    "id": 1791,
    "course_codes": "APPPHYS 470",
    "course_title": "Condensed Matter Seminar",
    "original_descr": "Current research and literature; offered by faculty, students, and outside specialists. May be repeated for credit.",
    "original_word_count": 16,
    "expanded_descr": "Course Title: Condensed Matter Seminar\n\nExpanded Description: This seminar focuses on the latest developments in condensed matter physics, emphasizing current research and scholarly literature. Participants will engage with presentations from faculty, graduate students, and invited experts, fostering a collaborative environment for knowledge exchange. Students will learn to critically analyze recent findings, discuss experimental techniques, and explore theoretical frameworks that underpin condensed matter phenomena. The course promotes active participation, encouraging students to present their own research and receive constructive feedback. With a dynamic format, this seminar can be repeated for credit, allowing for continuous engagement with evolving topics in the field and deepening understanding of complex materials.",
    "expanded_word_count": 106
  },
  {
    "id": 1800,
    "course_codes": "CHEM 359",
    "course_title": "Inorganic Chemistry Seminar",
    "original_descr": "(Formerly 259) Required of graduate students majoring in inorganic chemistry.",
    "original_word_count": 10,
    "expanded_descr": "Course Title: Inorganic Chemistry Seminar\n\nExpanded Description: This seminar is a vital component for graduate students specializing in inorganic chemistry, fostering a collaborative learning environment. Students will engage in in-depth discussions on contemporary research topics, recent advancements, and the theoretical underpinnings of inorganic chemistry. Through presentations and critical analyses of scholarly articles, participants will enhance their understanding of key concepts and methodologies in the field. The course emphasizes the development of communication skills, as students will present their own research and critique peers' work. By the end of the seminar, students will be equipped with a robust foundation for their future research pursuits in inorganic chemistry.",
    "expanded_word_count": 106
  },
  {
    "id": 1804,
    "course_codes": "COMPLIT 397",
    "course_title": "Graduate Studies Colloquium",
    "original_descr": "Colloquium for graduate students in Comparative Literature. Taught in English. May be repeated for credit.",
    "original_word_count": 15,
    "expanded_descr": "Course Title: Graduate Studies Colloquium\n\nExpanded Description: This colloquium is designed for graduate students specializing in Comparative Literature, offering a dynamic platform for scholarly exchange and intellectual growth. Conducted in English, the course facilitates in-depth discussions on critical literary theories, texts, and cultural contexts across diverse languages and traditions. Students will engage with contemporary research, present their findings, and receive constructive feedback from peers and faculty. Additionally, the course encourages the development of interdisciplinary approaches, fostering a rich understanding of global literary landscapes. Students may repeat this course for credit, allowing for continued exploration of evolving themes and methodologies in Comparative Literature.",
    "expanded_word_count": 102
  },
  {
    "id": 1808,
    "course_codes": "CSRE 301C",
    "course_title": "Graduate Workshop: Comparative Studies in Race and Ethnicity",
    "original_descr": "Required for PhD Minors in Comparative Studies in Race and Ethnicity (CSRE). The spring quarter workshop will focus on professionalization and community engagement.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Graduate Workshop: Comparative Studies in Race and Ethnicity\n\nExpanded Description: This workshop, a requirement for PhD Minors in Comparative Studies in Race and Ethnicity (CSRE), is designed to enhance students' professional skills while fostering community engagement. Throughout the spring quarter, participants will explore methodologies and theories related to race and ethnicity, culminating in practical applications. Students will engage in collaborative projects, develop research proposals, and refine their academic writing. Additionally, the workshop emphasizes networking opportunities with scholars and community leaders, allowing participants to create meaningful connections. By the end, students will be equipped with tools to navigate academic and community landscapes effectively.",
    "expanded_word_count": 104
  },
  {
    "id": 1834,
    "course_codes": "ME 395",
    "course_title": "Seminar in Solid Mechanics",
    "original_descr": "Required of Ph.D. candidates in solid mechanics. Guest speakers present research topics related to mechanics theory, computational methods, and applications in science and engineering. May be repeated for credit.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: Seminar in Solid Mechanics\n\nExpanded Description: This seminar is a foundational requirement for Ph.D. candidates specializing in solid mechanics. Throughout the course, distinguished guest speakers will present cutting-edge research topics, focusing on advanced mechanics theory, innovative computational methods, and practical applications within various fields of science and engineering. Students will engage in critical discussions, enhancing their understanding of contemporary issues and trends in solid mechanics. Additionally, participants will have the opportunity to network with experts, fostering academic collaboration. The seminar may be repeated for credit, allowing for continued exploration of emerging topics and deepening knowledge in this dynamic and essential discipline.",
    "expanded_word_count": 103
  },
  {
    "id": 1821,
    "course_codes": "EDUC 489",
    "course_title": "RILE Colloquium on Race, Inequality, and Language in Education",
    "original_descr": "This course is a workshop for PhD students focusing on interdisciplinary empirical work related to Race, Inequality, and Language in Education.",
    "original_word_count": 21,
    "expanded_descr": "Course Title: RILE Colloquium on Race, Inequality, and Language in Education\n\nExpanded Description: This workshop-style course invites PhD students to explore the intricate connections between race, inequality, and language within educational contexts. Participants will engage in interdisciplinary empirical research, critically analyzing how language shapes educational experiences and perpetuates or challenges systemic inequalities. Through collaborative discussions, presentations, and peer feedback, students will develop research proposals and refine their methodologies. The course will emphasize the importance of diverse perspectives, equipping students with theoretical frameworks and practical skills to conduct impactful research. By the end, participants will be prepared to contribute meaningfully to the discourse on equity and justice in education.",
    "expanded_word_count": 108
  },
  {
    "id": 1831,
    "course_codes": "INDE 211",
    "course_title": "Creative Writing",
    "original_descr": "For medical students - all levels of writing skill. Examines uses of creative writing, including understanding the experience of medical training. May be repeated for credit.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Creative Writing\n\nExpanded Description: This course is designed specifically for medical students of all writing skill levels, offering a unique platform to explore the power of creative writing within the context of healthcare. Students will learn to articulate their experiences in medical training, fostering empathy and reflection through narrative techniques. The curriculum includes various writing exercises, peer workshops, and discussions that encourage self-expression and critical thinking. Participants will delve into themes such as patient experience, emotional resilience, and the art of storytelling in medicine. This course may be repeated for credit, allowing students to further refine their craft and insights.",
    "expanded_word_count": 102
  },
  {
    "id": 1837,
    "course_codes": "MS&E 386",
    "course_title": "Doctoral Research Seminar on Technology & Organizations",
    "original_descr": "Doctoral Research Seminar on Technology & Organizations",
    "original_word_count": 7,
    "expanded_descr": "Course Title: Doctoral Research Seminar on Technology & Organizations\n\nExpanded Description: This seminar is designed for doctoral students exploring the intersection of technology and organizational dynamics. Participants will engage in critical discussions on how technological advancements influence organizational structures, processes, and cultures. Through a combination of lectures, case studies, and collaborative projects, students will develop research proposals, refine methodologies, and enhance their analytical skills. Guest speakers from academia and industry will provide real-world insights, fostering a deeper understanding of contemporary challenges and innovations. By the end of the course, students will be equipped to contribute original research that addresses pressing issues in technology and organizations.",
    "expanded_word_count": 105
  },
  {
    "id": 1839,
    "course_codes": "MS&E 454",
    "course_title": "Decision Analysis Seminar",
    "original_descr": "Current research and related topics presented by doctoral students and invited speakers. May be repeated for credit.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Decision Analysis Seminar\n\nExpanded Description: The Decision Analysis Seminar offers an engaging platform for doctoral students to present cutting-edge research and explore advanced topics in decision-making processes. Participants will engage with invited speakers who are experts in the field, fostering rich discussions and networking opportunities. Each seminar will cover various methodologies, applications, and contemporary issues in decision analysis. Students will enhance their analytical skills, learn to critically evaluate research findings, and gain insights into real-world applications. The course encourages repeated enrollment, allowing students to continuously deepen their understanding and contribute to ongoing discussions in this dynamic field of study.",
    "expanded_word_count": 101
  },
  {
    "id": 1840,
    "course_codes": "MUSIC 310",
    "course_title": "Research Seminar in Musicology",
    "original_descr": "For graduate students. Topics vary each quarter. May be repeated for credit a total of 8 times.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Research Seminar in Musicology\n\nExpanded Description: This graduate-level seminar in Musicology invites students to explore diverse topics that evolve each quarter, reflecting the latest trends and research in the field. Students will engage critically with various musical genres, historical contexts, and theoretical frameworks, enhancing their analytical skills. Through collaborative discussions, presentations, and research projects, participants will develop a deeper understanding of music's cultural significance. The course encourages innovative thinking and fosters the ability to articulate complex ideas effectively. Students may repeat this seminar for credit, allowing them to delve into multiple facets of musicology over a total of eight quarters, enriching their academic journey.",
    "expanded_word_count": 106
  },
  {
    "id": 1844,
    "course_codes": "POLISCI 353C",
    "course_title": "Workshop in Political Methodology",
    "original_descr": "Continuation of POLISCI 353B. Mathematical and statistical models and applications to political science. Guest speakers, faculty, and students present research papers. May be repeated for credit.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Workshop in Political Methodology\n\nExpanded Description: This workshop serves as a continuation of POLISCI 353B, focusing on advanced mathematical and statistical models tailored for political science research. Students will engage deeply with quantitative methodologies, enhancing their analytical skills to tackle complex political phenomena. Through presentations from guest speakers, faculty, and peers, participants will share and critique research papers, fostering a collaborative learning environment. Topics may include regression analysis, data interpretation, and model validation. Students are encouraged to apply these techniques in their own research projects, making this course an invaluable opportunity for skill development and academic growth in political methodology. Repeatable for credit.",
    "expanded_word_count": 105
  },
  {
    "id": 1845,
    "course_codes": "POLISCI 411C",
    "course_title": "Workshop in International Relations",
    "original_descr": "For graduate students. Contemporary work. Organized around presentation of research by students and outside scholars. May be repeated for credit.",
    "original_word_count": 20,
    "expanded_descr": "Course Title: Workshop in International Relations\n\nExpanded Description: This graduate-level workshop offers a dynamic platform for students to engage deeply with contemporary research in international relations. Participants will present their own research projects and receive constructive feedback from peers and distinguished outside scholars, fostering a collaborative academic environment. Through critical discussions, students will refine their analytical skills and enhance their understanding of current global issues. The course also emphasizes the development of effective communication and presentation techniques essential for academic success. With the option to repeat for credit, students can continuously evolve their research and expand their professional network within the field of international relations.",
    "expanded_word_count": 105
  },
  {
    "id": 1847,
    "course_codes": "PSYCH 217",
    "course_title": "Topics and Methods Related to Cultural Psychology",
    "original_descr": "How cultural factors shape psychological processes. Applications to clinical, educational,  occupational settings and to interventions to designed to promote agency, motivation, and well-being.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: Topics and Methods Related to Cultural Psychology\n\nExpanded Description: This course explores the intricate ways in which cultural factors influence psychological processes across diverse contexts. Students will examine key theories and methodologies in cultural psychology, focusing on how cultural dimensions impact mental health, educational outcomes, and workplace dynamics. Through case studies and empirical research, learners will gain insights into designing culturally sensitive interventions aimed at enhancing agency, motivation, and overall well-being. Practical applications will be emphasized, with opportunities for students to engage in collaborative projects that address real-world challenges, fostering a deeper understanding of the interplay between culture and psychology in various settings.",
    "expanded_word_count": 105
  },
  {
    "id": 1848,
    "course_codes": "PSYCH 269",
    "course_title": "Graduate Seminar in Affective Science",
    "original_descr": "May be repeated for credit. Prerequisite: graduate standing in Psychology.",
    "original_word_count": 10,
    "expanded_descr": "Course Title: Graduate Seminar in Affective Science\n\nThis seminar delves into the intricate study of emotions, exploring their psychological, biological, and social dimensions. Students will engage in critical discussions of current research, encompassing theories and methodologies within affective science. Through collaborative projects and presentations, participants will analyze emotional processes, their impact on behavior, and implications for mental health. The course encourages the development of research proposals and fosters innovative thinking. Designed for graduate students in Psychology, this seminar provides opportunities for interdisciplinary dialogue and networking. Students may repeat the course for credit, enriching their understanding of this dynamic and evolving field.",
    "expanded_word_count": 101
  },
  {
    "id": 1852,
    "course_codes": "SOC 318",
    "course_title": "Social Movements and Collective Action",
    "original_descr": "Topics: causes, dynamics, and outcomes of social movements; organizational dimensions of collective action; and causes and consequences of individual activism.",
    "original_word_count": 20,
    "expanded_descr": "In the course \"Social Movements and Collective Action,\" students will explore the multifaceted nature of social movements, delving into their causes, dynamics, and outcomes. Key topics include the organizational structures that facilitate collective action, examining how groups mobilize resources and influence public opinion. Additionally, students will investigate the psychological and social factors that drive individual activism, analyzing both motivations and barriers to participation. Through case studies, interactive discussions, and critical analysis, participants will gain a comprehensive understanding of how social movements shape societal change and the role of citizens in advocating for justice, equality, and reform within their communities.",
    "expanded_word_count": 99
  },
  {
    "id": 1854,
    "course_codes": "SOC 380W",
    "course_title": "Workshop: Qualitative and Fieldwork Methods",
    "original_descr": "Presentations and discussion of ongoing ethnographic, interview-based, and other fieldwork research by faculty and students . May be repeated for credit. Prerequisite: Sociology doctoral student or consent of instructor.",
    "original_word_count": 29,
    "expanded_descr": "Course Title: Workshop: Qualitative and Fieldwork Methods\n\nExpanded Description: This workshop focuses on the exploration and presentation of ongoing ethnographic studies, interview-based research, and diverse fieldwork methodologies conducted by both faculty and students. Participants will engage in critical discussions, receive constructive feedback, and refine their research skills through collaborative learning experiences. Emphasis will be placed on ethical considerations, data collection techniques, and analytical approaches unique to qualitative research. Students will have the opportunity to present their projects, fostering a supportive environment for academic growth. The course may be repeated for credit, enhancing participant expertise in qualitative methodologies. Prerequisite: Enrollment as a Sociology doctoral student or instructor's consent.",
    "expanded_word_count": 107
  },
  {
    "id": 1856,
    "course_codes": "TAPS 335",
    "course_title": "Introduction to Graduate Production",
    "original_descr": "This course introduces first-year TAPS PhD student to the TAPS production process and resources.",
    "original_word_count": 14,
    "expanded_descr": "Course Title: Introduction to Graduate Production\n\nExpanded Description: This foundational course is designed specifically for first-year PhD students in the Theater and Performance Studies (TAPS) program. Students will explore the intricacies of the TAPS production process, gaining insights into various stages including planning, collaboration, and execution. The curriculum emphasizes hands-on experiences with production resources, fostering both practical skills and theoretical understanding. Through workshops, discussions, and guest lectures from industry professionals, students will develop a comprehensive grasp of production dynamics. By the end of the course, participants will be well-equipped to contribute effectively to academic and creative projects within the TAPS community.",
    "expanded_word_count": 101
  },
  {
    "id": 1915,
    "course_codes": "BIO 383",
    "course_title": "Seminar in Population Genetics",
    "original_descr": "Literature review, research, and current problems in the theory and practice of population genetics and molecular evolution. May be repeated for credit. Prerequisite: consent of instructor.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Seminar in Population Genetics\n\nExpanded Description: This seminar offers an in-depth exploration of population genetics, emphasizing literature review, cutting-edge research, and contemporary issues in the theory and practical applications of molecular evolution. Students will engage in critical discussions, analyze recent scientific studies, and present their findings on relevant topics. Through collaborative learning and peer feedback, participants will deepen their understanding of genetic variation, evolutionary processes, and the implications for biodiversity and conservation. The course encourages independent thought and research skills, fostering a comprehensive grasp of population genetics. Enrollment requires the consent of the instructor, and students may repeat the course for additional credit.",
    "expanded_word_count": 105
  },
  {
    "id": 1885,
    "course_codes": "CEE 132C",
    "course_title": "SA+E Colloquium C",
    "original_descr": "Weekly discussion forum for SA+E majors to address a range of architecture, engineering, design, and sustainability topics.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: SA+E Colloquium C\n\nExpanded Description: SA+E Colloquium C is a dynamic weekly discussion forum tailored specifically for students majoring in architecture, engineering, and design. Throughout the semester, participants will engage in stimulating conversations on a diverse array of topics, including cutting-edge sustainability practices, innovative architectural designs, and emerging engineering technologies. The course encourages critical thinking and collaborative problem-solving, allowing students to share their insights and perspectives. Guest speakers from various disciplines will enrich discussions, providing real-world context. By fostering an inclusive environment, this colloquium aims to deepen students’ understanding and appreciation of the interconnectedness of architecture, engineering, design, and sustainability.",
    "expanded_word_count": 102
  },
  {
    "id": 1907,
    "course_codes": "PHIL 199",
    "course_title": "Seminar for Prospective Honors Students",
    "original_descr": "Open to juniors intending to do honors in philosophy. Methods of research in philosophy. Topics and strategies for completing honors project. May be repeated for credit.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Seminar for Prospective Honors Students\n\nExpanded Description: This seminar is designed specifically for juniors who aspire to pursue honors in philosophy. Students will delve into advanced research methodologies pertinent to philosophical inquiry, focusing on both classical and contemporary approaches. The course will cover essential topics, including the formulation of research questions, literature review strategies, and effective argumentation techniques. Participants will engage in collaborative discussions, receive mentorship from faculty, and develop personalized plans for their honors projects. By the end, students will be equipped with the skills and knowledge necessary to successfully complete their honors thesis, making this course repeatable for additional credit and enrichment.",
    "expanded_word_count": 106
  },
  {
    "id": 1930,
    "course_codes": "CS 547",
    "course_title": "Human-Computer Interaction Seminar",
    "original_descr": "Weekly speakers on human-computer interaction topics. May be repeated for credit.",
    "original_word_count": 11,
    "expanded_descr": "Course Title: Human-Computer Interaction Seminar\n\nExpanded Description: This seminar offers an engaging platform featuring weekly guest speakers who are experts in diverse human-computer interaction (HCI) fields. Students will explore cutting-edge topics, including user experience design, cognitive psychology principles, interface usability, and emerging technologies. Each session encourages interactive discussions, allowing students to critically analyze real-world applications and research findings. Participants will also have opportunities to network with professionals and contribute to thought-provoking debates on HCI trends. By the end of the course, students will gain a deeper understanding of HCI’s impact on technology and society, enriching their academic and professional pursuits in this dynamic field.",
    "expanded_word_count": 104
  },
  {
    "id": 1932,
    "course_codes": "ECON 200",
    "course_title": "First-Year Seminar",
    "original_descr": "Restricted to Economics PhD students in their first year. Must be taken in both Winter and Spring Quarters. Enrollment by permission number only.",
    "original_word_count": 23,
    "expanded_descr": "Course Title: First-Year Seminar\n\nExpanded Description: The First-Year Seminar is a crucial component for first-year Economics PhD students, designed to enhance their academic journey. This course, which students must enroll in during both the Winter and Spring Quarters, fosters a collaborative learning environment where participants engage deeply with advanced economic theories and research methodologies. Through discussions, presentations, and peer interactions, students will refine their critical thinking and analytical skills. Additionally, the seminar emphasizes the importance of academic networking and mentorship, providing invaluable opportunities for building relationships with faculty and fellow colleagues. Enrollment is strictly by permission number, ensuring a tailored educational experience.",
    "expanded_word_count": 102
  },
  {
    "id": 1948,
    "course_codes": "LINGUIST 210L",
    "course_title": "Phonology Research Lab",
    "original_descr": "Current topics in phonological theory and analysis. Meetings consist of presentations of ongoing research, collaborative work, and discussions of theoretical and methodological advances in the field.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Phonology Research Lab\n\nIn the Phonology Research Lab, students will engage with contemporary issues in phonological theory and analysis through a hands-on, collaborative approach. The course includes regular presentations of ongoing student research projects, fostering a dynamic environment for feedback and refinement. Participants will also explore cutting-edge theoretical frameworks and methodological advancements in phonology, enhancing their analytical skills. Discussions will encourage critical thinking and the application of concepts to real-world linguistic data. By the end of the course, students will have developed a deeper understanding of phonological patterns, as well as research skills applicable to future academic or professional endeavors.",
    "expanded_word_count": 102
  },
  {
    "id": 1950,
    "course_codes": "LINGUIST 395",
    "course_title": "Research Workshop",
    "original_descr": "Restricted to Linguistics Ph.D. students. Student presentations of research toward qualifying papers. May be repeated for credit.",
    "original_word_count": 17,
    "expanded_descr": "Course Title: Research Workshop\n\nThis specialized workshop is exclusively designed for Linguistics Ph.D. students, focusing on the presentation and discussion of research projects aimed at qualifying papers. Students will engage in a collaborative learning environment, enhancing their critical thinking and presentation skills while receiving constructive feedback from peers and faculty. Participants will explore various research methodologies, refine their arguments, and effectively communicate complex linguistic concepts. Additionally, the course encourages iterative revision based on peer critiques, fostering an atmosphere of academic growth. Students may enroll multiple times for credit, allowing for continued development of their research and presentation abilities throughout their doctoral studies.",
    "expanded_word_count": 102
  },
  {
    "id": 1957,
    "course_codes": "PHIL 239",
    "course_title": "Teaching Methods in Philosophy",
    "original_descr": "For Ph.D. students in their first or second year who are or are about to be teaching assistants for the department. May be repeated for credit.",
    "original_word_count": 26,
    "expanded_descr": "Course Title: Teaching Methods in Philosophy\n\nThis course is specifically designed for first- and second-year Ph.D. students preparing to serve as teaching assistants within the philosophy department. Participants will engage in practical training focused on effective pedagogical techniques tailored to philosophy instruction. The curriculum includes developing lesson plans, fostering critical thinking, and employing various assessment strategies to enhance student learning. Additionally, students will participate in peer teaching exercises and receive constructive feedback to refine their skills. By the end of the course, participants will be equipped with the tools necessary to facilitate engaging discussions and create a supportive learning environment. May be repeated for credit.",
    "expanded_word_count": 105
  },
  {
    "id": 1959,
    "course_codes": "POLISCI 433",
    "course_title": "Workshop in Political Theory",
    "original_descr": "For graduate students. Faculty, guest speakers, and graduate students conducting research in political theory present works-in-progress. May be repeated for credit.",
    "original_word_count": 21,
    "expanded_descr": "Course Title: Workshop in Political Theory\n\nExpanded Description: This graduate-level workshop offers a collaborative platform for students to engage deeply with contemporary political theory. Participants will present their research works-in-progress, receiving constructive feedback from faculty members, guest speakers, and fellow graduate students. The course emphasizes critical discussion, fostering an environment where diverse perspectives are valued. By analyzing various theoretical frameworks and methodologies, students will refine their arguments and enhance their analytical skills. Additionally, the workshop encourages networking opportunities with established scholars in the field. Repeat enrollment is permitted, allowing students to further develop their research projects and contribute to the ongoing discourse in political theory.",
    "expanded_word_count": 105
  }
]