[
  {
    "id": 89,
    "course_codes": "ME 463",
    "course_title": "Advanced Topics in Plasma Science and Engineering",
    "original_descr": "Research areas such as plasma diagnostics, plasma transport, waves and instabilities, and engineering applications.",
    "original_word_count": 14,
    "expanded_descr": "In Advanced Topics in Plasma Science and Engineering, students delve into cutting-edge research areas, including plasma diagnostics, transport, and waves. They explore instabilities and engineering applications, gaining in-depth knowledge of plasma behavior and interactions. Through lectures, discussions, and projects, students analyze complex phenomena, develop problem-solving skills, and apply theoretical concepts to real-world problems. This course provides a comprehensive understanding of plasma science and engineering, preparing students for careers in research, industry, and academia, and fostering innovative solutions to emerging challenges in plasma technology and its applications, with hands-on experience and collaborative learning opportunities always encouraged actively.",
    "expanded_word_count": 96
  },
  {
    "id": 96,
    "course_codes": "PHIL 370E",
    "course_title": "Adventures in Non-Consequentialist Ethics",
    "original_descr": "Topic: The Paradox of Deontology and Adventures in Non-Consequentialist Ethics. Grad seminar. 2 unit option only for Philosophy PhDs beyond the second year.",
    "original_word_count": 23,
    "expanded_descr": "In Adventures in Non-Consequentialist Ethics, Philosophy PhD students beyond their second year delve into the paradox of deontology. This 2-unit graduate seminar explores the intricacies of non-consequentialist ethical theories, challenging students to navigate complex moral dilemmas. Through in-depth discussions and analyses, students will examine the tensions between deontological and consequentialist approaches, developing a nuanced understanding of ethical decision-making. By investigating the implications of non-consequentialism, students will refine their critical thinking and argumentation skills, preparing them for advanced research in ethics and moral philosophy, and fostering a deeper understanding of the subject matter and its applications always.",
    "expanded_word_count": 96
  },
  {
    "id": 1585,
    "course_codes": "CEE 132B",
    "course_title": "SA+E Colloquium B",
    "original_descr": "Weekly discussion forum for SA+E majors to address a range of architecture, engineering, design, and sustainability topics.",
    "original_word_count": 17,
    "expanded_descr": "In SA+E Colloquium B, majors engage in weekly discussions on architecture, engineering, design, and sustainability. Exploring cutting-edge topics and industry trends, students develop critical thinking and collaboration skills. Through guest lectures, case studies, and group debates, participants examine innovative solutions and best practices. This forum fosters a community of learners, encouraging interdisciplinary dialogue and creative problem-solving. By sharing knowledge and experiences, students broaden their understanding of SA+E principles and applications, preparing them for professional practice and leadership roles in sustainable and innovative built environments, while developing essential communication and teamwork skills in a dynamic setting always.",
    "expanded_word_count": 96
  },
  {
    "id": 6,
    "course_codes": "SLAVIC 188 / SLAVIC 388",
    "course_title": "20th century Russian Poetry: From Aleksandr Blok to Joseph Brodsky",
    "original_descr": "Developments in and 20th-century Russian poetry including symbolism, acmeism, futurism, and literature of the absurd. Emphasis is on close readings of individual poems. Readings in Russian, taught in English.",
    "original_word_count": 29,
    "expanded_descr": "Explore 20th-century Russian poetry from Aleksandr Blok to Joseph Brodsky, delving into symbolism, acmeism, futurism, and absurdism. Through close readings of individual poems in Russian, students will analyze literary movements and their cultural context. Taught in English, this course emphasizes nuanced understanding of poetic language and form. Students will engage with major works, exploring themes and styles that defined Russian modernism. By examining the intersection of poetry and politics, students will gain a deeper understanding of Russia's rich literary heritage and its enduring influence on world literature, fostering a rich and immersive learning experience always.",
    "expanded_word_count": 95
  },
  {
    "id": 698,
    "course_codes": "ECON 200",
    "course_title": "First-Year Seminar",
    "original_descr": "Restricted to Economics PhD students in their first year. Must be taken in both Winter and Spring Quarters. Enrollment by permission number only.",
    "original_word_count": 23,
    "expanded_descr": "In the First-Year Seminar, Economics PhD students engage in a rigorous, two-quarter exploration of foundational concepts and research methods. Restricted to first-year students, this course fosters a collaborative environment for academic growth and networking. Through lectures, discussions, and workshops, students develop essential skills in economic theory, empirical analysis, and scholarly writing. By permission number only, enrollment is limited to ensure personalized attention and mentorship. Students gain a comprehensive understanding of the field, preparing them for success in their graduate program and future careers in economics, with a strong foundation for original research and intellectual discovery and growth always.",
    "expanded_word_count": 98
  },
  {
    "id": 12,
    "course_codes": "ASLLANG 1A",
    "course_title": "Accelerated First- Year American Sign Language",
    "original_descr": "Completes first-year sequence in two rather than three quarters. Course emphasizes development of comprehension and production skills using daily life topics. Focus on cultural awareness necessary for communication.",
    "original_word_count": 28,
    "expanded_descr": "In Accelerated First-Year American Sign Language, students complete the first-year sequence in two quarters, intensively developing comprehension and production skills. Daily life topics are used to teach vocabulary, grammar, and storytelling. Cultural awareness and sensitivity are emphasized to foster effective communication. Through interactive lessons and immersive activities, students gain a deeper understanding of the Deaf community and its customs, preparing them for real-world interactions and further language study, with a focus on practical application and cultural competence, enabling students to communicate confidently and respectfully. Engaging instruction and supportive feedback facilitate rapid language acquisition and proficiency.",
    "expanded_word_count": 95
  },
  {
    "id": 13,
    "course_codes": "ARABLANG 1A",
    "course_title": "Accelerated First-Year Arabic, Part I",
    "original_descr": "Completes first-year sequence in two rather than three quarters.",
    "original_word_count": 9,
    "expanded_descr": "In Accelerated First-Year Arabic, Part I, students rapidly progress through the first-year sequence in two quarters. This intensive course covers foundational Arabic skills, including reading, writing, and conversing. Students learn the Arabic alphabet, basic grammar, and vocabulary, while exploring Arabic culture. Interactive lessons and immersive activities foster language proficiency and cultural understanding. By completing the sequence in an accelerated timeframe, students prepare for advanced Arabic studies and develop a strong foundation for future language pursuits, enabling them to engage with Arabic-speaking communities and explore the rich cultural heritage of the Arab world effectively and confidently always.",
    "expanded_word_count": 96
  },
  {
    "id": 14,
    "course_codes": "ARABLANG 2A",
    "course_title": "Accelerated First-Year Arabic, Part II",
    "original_descr": "Completes first-year sequence in two rather than three quarters. Prerequisite: Placement Test, completion of ARABLANG 1A. This course fulfills the University Foreign Language Requirement.",
    "original_word_count": 24,
    "expanded_descr": "In Accelerated First-Year Arabic, Part II, students rapidly build upon foundational skills, completing the first-year sequence in two quarters. Prerequisites include a placement test and ARABLANG 1A. This intensive course fulfills the University Foreign Language Requirement, immersing students in Arabic language and culture. Students will engage in interactive lessons, developing reading, writing, and conversational abilities. Through texts, discussions, and multimedia resources, learners will explore Arabic dialects, grammar, and vocabulary, preparing them for advanced studies and real-world applications, with a strong emphasis on pronunciation, comprehension, and communication skills, leading to proficiency and cultural competence.",
    "expanded_word_count": 93
  },
  {
    "id": 25,
    "course_codes": "ARABLANG 22A",
    "course_title": "Accelerated second-Year Arabic, Part II",
    "original_descr": "Completes Second-year sequence in two rather than three quarters. For students with previous knowledge of Arabic. Prerequisite: Placement Test, ARABLANG 21A.",
    "original_word_count": 21,
    "expanded_descr": "Accelerated Second-Year Arabic, Part II, completes the second-year sequence in two quarters. Designed for students with prior Arabic knowledge, this course builds on existing skills. Prerequisite: Placement Test and ARABLANG 21A. Students will engage in intensive language instruction, refining reading, writing, and conversational abilities. They will explore complex grammatical structures, vocabulary, and cultural nuances, preparing them for advanced Arabic studies. Through interactive lessons and immersive activities, students will enhance their proficiency and develop a deeper understanding of the Arabic language and its rich cultural context, enabling effective communication and academic success. Language skills will flourish rapidly.",
    "expanded_word_count": 96
  },
  {
    "id": 26,
    "course_codes": "ITALLANG 21A",
    "course_title": "Accelerated Second-Year Italian, Part 1",
    "original_descr": "Continuation of ITALLANG 2A or Italian 3. For students going to Florence. Completes second-year sequence in two rather than three quarters. Prerequisite: placement test, ITALLANG 2A, ITALLANG 3.",
    "original_word_count": 28,
    "expanded_descr": "In Accelerated Second-Year Italian, Part 1, students build on prior knowledge, completing the second-year sequence in two quarters. Designed for students heading to Florence, this course intensifies language skills through interactive lessons and cultural immersion. Prerequisites include a placement test, ITALLANG 2A, or ITALLANG 3. Students refine grammar, vocabulary, and communication skills, exploring Italian literature, history, and society. Engaging activities and discussions prepare students for academic and personal success in Florence, fostering a deeper understanding of Italian culture and language, and equipping them with essential tools for effective communication and navigation in Italy's vibrant cities easily.",
    "expanded_word_count": 96
  },
  {
    "id": 763,
    "course_codes": "MATH 121",
    "course_title": "Galois Theory",
    "original_descr": "Field of fractions, splitting fields, separability, finite fields. Galois groups, Galois correspondence, examples and applications. Prerequisite: Math 120 and (also recommended) 113.",
    "original_word_count": 22,
    "expanded_descr": "In Galois Theory, explore field extensions, splitting fields, and separability. Discover finite fields and Galois groups, examining the fundamental Galois correspondence. Through examples and applications, develop a deep understanding of symmetry and solvability. Prerequisites include Math 120 and recommended Math 113. This course delves into abstract algebra, providing a rich framework for problem-solving and theoretical exploration, preparing students for advanced mathematical studies and fostering critical thinking, analytical skills, and mathematical maturity, with rigorous proofs and theorems, and interactive discussions, in a supportive learning environment, for mathematics majors and enthusiasts, with a strong foundation in algebra.",
    "expanded_word_count": 95
  },
  {
    "id": 46,
    "course_codes": "INDE 254",
    "course_title": "Advanced English for Non-Native Speakers",
    "original_descr": "Course designed to refine the proficiency and fluency in academic speaking and writing for non-native English speakers.",
    "original_word_count": 17,
    "expanded_descr": "Advanced English for Non-Native Speakers is a comprehensive course designed to refine proficiency and fluency in academic speaking and writing. Students will engage in interactive discussions, debates, and presentations to enhance their communication skills. Through targeted writing workshops, they will develop clarity, coherence, and precision in academic writing. Authentic materials and real-life scenarios will be used to foster critical thinking and cultural awareness. By the end of the course, students will demonstrate significant improvement in their English language skills, enabling them to succeed in academic and professional settings with confidence and accuracy always. Effective learning is guaranteed here.",
    "expanded_word_count": 98
  },
  {
    "id": 47,
    "course_codes": "ENGLISH 290",
    "course_title": "Advanced Fiction Writing",
    "original_descr": "Workshop critique of original short stories or novel.",
    "original_word_count": 8,
    "expanded_descr": "In Advanced Fiction Writing, students engage in a rigorous workshop critique of original short stories or novel excerpts. Through peer review and instructor feedback, writers refine their craft, exploring techniques for character development, plot structure, and lyrical prose. Students analyze published works, discuss literary devices, and apply new skills to their own writing. This immersive course fosters a supportive community, helping writers polish their unique voice and style, and produce a polished manuscript, preparing them for publication or further creative writing pursuits with confidence and skill, and a deeper understanding of the writing process and industry.",
    "expanded_word_count": 96
  },
  {
    "id": 826,
    "course_codes": "CSRE 301B",
    "course_title": "Graduate Workshop: Comparative Studies in Race and Ethnicity",
    "original_descr": "Required for PhD Minors in Comparative Studies in Race and Ethnicity (CSRE). Students in the Winter Phd Minor Workshop will present and offer feedback on works in progress.",
    "original_word_count": 28,
    "expanded_descr": "In the Graduate Workshop: Comparative Studies in Race and Ethnicity, PhD Minor students engage in a dynamic, peer-driven environment. Through presentations and feedback sessions, participants refine their research and analytical skills, exploring intersections of race, ethnicity, and social justice. Students receive constructive criticism on their works-in-progress, fostering a supportive community of scholars. This workshop cultivates nuanced understanding of comparative studies, preparing students for advanced research and academic careers, while promoting intellectual growth and interdisciplinary collaboration, essential for producing innovative, impactful scholarship in the field of Comparative Studies in Race and Ethnicity, every winter quarter effectively.",
    "expanded_word_count": 95
  },
  {
    "id": 1644,
    "course_codes": "PHIL 365",
    "course_title": "Seminar in Philosophy of Physics",
    "original_descr": "2 unit option only for Philosophy PhD students beyond the second year.",
    "original_word_count": 12,
    "expanded_descr": "In the Seminar in Philosophy of Physics, advanced Philosophy PhD students delve into fundamental concepts and debates at the intersection of physics and philosophy. Exploring topics like spacetime, quantum mechanics, and thermodynamics, students analyze and discuss key theories and their implications. Through readings, discussions, and presentations, students develop critical thinking and research skills, examining the philosophical underpinnings of physical theories and their broader significance. This 2-unit seminar fosters in-depth exploration and intellectual exchange, preparing students for specialized research in the philosophy of physics, available only to students beyond their second year of study and research.",
    "expanded_word_count": 95
  },
  {
    "id": 83,
    "course_codes": "POLISCI 210F / POLISCI 310F",
    "course_title": "Advanced Topics in Climate Change",
    "original_descr": "Advanced seminar course on climate politics.",
    "original_word_count": 6,
    "expanded_descr": "In Advanced Topics in Climate Change, students delve into the complexities of climate politics, exploring global governance, policy frameworks, and societal implications. Through discussions, case studies, and expert guest lectures, participants analyze the intersection of science, economics, and politics in addressing climate change. Students develop critical thinking and problem-solving skills, evaluating international agreements, national policies, and local initiatives. This seminar fosters a deep understanding of climate change mitigation and adaptation strategies, preparing students for careers in environmental policy, sustainability, and climate advocacy, enabling them to contribute to a more sustainable future effectively and responsibly always.",
    "expanded_word_count": 95
  },
  {
    "id": 85,
    "course_codes": "PHIL 383",
    "course_title": "Advanced Topics in Epistemology",
    "original_descr": "May be repeated for credit. 2 unit option is only for Phil PhD students beyond the second year.",
    "original_word_count": 18,
    "expanded_descr": "In Advanced Topics in Epistemology, students delve into complex issues in knowledge theory, exploring cutting-edge debates and research. This repeatable course offers in-depth examination of specialized topics, fostering advanced critical thinking and analysis. Phil PhD students beyond their second year can opt for a 2-unit version, tailoring their study to suit their research needs. Through rigorous discussion and writing, students refine their understanding of epistemological concepts, developing expertise in this fundamental area of philosophy, and enhancing their academic and professional pursuits with nuanced insights into the nature of knowledge and belief, and its implications, every semester.",
    "expanded_word_count": 96
  },
  {
    "id": 88,
    "course_codes": "OIT 606",
    "course_title": "Advanced Topics in Optimization",
    "original_descr": "Exact topics TBD, but will include real-time optimization in different settings.",
    "original_word_count": 11,
    "expanded_descr": "In Advanced Topics in Optimization, students explore cutting-edge techniques in real-time optimization across various domains. Exact topics will be determined, but may include stochastic optimization, dynamic programming, and machine learning. Through lectures, discussions, and hands-on exercises, students will analyze and solve complex problems, developing skills in optimization modeling, algorithm design, and implementation. Real-world case studies and applications will illustrate key concepts, preparing students to tackle challenging optimization problems in their future careers, with a focus on adaptability, critical thinking, and innovative problem-solving, in a dynamic and interactive learning environment with expert instruction and feedback always available.",
    "expanded_word_count": 96
  },
  {
    "id": 113,
    "course_codes": "POLISCI 420A",
    "course_title": "American Political Institutions",
    "original_descr": "Theories of American politics, focusing on Congress, the presidency, the bureaucracy, and the courts.",
    "original_word_count": 14,
    "expanded_descr": "In American Political Institutions, students explore foundational theories of American politics, delving into the intricacies of Congress, the presidency, bureaucracy, and judiciary. Through case studies and analysis, learners examine the roles and relationships between these institutions, gaining insight into their functions, powers, and limitations. By evaluating historical and contemporary examples, students develop a nuanced understanding of the American political system, fostering critical thinking and informed civic engagement, and preparing them for careers in public policy, law, and governance, with a deeper appreciation for the complexities of American democracy and its institutions in action every day.",
    "expanded_word_count": 95
  },
  {
    "id": 1645,
    "course_codes": "BIO 383",
    "course_title": "Seminar in Population Genetics",
    "original_descr": "Literature review, research, and current problems in the theory and practice of population genetics and molecular evolution. May be repeated for credit. Prerequisite: consent of instructor.",
    "original_word_count": 26,
    "expanded_descr": "In the Seminar in Population Genetics, students delve into the latest research and theories in population genetics and molecular evolution. Through literature reviews and discussions, participants explore current problems and methodologies. With instructor consent, students can repeat the course for credit, allowing for in-depth examination of specialized topics. This seminar provides a unique opportunity for students to engage with cutting-edge research, develop critical thinking skills, and apply theoretical concepts to real-world problems, fostering a deeper understanding of the field and its applications in a dynamic and interactive learning environment with expert guidance and support always available online.",
    "expanded_word_count": 97
  },
  {
    "id": 2010,
    "course_codes": "POLISCI 433",
    "course_title": "Workshop in Political Theory",
    "original_descr": "For graduate students. Faculty, guest speakers, and graduate students conducting research in political theory present works-in-progress. May be repeated for credit.",
    "original_word_count": 21,
    "expanded_descr": "In the Workshop in Political Theory, graduate students engage with faculty and guest speakers presenting cutting-edge research. Participants share and discuss works-in-progress, receiving constructive feedback and refining their ideas. This collaborative environment fosters intellectual growth, critical thinking, and scholarly development. Students gain exposure to diverse theoretical perspectives and methodologies, enhancing their research skills and knowledge of political theory. Repeated enrollments allowed, enabling ongoing engagement with evolving topics and debates, and supporting students' advancement in their academic and professional pursuits in political theory and related fields of study and research expertise. Credits are repeatable.",
    "expanded_word_count": 93
  },
  {
    "id": 140,
    "course_codes": "ENERGY 281",
    "course_title": "Applied Mathematics in Sustainability",
    "original_descr": "The philosophy of the solution of engineering problems. Methods of solution of partial differential equations: Laplace transforms, Fourier transforms, wavelet transforms, Green's functions, and boundary element methods.",
    "original_word_count": 27,
    "expanded_descr": "In Applied Mathematics in Sustainability, students explore philosophical approaches to solving engineering problems. The course delves into methods for solving partial differential equations, including Laplace, Fourier, and wavelet transforms. Green's functions and boundary element methods are also covered. Through real-world applications, students develop problem-solving skills and learn to apply mathematical techniques to sustainability challenges. By combining theory and practice, students gain a deep understanding of mathematical modeling and its role in addressing environmental and societal issues, preparing them for careers in sustainable engineering and related fields with a strong mathematical foundation and problem-solving expertise always.",
    "expanded_word_count": 95
  },
  {
    "id": 182,
    "course_codes": "EDUC 228G",
    "course_title": "Becoming Literate in School III",
    "original_descr": "Third in a three-course required sequence of reading and language arts theory and methodology for candidates in STEP Elementary Teacher program. Theories for guiding instruction and curricular choices.",
    "original_word_count": 28,
    "expanded_descr": "In Becoming Literate in School III, elementary teacher candidates explore advanced reading and language arts theories, methodologies, and curricular design. Building on previous courses, students analyze instructional strategies, assess literacy development, and make informed curricular choices. Through discussions, case studies, and lesson planning, candidates refine their teaching practices, fostering a supportive learning environment that promotes student literacy and academic success, and preparing them for effective elementary classroom instruction and leadership, with a focus on equity, diversity, and inclusion, culminating in a comprehensive understanding of literacy education and its application in elementary school settings and teaching practices effectively.",
    "expanded_word_count": 97
  },
  {
    "id": 187,
    "course_codes": "CLASSICS 2G",
    "course_title": "Beginning Greek",
    "original_descr": "Continuation of CLASSICS 1G. Vocabulary and syntax of the classical language.",
    "original_word_count": 11,
    "expanded_descr": "In Beginning Greek, students build upon foundational knowledge from CLASSICS 1G, delving deeper into the vocabulary and syntax of the classical language. Through interactive lessons and immersive exercises, learners develop reading proficiency and comprehension skills. Exploring ancient Greek texts, students analyze grammatical structures, verb conjugations, and sentence composition. By mastering the language, students gain insight into ancient Greek culture, literature, and history, fostering a richer understanding of the classical world and its enduring influence on Western civilization, while cultivating critical thinking and linguistic expertise in a supportive and engaging academic environment, every step of the way always.",
    "expanded_word_count": 97
  },
  {
    "id": 189,
    "course_codes": "CLASSICS 2L",
    "course_title": "Beginning Latin",
    "original_descr": "(Formerly CLASSLAT 2.) Vocabulary and syntax of the classical language. Prerequisite: CLASSICS 1L or equivalent placement.",
    "original_word_count": 16,
    "expanded_descr": "In Beginning Latin, students delve into the vocabulary and syntax of the classical language, building upon foundational knowledge. Prerequisite CLASSICS 1L or equivalent placement ensures a solid starting point. Through interactive lessons and exercises, students develop reading and translation skills, exploring Latin's grammatical structures and nuances. Engaging with authentic texts, they gain insight into Roman culture and history, fostering a deeper understanding of the language and its enduring impact on modern languages and society, while developing critical thinking and analytical skills in a supportive and immersive learning environment, laying the groundwork for further Latin studies and exploration.",
    "expanded_word_count": 97
  },
  {
    "id": 349,
    "course_codes": "PHIL 370W",
    "course_title": "Consequentialism",
    "original_descr": "Grad seminar. 2 unit option only for Philosophy PhDs beyond the second year.",
    "original_word_count": 13,
    "expanded_descr": "In Consequentialism, a 2-unit graduate seminar, Philosophy PhD students beyond their second year delve into the ethical theory that actions are right if they produce the best outcomes. Students examine historical and contemporary consequentialist theories, analyzing their strengths and weaknesses. Through rigorous discussions and written assignments, participants develop a deep understanding of the subject, applying consequentialist principles to real-world dilemmas and evaluating their implications. This advanced seminar fosters critical thinking, nuanced argumentation, and expertise in ethical decision-making, preparing students for specialized research and academic pursuits in philosophy, ethics, and related fields of study and professional practice.",
    "expanded_word_count": 96
  },
  {
    "id": 288,
    "course_codes": "MUSIC 74C",
    "course_title": "Classical Guitar Class",
    "original_descr": "May be repeated for credit a total of 14 times. Zero unit enrollment option available with instructor permission. See website: (http://music.stanford.edu) for policy and procedure.",
    "original_word_count": 25,
    "expanded_descr": "In the Classical Guitar Class, students refine their technique and artistry through individualized instruction and ensemble playing. With permission, zero-unit enrollment is available. This course may be repeated for credit up to 14 times, allowing for continuous growth and improvement. Through the Stanford Music Department's website, students access policies and procedures. By exploring repertoire and styles, students develop musicality and performance skills, preparing for recitals and other musical opportunities, and cultivating a deeper appreciation for classical guitar music and its rich cultural heritage, all under the guidance of experienced instructors. Technique and artistry are emphasized equally.",
    "expanded_word_count": 96
  },
  {
    "id": 384,
    "course_codes": "ENGLISH 91",
    "course_title": "Creative Nonfiction",
    "original_descr": "Historical and contemporary as a broad genre including travel and nature writing, memoir, biography, journalism, and the personal essay. Students use creative means to express factual content.",
    "original_word_count": 27,
    "expanded_descr": "In Creative Nonfiction, students explore historical and contemporary forms, including travel and nature writing, memoir, biography, journalism, and personal essays. Through creative expression, they convey factual content, developing unique voices and styles. By analyzing notable authors and crafting their own pieces, students master techniques for engaging narrative, descriptive writing, and reflective storytelling. This course fosters critical thinking, research, and writing skills, empowering students to produce compelling, fact-based stories that inform, inspire, and captivate audiences, while discovering the versatility and power of creative nonfiction as a literary genre and effective communication tool always.",
    "expanded_word_count": 92
  },
  {
    "id": 305,
    "course_codes": "PHIL 366C",
    "course_title": "Cognitive Science & Machine Learning",
    "original_descr": "Graduate seminar. 2 unit option only for Philosophy PhDs beyond the second year.",
    "original_word_count": 13,
    "expanded_descr": "In this 2-unit graduate seminar, Philosophy PhDs beyond their second year delve into Cognitive Science and Machine Learning. Exploring the intersection of human cognition and artificial intelligence, students analyze complex systems and models. Through discussions and case studies, they examine the philosophical implications of machine learning on cognition, intelligence, and decision-making. This seminar fosters critical thinking, interdisciplinary collaboration, and in-depth understanding of cognitive science and machine learning principles, equipping students with advanced knowledge and skills to navigate the evolving landscape of artificial intelligence and its philosophical applications, developing innovative research and solutions, and expertise.",
    "expanded_word_count": 94
  },
  {
    "id": 313,
    "course_codes": "PSYCH 271",
    "course_title": "Communicating Psychology",
    "original_descr": "A graduate seminar on writing and communication of psychological research, both for our colleagues and audiences outside the field.",
    "original_word_count": 19,
    "expanded_descr": "In Communicating Psychology, a graduate seminar, students master writing and communication strategies for psychological research. They learn to effectively convey complex findings to colleagues and broader audiences, tailoring messages for diverse contexts. Through interactive discussions, writing workshops, and peer feedback, students refine their skills in crafting engaging research summaries, academic papers, and public outreach materials. This course enhances their ability to share psychological insights with precision, clarity, and impact, preparing them for successful academic and professional careers in psychology, while fostering a community of effective science communicators and promoting public understanding of psychological research and its applications broadly.",
    "expanded_word_count": 98
  },
  {
    "id": 345,
    "course_codes": "APPPHYS 470",
    "course_title": "Condensed Matter Seminar",
    "original_descr": "Current research and literature; offered by faculty, students, and outside specialists. May be repeated for credit.",
    "original_word_count": 16,
    "expanded_descr": "In the Condensed Matter Seminar, students engage with current research and literature through presentations by faculty, peers, and visiting specialists. This dynamic course fosters discussion and debate on cutting-edge topics, allowing students to deepen their understanding of condensed matter physics. Repeated for credit, the seminar encourages ongoing exploration and examination of emerging concepts and methodologies. Students develop critical thinking, analytical, and communication skills, preparing them for advanced research and academic pursuits in the field of condensed matter physics and related disciplines, with a focus on innovation and discovery, and hands-on learning experiences. New topics are explored.",
    "expanded_word_count": 96
  },
  {
    "id": 1951,
    "course_codes": "UROL 199",
    "course_title": "Undergraduate Research",
    "original_descr": "Students undertake investigations sponsored by individual faculty members. Prerequisite: consent of instructor.",
    "original_word_count": 12,
    "expanded_descr": "In Undergraduate Research, students collaborate with faculty mentors on investigations in their field of expertise. With instructor consent, students design and conduct research projects, developing critical thinking and problem-solving skills. Through hands-on experience, they collect and analyze data, interpret results, and present findings. This course fosters academic growth, independence, and creativity, preparing students for future research endeavors and careers. Students gain valuable experience working closely with faculty, enhancing their understanding of research methodologies and contributing to innovative discoveries in their chosen discipline, under the guidance of experienced faculty members and mentors always.",
    "expanded_word_count": 92
  },
  {
    "id": 375,
    "course_codes": "HISTORY 351D",
    "course_title": "Core in American History, Part IV",
    "original_descr": "May be repeated once for credit.",
    "original_word_count": 6,
    "expanded_descr": "In Core in American History, Part IV, students delve into the complexities of American history, exploring pivotal events and themes. This course may be repeated once for credit, allowing for in-depth examination of distinct eras or topics. Through lectures, discussions, and analyses, students gain a nuanced understanding of the nation's development, from colonialism to modern times. Engaging with primary sources and scholarly interpretations, students develop critical thinking and research skills, fostering a deeper appreciation for the rich and diverse American experience, and its ongoing impact on contemporary society and culture, with a focus on historical context.",
    "expanded_word_count": 96
  },
  {
    "id": 1952,
    "course_codes": "ANTHRO 92B",
    "course_title": "Undergraduate Research Proposal Writing Workshop",
    "original_descr": "Practicum. Students develop independent research projects and write research proposals. How to formulate a research question; how to integrate theory and field site; and step-by-step proposal writing.",
    "original_word_count": 27,
    "expanded_descr": "In the Undergraduate Research Proposal Writing Workshop, students develop independent research projects and craft compelling proposals. Through hands-on exercises and guided instruction, students learn to formulate research questions, integrate theory with field site observations, and write clear, concise proposals. Step-by-step guidance and peer feedback help students refine their ideas and produce polished proposals. By the end of the workshop, students will have a well-developed research plan and a strong proposal, preparing them for undergraduate research opportunities and future academic pursuits with confidence and a solid foundation in research design and writing, essential for academic success and growth always.",
    "expanded_word_count": 98
  },
  {
    "id": 397,
    "course_codes": "BIOE 320",
    "course_title": "Cryogenic electron microscopy and tomography",
    "original_descr": "Physical and computational principles of cryoEM and cryoET and examples of Biological Applications",
    "original_word_count": 13,
    "expanded_descr": "In Cryogenic Electron Microscopy and Tomography, students explore physical and computational principles of cryoEM and cryoET. Through lectures and discussions, they examine the instrumentation, data collection, and image processing techniques. The course highlights biological applications, including structural biology and cellular imaging. Students analyze case studies and examples, gaining hands-on experience with data analysis software. By the end, they understand the capabilities and limitations of cryoEM and cryoET, preparing them for research in biology, biochemistry, and biophysics, with a deep understanding of these powerful microscopy techniques and their role in advancing biological discovery and research methods always.",
    "expanded_word_count": 96
  },
  {
    "id": 411,
    "course_codes": "BIOC 390",
    "course_title": "Curricular Practical Training",
    "original_descr": "CPT Course required for international students completing degree requirements.",
    "original_word_count": 9,
    "expanded_descr": "Curricular Practical Training is a mandatory course for international students nearing degree completion. This immersive experience integrates theoretical knowledge with practical skills, enhancing career readiness. Students apply academic learning to real-world scenarios, developing industry-specific expertise and networking opportunities. Through CPT, international students gain valuable work experience, build professional portfolios, and strengthen their resumes, ultimately increasing employability and competitiveness in the global job market, while complying with F-1 visa regulations and fulfilling degree requirements, preparing them for successful transitions into their chosen careers and beyond, with improved skills and confidence, and a deeper understanding of their field.",
    "expanded_word_count": 96
  },
  {
    "id": 412,
    "course_codes": "EDUC 262C",
    "course_title": "Curriculum and Instruction in English",
    "original_descr": "Approaches to teaching English in the secondary school, including goals for instruction, teaching techniques, and methods of evaluation. (STEP)",
    "original_word_count": 19,
    "expanded_descr": "In Curriculum and Instruction in English, students explore effective approaches to teaching English in secondary schools. The course covers instructional goals, teaching techniques, and evaluation methods, preparing future educators to design engaging lessons and assess student learning. Through discussions, activities, and case studies, students develop a deep understanding of English curriculum design, instructional strategies, and classroom management, enabling them to create supportive learning environments that foster academic achievement and a love of English language and literature, ultimately enhancing their teaching practices and student outcomes in the secondary school setting effectively every day.",
    "expanded_word_count": 92
  },
  {
    "id": 414,
    "course_codes": "EDUC 263C",
    "course_title": "Curriculum and Instruction in Mathematics",
    "original_descr": "The purposes and programs of mathematics in the secondary curriculum; teaching materials, methods. Prerequisite: STEP student or consent of instructor. (STEP) 263A. Sum, 263B. Aut, 263C. Win",
    "original_word_count": 27,
    "expanded_descr": "In Curriculum and Instruction in Mathematics, students explore the purposes and programs of secondary mathematics education. They examine teaching materials, methods, and best practices, gaining insight into effective instructional strategies. STEP students or those with instructor consent delve into curriculum design, lesson planning, and assessment techniques. Through discussions and hands-on activities, students develop skills to create engaging math lessons, fostering a deep understanding of mathematical concepts and their application. This course is offered in summer, autumn, and winter sessions, providing flexibility for students to enhance their math education skills. Practical experience is emphasized throughout the course sessions.",
    "expanded_word_count": 97
  },
  {
    "id": 416,
    "course_codes": "EDUC 264C",
    "course_title": "Curriculum and Instruction in World Languages",
    "original_descr": "Approaches to teaching foreign languages in the secondary school, including goals for instruction, teaching techniques, and methods of evaluation. Prerequisite: STEP student. (STEP)",
    "original_word_count": 23,
    "expanded_descr": "In Curriculum and Instruction in World Languages, STEP students explore effective approaches to teaching foreign languages in secondary schools. This course covers instructional goals, teaching techniques, and evaluation methods, providing a comprehensive understanding of language education. Students analyze various teaching strategies, discuss current methodologies, and develop skills to design engaging lessons, assessing student progress and understanding. Through discussions and activities, students gain practical experience and insights to become proficient world language instructors, preparing them for successful teaching careers and enhancing their ability to foster linguistic and cultural competence in diverse learners, meeting the needs of a global community effectively always.",
    "expanded_word_count": 100
  },
  {
    "id": 671,
    "course_codes": "FRENLANG 1",
    "course_title": "First-Year French, First Quarter",
    "original_descr": "Proficiency-based. Development of discourse appropriate in French and Francophone contexts. Prerequisite: no previous exposure to French",
    "original_word_count": 16,
    "expanded_descr": "In First-Year French, First Quarter, students embark on a proficiency-based journey, developing discourse skills in French and Francophone contexts. With no prior French exposure required, learners engage in interactive lessons, cultivating vocabulary, grammar, and pronunciation. Through authentic materials and immersive activities, students acquire language skills for everyday communication, exploring French culture and customs. By quarter's end, students demonstrate foundational proficiency, preparing them for continued language study and cultural exploration, with a solid base for future academic and professional pursuits in French-speaking environments, both locally and globally, with confidence and accuracy in their language abilities gradually increasing.",
    "expanded_word_count": 96
  },
  {
    "id": 672,
    "course_codes": "FRENLANG 2",
    "course_title": "First-Year French, Second Quarter",
    "original_descr": "Continuation of FRENLANG 1. Proficiency-based. Development of discourse appropriate in French and Francophone contexts. Recent placement Test, completion of FRENLANG 1 or consent of French coordinator.",
    "original_word_count": 26,
    "expanded_descr": "In First-Year French, Second Quarter, students build on foundational skills, developing proficiency in discourse suitable for French and Francophone contexts. Through interactive lessons, participants enhance vocabulary, grammar, and pronunciation. Recent placement test, completion of FRENLANG 1, or consent of the French coordinator is required. Engaging activities and authentic materials foster linguistic and cultural competence, preparing students for real-world communication. By the end of the quarter, learners will demonstrate improved language skills, enabling them to navigate everyday situations with confidence and accuracy, and deepen their understanding of French-speaking cultures and communities, with a focus on practical application.",
    "expanded_word_count": 96
  },
  {
    "id": 439,
    "course_codes": "CHEM 300 / PHYSICS 302",
    "course_title": "Department Colloquium",
    "original_descr": "Required of graduate students. May be repeated for credit.",
    "original_word_count": 9,
    "expanded_descr": "In the Department Colloquium, graduate students engage with faculty and peers to explore cutting-edge research and trends. Required for graduate students, this course may be repeated for credit, allowing for ongoing professional development. Through seminars, discussions, and presentations, students broaden their knowledge, refine critical thinking, and enhance communication skills. Guests from academia and industry share insights, fostering a dynamic learning environment. Students gain a deeper understanding of their field, network with professionals, and develop essential skills for academic and professional success, preparing them for careers in research, education, and industry, with lasting impacts on their field.",
    "expanded_word_count": 96
  },
  {
    "id": 440,
    "course_codes": "APPPHYS 300 / MATSCI 230",
    "course_title": "Department Colloquium",
    "original_descr": "May be repeated for credit.",
    "original_word_count": 5,
    "expanded_descr": "In the Department Colloquium, students engage with faculty and peers to explore cutting-edge research and topics. This repeatable course offers a unique opportunity to delve into diverse subjects, fostering intellectual curiosity and interdisciplinary understanding. Through seminars, discussions, and presentations, students develop critical thinking, communication, and collaboration skills. By attending colloquiums, students broaden their knowledge, gain insights into various fields, and enhance their academic and professional growth, preparing them for a dynamic and ever-changing world, with the flexibility to repeat the course for continued exploration and credit, every semester, with new and exciting topics and speakers.",
    "expanded_word_count": 95
  },
  {
    "id": 460,
    "course_codes": "POLISCI 482",
    "course_title": "Designing Your Dissertation II",
    "original_descr": "Designing Your Dissertation IIFor Political Science PhD students only.",
    "original_word_count": 9,
    "expanded_descr": "Designing Your Dissertation II is an advanced course exclusively for Political Science PhD students. Building on foundational knowledge, students refine their research proposals and develop a comprehensive dissertation outline. Through interactive discussions, peer feedback, and expert guidance, students strengthen their methodological approaches and theoretical frameworks. By the end of the course, students will have a clear plan and timeline for completing their dissertation, ensuring a strong foundation for original research and academic success, and be well-prepared to defend their proposals and undertake rigorous scholarly inquiry in their field of study with confidence and expertise always.",
    "expanded_word_count": 95
  },
  {
    "id": 467,
    "course_codes": "ECON 315 / ECON 355 / ECON 370",
    "course_title": "Development Seminar",
    "original_descr": "Information and meeting times are available on the Department of Economics Website: https://economics.stanford.edu/seminars-events/list-seminars",
    "original_word_count": 13,
    "expanded_descr": "The Development Seminar explores cutting-edge research in economic development, featuring renowned experts and scholars. Through lectures and discussions, students engage with innovative ideas and empirical methods. Meeting times and information are available on the Department of Economics Website. Students gain insights into poverty reduction, inequality, and institutional reform, analyzing case studies and policy interventions. This seminar fosters critical thinking, collaboration, and intellectual growth, preparing students for careers in international development, research, and policy-making, with a deep understanding of economic development's complexities and challenges, and opportunities for networking and professional development, every week, at Stanford University.",
    "expanded_word_count": 95
  },
  {
    "id": 469,
    "course_codes": "PSYCH 211",
    "course_title": "Developmental Psychology",
    "original_descr": "Prerequisite: 207 or consent of instructor.",
    "original_word_count": 6,
    "expanded_descr": "In Developmental Psychology, students explore human growth and development across the lifespan. Prerequisite: course 207 or instructor consent. This engaging course delves into cognitive, social, and emotional development, examining theories and research methods. Students analyze developmental stages, from infancy to adulthood, and discuss real-world applications. Through lectures, discussions, and case studies, students gain a deeper understanding of human development, preparing them for careers in psychology, education, and related fields, with a comprehensive knowledge of developmental principles and practices, and their significance in everyday life, fostering a nuanced understanding of human development and its complexities always.",
    "expanded_word_count": 95
  },
  {
    "id": 471,
    "course_codes": "MUSIC 182",
    "course_title": "Diction for Singers",
    "original_descr": "The international phonetic alphabet and its application to German, French, and Italian vocal literature. Open also to pianists interested in vocal coaching and choral conducting.",
    "original_word_count": 25,
    "expanded_descr": "In Diction for Singers, students master the international phonetic alphabet, applying it to German, French, and Italian vocal literature. Through lectures, discussions, and practice, singers refine pronunciation and articulation. Pianists interested in vocal coaching and choral conducting are also welcome. Exploration of language nuances and cultural context enhances performance authenticity. By examining lyric diction and poetic analysis, students develop a deeper understanding of song interpretation, enabling them to deliver expressive and accurate performances, and fostering a strong foundation for successful vocal and choral careers, with improved communication and artistic expression, in a supportive learning environment always.",
    "expanded_word_count": 96
  },
  {
    "id": 484,
    "course_codes": "PHIL 301",
    "course_title": "Dissertation Development Proseminar",
    "original_descr": "A required seminar for third year philosophy PhD students designed to help them transition to writing a dissertation.",
    "original_word_count": 18,
    "expanded_descr": "In the Dissertation Development Proseminar, third-year philosophy PhD students transition to writing their dissertation. This required seminar provides guidance on developing a research proposal, outlining a dissertation structure, and creating a writing schedule. Students refine their research questions, engage with relevant literature, and receive feedback from peers and instructors. Through workshops and discussions, students develop essential skills for producing original research, managing their time, and overcoming writing challenges, setting them up for success in completing their dissertation and launching their academic careers as philosophers, equipped with the tools to produce high-quality, original research and scholarship effectively.",
    "expanded_word_count": 96
  },
  {
    "id": 487,
    "course_codes": "HRP 390 / MS&E 390",
    "course_title": "Doctoral Research Seminar in Health Systems Modeling",
    "original_descr": "Restricted to PhD students, or by consent of instructor. Doctoral research seminar covering current topics in health policy, health systems modeling, and health innovation. May be repeated for credit.",
    "original_word_count": 29,
    "expanded_descr": "In the Doctoral Research Seminar in Health Systems Modeling, PhD students explore current topics in health policy, modeling, and innovation. By consent of instructor, non-PhD students may participate. This seminar delves into complex health systems, analyzing models and strategies to improve healthcare outcomes. Students engage in discussions, critiques, and presentations, developing research skills and expertise. Repeated for credit, this course fosters academic growth, collaboration, and knowledge sharing among scholars, preparing them for careers in health systems research and leadership, with a deep understanding of health policy and systems modeling, and their applications in real-world settings effectively.",
    "expanded_word_count": 96
  },
  {
    "id": 506,
    "course_codes": "MUSIC 24A / MUSIC 24B / MUSIC 24C",
    "course_title": "Ear Training I",
    "original_descr": "Class is closed by design. Please contact instructor Erika Arul (mailto:earul@stanford.edu) for permission to enroll. Preference to Music majors and minors.",
    "original_word_count": 21,
    "expanded_descr": "In Ear Training I, students develop essential listening skills, recognizing melodies, intervals, and rhythms. Music majors and minors receive priority enrollment, but others may contact instructor Erika Arul for permission. Through interactive exercises and quizzes, students enhance their musical perception, improving pitch and rhythm accuracy. This foundational course prepares musicians for advanced studies, fostering a deeper understanding of music theory and appreciation. By refining their aural skills, students become more proficient musicians, composers, and music enthusiasts, with improved overall musicality and expression, under the guidance of experienced instructor Erika Arul, via earul@stanford.edu for enrollment permission always.",
    "expanded_word_count": 96
  },
  {
    "id": 546,
    "course_codes": "MUSIC 130C",
    "course_title": "Elementary Choral Conducting",
    "original_descr": "Techniques specific to the conducting of choral ensembles: warm-ups, breathing, balance, blend, choral tone, isolation principles, recitative conducting, preparation, and conducting of choral/orchestral works.",
    "original_word_count": 24,
    "expanded_descr": "In Elementary Choral Conducting, students master techniques for leading choral ensembles, including effective warm-ups, breathing exercises, and achieving balance and blend. They explore choral tone development, isolation principles, and recitative conducting methods. Through hands-on preparation and conducting of choral and orchestral works, students refine their skills and build confidence. With a focus on practical application, this course equips aspiring conductors with the essential tools and knowledge to successfully lead choirs and ensembles, fostering a deeper understanding of choral music and its performance, and preparing them for future musical endeavors and leadership roles in the field effectively.",
    "expanded_word_count": 96
  },
  {
    "id": 521,
    "course_codes": "ECON 325",
    "course_title": "Economic History Seminar",
    "original_descr": "May be repeated for credit. Information and meeting times are available on the Department of Economics Website: https://economics.stanford.edu/seminars-events/list-seminars",
    "original_word_count": 18,
    "expanded_descr": "In the Economic History Seminar, students delve into the evolution of economic systems and institutions. Repeated for credit, this course explores historical contexts shaping modern economies. Meeting times and details are found on the Department of Economics website. Through discussions and debates, students analyze key events and theories, gaining a deeper understanding of economic development and its global implications. Engaging with faculty and peers, students develop critical thinking and research skills, applying historical insights to contemporary economic issues and challenges, fostering a nuanced perspective on the complex interplay of economic forces and historical events over time always.",
    "expanded_word_count": 97
  },
  {
    "id": 590,
    "course_codes": "EPI 236",
    "course_title": "Epidemiology Research Seminar",
    "original_descr": "Weekly forum for ongoing epidemiologic research by faculty, staff, guests, and students, emphasizing research issues relevant to disease causation, prevention, and treatment. May be repeated for credit.",
    "original_word_count": 27,
    "expanded_descr": "In the Epidemiology Research Seminar, students engage with faculty, staff, and guests in a weekly forum discussing ongoing research in disease causation, prevention, and treatment. Exploring cutting-edge topics and methodologies, participants share knowledge and experiences, fostering a collaborative environment. Students develop critical thinking and presentation skills, while staying updated on emerging epidemiologic issues. Repeated enrollments allow for continued growth and exploration of new research areas, providing a unique opportunity for in-depth examination of epidemiology's role in public health, making it an ideal course for those pursuing careers in research, academia, or healthcare policy, with repeat credit options available.",
    "expanded_word_count": 98
  },
  {
    "id": 591,
    "course_codes": "ENERGY 352",
    "course_title": "ESE Graduate Seminar",
    "original_descr": "Current research topics. Presentations by guest speakers from Stanford and elsewhere. May be repeated for credit.",
    "original_word_count": 16,
    "expanded_descr": "The ESE Graduate Seminar explores current research topics through presentations by renowned guest speakers from Stanford and other institutions. Students engage with cutting-edge ideas, discussing innovative solutions and methodologies. Repeated for credit, this seminar fosters a community of scholars, promoting intellectual exchange and collaboration. Participants develop critical thinking, analysis, and communication skills, enhancing their research expertise and professional networks. By attending regular sessions, students stay updated on the latest developments in their field, broadening their knowledge and perspectives in a dynamic and interdisciplinary environment, preparing them for academic and professional success in their chosen field of study always.",
    "expanded_word_count": 98
  },
  {
    "id": 674,
    "course_codes": "GERLANG 1",
    "course_title": "First-Year German, First Quarter",
    "original_descr": "First-quarter of three-quarter First-Year Gerlang sequence. Emphasis is on developing beginning proficiency in interpersonal, interpretive, and presentational spheres.Prerequisite: no experience with German or Placement.",
    "original_word_count": 24,
    "expanded_descr": "In First-Year German, First Quarter, students embark on a comprehensive language journey, developing beginning proficiency in interpersonal, interpretive, and presentational skills. With no prior German experience required, learners engage in interactive lessons, exploring German culture and language fundamentals. Through immersive activities, students build vocabulary, grammar, and pronunciation skills, laying the foundation for further study. By quarter's end, learners will demonstrate basic communication skills, preparing them for continued language exploration in subsequent quarters, and fostering a deeper understanding of German language and culture, with a strong emphasis on practical application and real-world communication scenarios and interactions daily.",
    "expanded_word_count": 96
  },
  {
    "id": 597,
    "course_codes": "ETHICSOC 190 / PHIL 178",
    "course_title": "Ethics in Society Honors Seminar",
    "original_descr": "For Ethics in Society honors students. Methods of research. Students present issues of public and personal morality; topics chosen with advice of instructor.",
    "original_word_count": 23,
    "expanded_descr": "In the Ethics in Society Honors Seminar, students explore complex moral issues in public and personal spheres. With instructor guidance, they select and research topics, applying critical thinking and analytical skills. Through presentations and discussions, students engage with diverse perspectives, developing well-informed opinions and effective communication skills. This seminar fosters a deeper understanding of ethical principles and their applications, preparing students to navigate real-world moral dilemmas with confidence and nuance, and to become active contributors to societal discourse and positive change, cultivating a lifelong commitment to ethical inquiry and responsible decision-making in their personal and professional lives always.",
    "expanded_word_count": 98
  },
  {
    "id": 598,
    "course_codes": "ETHICSOC 195",
    "course_title": "Ethics in Society Workshop",
    "original_descr": "Workshop for Ethics in Society seniors completing their honors thesis.",
    "original_word_count": 10,
    "expanded_descr": "In the Ethics in Society Workshop, seniors completing their honors thesis engage in intensive discussion and analysis of ethical issues. Through case studies and peer review, students refine their research and writing skills, exploring complex societal problems. Guided by faculty, participants develop a deeper understanding of ethical theories and their applications, preparing them to present their theses and contribute to meaningful conversations about social responsibility. This collaborative environment fosters critical thinking, effective communication, and intellectual growth, culminating in a polished thesis and enhanced expertise in ethics and social impact, with faculty guidance and support throughout.",
    "expanded_word_count": 95
  },
  {
    "id": 675,
    "course_codes": "GERLANG 2",
    "course_title": "First-Year German, Second Quarter",
    "original_descr": "Continuation of GERLANG1. Further development of socially and culturally appropriate proficiency in interpersonal, interpretive, and presentational spheres.Prerequisite: Placement, GERLANG1.",
    "original_word_count": 19,
    "expanded_descr": "In First-Year German, Second Quarter, students build on foundational skills, refining proficiency in interpersonal, interpretive, and presentational communication. Through interactive lessons and cultural immersion, learners develop vocabulary, grammar, and pronunciation. Engaging activities and authentic materials foster language mastery, preparing students for real-world interactions. Prerequisite: GERLANG1 or placement. By quarter's end, students will demonstrate improved comprehension, expression, and cultural understanding, laying the groundwork for continued language study and exploration of German-speaking cultures, with enhanced ability to navigate everyday situations and conversations with confidence and accuracy, and a deeper appreciation for the language.",
    "expanded_word_count": 91
  },
  {
    "id": 677,
    "course_codes": "HEBRLANG 2 / JEWISHST 101B",
    "course_title": "First-Year Hebrew, Second Quarter",
    "original_descr": "Continuation of HEBRLANG 2. Prerequisite: Placement Test, HEBRLANG 2.",
    "original_word_count": 9,
    "expanded_descr": "In First-Year Hebrew, Second Quarter, students build on foundational knowledge gained in HEBRLANG 2. Prerequisites include a placement test and completion of HEBRLANG 2. This course delves deeper into Hebrew grammar, vocabulary, and reading comprehension. Students engage with authentic texts, practice conversational skills, and explore Israeli culture. Through interactive lessons and activities, learners refine their language proficiency, preparing for more advanced studies. By the end, students demonstrate improved understanding and application of Hebrew language skills, setting the stage for continued growth and exploration of the Hebrew language and its rich cultural heritage and traditions effectively.",
    "expanded_word_count": 95
  },
  {
    "id": 617,
    "course_codes": "ECON 335",
    "course_title": "Experimental/Behavioral Seminar",
    "original_descr": "Field seminar in experimental and behavioral economics.",
    "original_word_count": 7,
    "expanded_descr": "In the Experimental/Behavioral Seminar, students engage in a field seminar exploring experimental and behavioral economics. Through hands-on experiments and discussions, participants delve into human decision-making and market behavior. Key concepts, such as game theory and social preferences, are examined. Students design and conduct experiments, analyzing data and presenting findings. This interactive course fosters critical thinking, collaboration, and research skills, providing a comprehensive understanding of experimental and behavioral economics principles and their real-world applications, preparing students for careers in research, policy, and industry, with a deeper understanding of economic decision-making and behavior, and its practical implications always.",
    "expanded_word_count": 96
  },
  {
    "id": 622,
    "course_codes": "CHEM 91",
    "course_title": "Exploring Chemical Research at Stanford",
    "original_descr": "Preference to freshmen and sophomores. Department faculty describe their cutting-edge research and its applications.",
    "original_word_count": 14,
    "expanded_descr": "Exploring Chemical Research at Stanford introduces freshmen and sophomores to cutting-edge research in chemistry. Faculty members share their innovative projects, highlighting applications and real-world implications. Students gain insight into various research areas, from materials science to biochemistry. Through interactive discussions and presentations, participants explore the latest discoveries and advancements, fostering a deeper understanding of chemical research and its potential impact. This course sparks curiosity and inspires future scientists, providing a unique opportunity to engage with Stanford's renowned chemistry department and its distinguished faculty, all while exploring the frontiers of chemical research and its exciting possibilities always.",
    "expanded_word_count": 96
  },
  {
    "id": 641,
    "course_codes": "FEMGEN 199B",
    "course_title": "Feminist, Gender, and Sexuality Studies Honors Workshop",
    "original_descr": "Required of seniors in the Feminist, Gender, and Sexuality Studies honors program. Particippants share ongoing work on their honors theses. Prerequisite: consent of instructor.",
    "original_word_count": 24,
    "expanded_descr": "In the Feminist, Gender, and Sexuality Studies Honors Workshop, seniors share and refine their honors theses under faculty guidance. Participants engage in peer review, constructive feedback, and lively discussions, deepening their understanding of feminist theories and methodologies. With instructor consent, students hone their research and writing skills, preparing for a successful thesis defense. This collaborative workshop fosters a supportive community, promoting academic excellence and intellectual growth, as students finalize their original research contributions to the field of feminist, gender, and sexuality studies, culminating in a polished and rigorous honors thesis, with faculty mentorship and guidance throughout.",
    "expanded_word_count": 96
  },
  {
    "id": 645,
    "course_codes": "ENGLISH 90",
    "course_title": "Fiction Writing",
    "original_descr": "The elements of fiction writing: narration, description, and dialogue. Students write complete stories and participate in story workshops.",
    "original_word_count": 18,
    "expanded_descr": "In Fiction Writing, students explore the core elements of narration, description, and dialogue. Through interactive lectures and writing exercises, they develop essential skills to craft compelling stories. Participants write complete short stories and engage in constructive workshops, receiving feedback from peers and instructors. This hands-on approach fosters creativity, critical thinking, and effective storytelling techniques. By the end of the course, students will have a portfolio of polished stories and a deeper understanding of the fiction writing process, empowering them to continue writing with confidence and skill, and preparing them for future writing endeavors and creative pursuits always.",
    "expanded_word_count": 97
  },
  {
    "id": 660,
    "course_codes": "PUNJLANG 2",
    "course_title": "First Year  Punjabi, Second Quarter",
    "original_descr": "Continuation of PUNJLANG 1.",
    "original_word_count": 4,
    "expanded_descr": "In First Year Punjabi, Second Quarter, students continue their journey in Punjabi language and culture. Building on foundational skills, they'll delve deeper into grammar, vocabulary, and pronunciation. Engaging activities and authentic materials will enhance reading, writing, and conversation skills. Students will explore Punjabi literature, history, and traditions, broadening their understanding of the language and its context. Interactive classes and immersive experiences will foster confidence and fluency, preparing students for further study and real-world applications of Punjabi language and cultural competence, with a focus on practical communication and cultural insight, in a supportive and inclusive learning environment always.",
    "expanded_word_count": 97
  },
  {
    "id": 665,
    "course_codes": "TIGRYLNG 2",
    "course_title": "First Year Tigrinya, Second Quarter",
    "original_descr": "Continuation of Tigrinya 1. Prerequisite Tigrinya 1.",
    "original_word_count": 7,
    "expanded_descr": "In First Year Tigrinya, Second Quarter, students build on foundational knowledge acquired in Tigrinya 1. This course delves deeper into the Tigrinya language, exploring complex grammar, vocabulary, and cultural nuances. Through interactive lessons and immersive activities, students enhance reading, writing, and conversational skills. Prerequisite Tigrinya 1 ensures a solid foundation for continued language development. Engaging discussions, authentic materials, and regular feedback foster a supportive learning environment, preparing students for advanced Tigrinya studies and real-world applications, promoting cultural understanding and linguistic proficiency in this vital East African language, with emphasis on practical communication and cultural competence development always.",
    "expanded_word_count": 97
  },
  {
    "id": 666,
    "course_codes": "AMHRLANG 2",
    "course_title": "First-Year Amharic, Second Quarter",
    "original_descr": "Continuation of Amhrlang1. Prerequisite Amhrlang1 or a placement test",
    "original_word_count": 9,
    "expanded_descr": "In First-Year Amharic, Second Quarter, students build upon foundational skills acquired in Amhrlang1. Prerequisite Amhrlang1 or a placement test is required. This course delves deeper into Amharic language and culture, enhancing vocabulary, grammar, and conversation skills. Engaging activities and authentic materials foster immersive learning. Students explore complex sentence structures, idiomatic expressions, and cultural nuances. By the end of the quarter, students will demonstrate improved proficiency in reading, writing, and speaking Amharic, preparing them for further study and real-world applications in academia, research, or professional settings, with a deeper understanding of Ethiopian culture and society's intricacies always.",
    "expanded_word_count": 96
  },
  {
    "id": 667,
    "course_codes": "ARABLANG 2",
    "course_title": "First-Year Arabic, Second Quarter",
    "original_descr": "Continuation of ARABLANG1. One-year sequence designed to develop beginning proficiency, with additional emphasis on reading and writing standard Arabic. Prerequisite: Placement Test, ARABLANG 1.",
    "original_word_count": 24,
    "expanded_descr": "In First-Year Arabic, Second Quarter, students build upon foundational skills, enhancing proficiency in reading, writing, and speaking standard Arabic. Emphasis is placed on developing vocabulary, grammar, and comprehension. Through interactive lessons and immersive activities, students explore Arabic culture and engage with authentic texts. Prerequisite: ARABLANG 1 or placement test. This course is the second installment of a year-long sequence, culminating in beginner proficiency. Students will refine language skills, fostering a deeper understanding of the Arabic language and its rich cultural context, preparing them for advanced studies and real-world applications with confidence and accuracy always.",
    "expanded_word_count": 94
  },
  {
    "id": 668,
    "course_codes": "ARMELANG 2",
    "course_title": "First-Year Armenian, Second Quarter",
    "original_descr": "First-Year Armenian, Second Quarter. Course emphasizes developing basic level communication skills using daily life topics. Grammatical structures and vocabulary are introduced through interpersonal, interpretive and presentational modes of communication.",
    "original_word_count": 29,
    "expanded_descr": "In First-Year Armenian, Second Quarter, students develop foundational communication skills through daily life topics. Grammatical structures and vocabulary are introduced via interpersonal, interpretive, and presentational modes. Interactive lessons foster conversational proficiency, reading comprehension, and writing skills. Students engage in discussions, role-plays, and authentic materials to enhance language proficiency. Cultural insights and nuances are explored, preparing students for real-life interactions. By quarter's end, students will demonstrate improved comprehension, vocabulary, and communication skills, laying a solid foundation for continued Armenian language study and cultural exploration, with a deeper understanding of the language and its applications. New skills emerge.",
    "expanded_word_count": 96
  },
  {
    "id": 697,
    "course_codes": "SNSKTLNG 2",
    "course_title": "First-Year Sanskrit, Second Quarter",
    "original_descr": "Continuation of SNSKTLNG 1. Prerequisite: SNSKTLNG 1.",
    "original_word_count": 7,
    "expanded_descr": "In First-Year Sanskrit, Second Quarter, students build on foundational knowledge from SNSKTLNG 1, delving deeper into the language's grammar, syntax, and vocabulary. Through interactive lectures and exercises, students enhance their reading, writing, and comprehension skills. They explore Sanskrit's rich literary and cultural heritage, analyzing ancient texts and developing a nuanced understanding of the language's historical context. Prerequisite: SNSKTLNG 1. By the quarter's end, students will demonstrate improved proficiency and confidence in using Sanskrit, preparing them for advanced studies and a lifelong appreciation of this ancient, revered language and its many contributions to human knowledge and culture always.",
    "expanded_word_count": 97
  },
  {
    "id": 679,
    "course_codes": "IGBOLANG 2",
    "course_title": "First-Year Igbo, Second Quarter",
    "original_descr": "Continuation of IGBOLANG 1. Prerequisite: IGBOLANG 1.",
    "original_word_count": 7,
    "expanded_descr": "In First-Year Igbo, Second Quarter, students build on foundational knowledge from IGBOLANG 1, refining language skills in Igbo. Through interactive lessons and immersive activities, learners develop vocabulary, grammar, and pronunciation. Engaging with authentic texts and conversations, students explore Igbo culture and traditions. Prerequisite IGBOLANG 1 ensures a solid foundation for continued language growth. By quarter's end, students demonstrate improved proficiency in reading, writing, and speaking Igbo, preparing them for further study and cultural exchange. This course fosters a deeper understanding of Igbo language and culture, enriching students' academic and personal experiences with African languages. Regular practice.",
    "expanded_word_count": 96
  },
  {
    "id": 683,
    "course_codes": "JAPANLNG 1",
    "course_title": "First-Year Japanese Language, Culture, and Communication, First Quarter",
    "original_descr": "First-year sequence enables students to converse, write, and read essays on topics such as personal history, experiences, familiar people. 72 kanji characters will be taught.",
    "original_word_count": 25,
    "expanded_descr": "In First-Year Japanese Language, Culture, and Communication, students develop foundational skills to converse, write, and read Japanese essays on personal history, experiences, and familiar people. This first quarter introduces 72 essential kanji characters, building a strong linguistic base. Through interactive lessons and cultural immersion, students explore Japanese customs and traditions, enhancing their understanding of the language and its context. By the end of the course, students will be able to engage in basic conversations, read and write simple texts, and appreciate the nuances of Japanese communication, preparing them for further language study and cultural exploration effectively always.",
    "expanded_word_count": 97
  },
  {
    "id": 689,
    "course_codes": "CHINLANG 1",
    "course_title": "First-Year Modern Chinese, First Quarter",
    "original_descr": "Conversation, grammar, reading, elementary composition. Daily sections may be set at the beginning of the quarter to suit schedule requirements.",
    "original_word_count": 20,
    "expanded_descr": "In First-Year Modern Chinese, First Quarter, students develop foundational language skills through conversation, grammar, reading, and elementary composition. Daily sections, scheduled at the quarter's start, cater to individual needs. Engaging activities and interactive lessons foster a supportive learning environment. Students acquire basic vocabulary, sentence structures, and pronunciation, enabling them to communicate effectively in everyday situations. By quarter's end, learners can expect to comprehend and express themselves in simple Chinese, laying the groundwork for further language study and cultural exploration, with a strong emphasis on pronunciation, character recognition, and basic conversation skills, all in a dynamic setting.",
    "expanded_word_count": 96
  },
  {
    "id": 690,
    "course_codes": "CHINLANG 2",
    "course_title": "First-Year Modern Chinese, Second Quarter",
    "original_descr": "Continuation of CHINLANG 1. Daily sections may be set at the beginning of the quarter to suit schedule requirements.Prerequisite: placement test, CHINLANG 1.",
    "original_word_count": 23,
    "expanded_descr": "In First-Year Modern Chinese, Second Quarter, students build upon foundational skills acquired in CHINLANG 1. Through interactive daily sections, tailored to accommodate diverse schedules, learners refine pronunciation, grammar, and vocabulary. Prerequisites include a placement test or completion of CHINLANG 1. This course delves deeper into Chinese characters, reading, and writing, enhancing overall language proficiency. Engaging activities and cultural immersion foster a comprehensive understanding of the language, preparing students for continued study and real-world application of Modern Chinese, with a focus on developing effective communication skills in a supportive and dynamic learning environment, promoting academic success.",
    "expanded_word_count": 95
  },
  {
    "id": 691,
    "course_codes": "CHINLANG 3",
    "course_title": "First-Year Modern Chinese, Third Quarter",
    "original_descr": "Continuation of CHINLANG 2. Daily sections may be set at the beginning of the quarter to suit schedule requirements. Fulfills the University language requirement. Prerequisite: Placement Test, CHINLANG 2.",
    "original_word_count": 29,
    "expanded_descr": "In First-Year Modern Chinese, Third Quarter, students build on CHINLANG 2, refining language skills through interactive daily sections. The course fulfills the University language requirement, with placement determined by test or completion of CHINLANG 2. Students develop reading, writing, and conversation abilities, exploring Chinese culture and vocabulary. Engaging activities and discussions enhance language proficiency, preparing students for further study or real-world applications. Flexible scheduling accommodates student needs, ensuring a supportive learning environment. By quarter's end, students demonstrate significant progress in modern Chinese language competence, ready to advance to higher-level courses or apply their skills practically always.",
    "expanded_word_count": 96
  },
  {
    "id": 704,
    "course_codes": "SWAHLANG 3",
    "course_title": "First-Year Swahili, Third Quarter",
    "original_descr": "Continuation of SWAHLANG 2. Prerequisite: SWAHLANG 2. Fulfills the University foreign language requirement.",
    "original_word_count": 13,
    "expanded_descr": "In First-Year Swahili, Third Quarter, students build on foundational knowledge from SWAHLANG 2, refining language skills in reading, writing, and conversation. Prerequisite SWAHLANG 2 ensures a solid base for advanced grammar and vocabulary exploration. This course fulfills the University's foreign language requirement, enhancing cultural understanding and competency. Through interactive lessons, discussions, and immersive activities, students engage with authentic texts, videos, and conversations, deepening their connection to Swahili language and culture, and preparing for real-world communication and further study, with improved fluency and confidence in using the language effectively in various contexts and situations every day.",
    "expanded_word_count": 95
  },
  {
    "id": 705,
    "course_codes": "TWILANG 2",
    "course_title": "First-Year Twi, Second Quarter",
    "original_descr": "Continuation of TWILANG 1. Prerequisite: TWILANG 1.",
    "original_word_count": 7,
    "expanded_descr": "In First-Year Twi, Second Quarter, students build on foundational skills acquired in TWILANG 1, delving deeper into the Twi language. Prerequisite TWILANG 1 ensures a solid basis for further exploration. This course enhances vocabulary, grammar, and pronunciation, introducing more complex sentence structures and conversational scenarios. Engaging activities and interactive exercises promote language proficiency, cultural understanding, and communication skills. Students will immerse themselves in authentic materials, fostering a nuanced appreciation of the language and its role in Ghanaian culture, preparing them for advanced studies and real-world applications with confidence and fluency, and broadened perspectives always.",
    "expanded_word_count": 94
  },
  {
    "id": 707,
    "course_codes": "URDULANG 2",
    "course_title": "First-Year Urdu, Second Quarter",
    "original_descr": "Grammatical structures, vocabulary, and sentence patterns through speaking, reading, writing, and listening. Urdu culture.",
    "original_word_count": 14,
    "expanded_descr": "In First-Year Urdu, Second Quarter, students develop foundational language skills through interactive speaking, reading, writing, and listening exercises. Emphasis is placed on grammatical structures, vocabulary expansion, and sentence patterns. Exploration of Urdu culture enriches language learning, providing context and insight. Students engage with authentic materials, conversations, and cultural practices, fostering proficiency and appreciation for the language and its heritage. By the end of the quarter, students demonstrate improved communication skills and a deeper understanding of Urdu language and culture, preparing them for further study and real-world application of their language abilities effectively every day.",
    "expanded_word_count": 94
  },
  {
    "id": 709,
    "course_codes": "YDDSHLNG 2",
    "course_title": "First-Year Yiddish, Second Quarter",
    "original_descr": "Continuation of YDDSHLNG 1. Prerequisite: YDDSHLNG 1.",
    "original_word_count": 7,
    "expanded_descr": "In First-Year Yiddish, Second Quarter, students build upon foundational knowledge gained in YDDSHLNG 1. This course delves deeper into Yiddish language and culture, exploring grammar, vocabulary, and pronunciation. Through interactive lessons and immersive activities, students enhance reading, writing, and conversation skills. Prerequisite YDDSHLNG 1 ensures a solid foundation. Engaging with Yiddish texts, songs, and discussions, students develop a richer understanding of the language and its heritage, preparing them for continued study and cultural exploration, with a focus on practical application and authentic communication, fostering a lifelong connection to the Yiddish language and community always.",
    "expanded_word_count": 94
  },
  {
    "id": 757,
    "course_codes": "EE 293B / ENERGY 201B",
    "course_title": "Fundamentals of Energy Processes",
    "original_descr": "For seniors and graduate students. Covers scientific and engineering fundamentals of renewable energy processes involving heat. Thermodynamics, heat engines, solar thermal, geothermal, biomass.",
    "original_word_count": 23,
    "expanded_descr": "In Fundamentals of Energy Processes, seniors and graduate students explore the scientific and engineering principles of renewable energy involving heat. Topics include thermodynamics, heat engines, and various renewable energy sources such as solar thermal, geothermal, and biomass. Students analyze energy conversion systems, efficiency, and sustainability. Through lectures, discussions, and case studies, students gain a comprehensive understanding of energy processes and develop skills to design and evaluate renewable energy systems, preparing them for careers in energy engineering and sustainability, with a focus on innovative solutions for a low-carbon future and real-world energy challenges and applications every day.",
    "expanded_word_count": 96
  },
  {
    "id": 765,
    "course_codes": "ESOLLANG 697",
    "course_title": "Gateway to Graduate Writing",
    "original_descr": "Focus is on improving grammatical accuracy and vocabulary, building fluency, and learning the structure and conventions of English correspondence, reports, and short academic papers. Enrollment limited to 14.",
    "original_word_count": 28,
    "expanded_descr": "In Gateway to Graduate Writing, students enhance grammatical accuracy, vocabulary, and fluency while mastering English correspondence, reports, and short academic papers. Limited to 14 students, this interactive course provides personalized feedback and guidance. Through engaging exercises and assignments, students learn to structure and organize their writing, citing sources effectively. By the end, students will be proficient in composing clear, concise, and well-supported academic texts, preparing them for graduate-level writing demands and success in their academic pursuits with confidence and improved writing skills, essential for achieving academic excellence. Enrollment is limited to ensure individualized attention.",
    "expanded_word_count": 94
  },
  {
    "id": 769,
    "course_codes": "EALC 110 / EALC 210",
    "course_title": "Gender and Sexuality in East Asia",
    "original_descr": "The class will consider representations of gender and sexuality from early modern and modern China, Korea, and Japan.",
    "original_word_count": 18,
    "expanded_descr": "In \"Gender and Sexuality in East Asia,\" students explore historical and contemporary representations of gender and sexuality in China, Korea, and Japan. Through literature, film, and art, we analyze cultural constructions of identity, power dynamics, and social norms. From early modern to modern periods, we examine how gender and sexuality intersect with politics, religion, and social change. By considering diverse perspectives and experiences, students gain a nuanced understanding of East Asian cultures and the complexities of human identity, fostering empathy and critical thinking in a global context, and encouraging informed discussions and reflections on these vital topics.",
    "expanded_word_count": 97
  },
  {
    "id": 774,
    "course_codes": "PSYCH 243",
    "course_title": "General Development Seminar",
    "original_descr": "May be repeated for credit. Prerequisite: consent of instructors. Restricted to Developmental graduate students.",
    "original_word_count": 14,
    "expanded_descr": "In the General Development Seminar, graduate students explore cutting-edge topics in developmental research. With instructor consent, students may repeat the course for credit, delving deeper into specialized areas. Restricted to Developmental graduate students, this seminar fosters a collaborative environment for discussion and debate. Through presentations and interactive sessions, students engage with faculty and peers, enhancing their knowledge and critical thinking skills. This dynamic course provides a unique opportunity for students to refine their research interests and develop expertise in developmental studies, preparing them for advanced academic and professional pursuits in the field, with tailored support and guidance always available.",
    "expanded_word_count": 99
  },
  {
    "id": 776,
    "course_codes": "GENE 282A",
    "course_title": "Genetic Counseling Research Seminar",
    "original_descr": "For genetic counseling students only. Lectures and facilitated discussions on research methodology for genetic counseling departmental research projects.",
    "original_word_count": 18,
    "expanded_descr": "In the Genetic Counseling Research Seminar, students explore research methodology and design for departmental projects. Through lectures and facilitated discussions, students develop critical thinking skills and learn to evaluate research studies. They examine ethical considerations, data analysis, and dissemination of results. Students participate in peer review and presentation of research proposals, fostering collaboration and communication skills. This seminar prepares genetic counseling students to contribute to and lead research initiatives, advancing the field and improving patient outcomes, with a focus on practical application and professional development in a supportive and interactive learning environment, tailored to their specialization and interests always.",
    "expanded_word_count": 99
  },
  {
    "id": 814,
    "course_codes": "ENGLISH 390 / ENGLISH 392",
    "course_title": "Graduate Fiction Workshop",
    "original_descr": "Open to Stegner Fellows in the Creative Writing Program only. May be repeated for credit.",
    "original_word_count": 15,
    "expanded_descr": "In the Graduate Fiction Workshop, Stegner Fellows refine their craft through intense peer review and mentorship. This repeatable course fosters a supportive community, allowing writers to experiment and hone their unique voices. Fellows share and discuss their original work, receiving constructive feedback from colleagues and instructors. Through rigorous critique and revision, students develop their narrative skills, exploring character, plot, and style. This workshop provides a nurturing environment for emerging writers to grow, take risks, and produce exceptional fiction, preparing them for publication and a career in creative writing, with a focus on literary excellence and artistic growth always.",
    "expanded_word_count": 98
  },
  {
    "id": 816,
    "course_codes": "SOC 305",
    "course_title": "Graduate Proseminar",
    "original_descr": "For first-year Sociology doctoral students only, Introduction and orientation to the field of Sociology. May be repeat for credit",
    "original_word_count": 19,
    "expanded_descr": "The Graduate Proseminar is an introductory and orientation course exclusively for first-year Sociology doctoral students. This foundational seminar provides an in-depth exploration of the field of Sociology, covering key theories, concepts, and methodologies. Students will engage with faculty and peers to develop a deeper understanding of the discipline. Repeatable for credit, this course offers a unique opportunity for ongoing academic growth and refinement. Through discussions, readings, and activities, students will establish a strong foundation for their doctoral studies and cultivate essential skills for success in the field of Sociology, preparing them for advanced research and scholarship endeavors always.",
    "expanded_word_count": 98
  },
  {
    "id": 818,
    "course_codes": "HISTORY 486A",
    "course_title": "Graduate Research Seminar in Jewish History",
    "original_descr": "Graduate Research Seminar in Jewish History",
    "original_word_count": 6,
    "expanded_descr": "In the Graduate Research Seminar in Jewish History, students engage in advanced research and analysis of Jewish historical events and themes. Through in-depth discussions and critiques, participants develop expertise in historical methodologies and trends. Exploring primary sources and scholarly debates, students refine their research skills and produce original work. This seminar fosters a community of emerging scholars, providing a supportive environment for exploring complex topics and refining research agendas, ultimately preparing students for careers in academia, research, or related fields, with a deeper understanding of Jewish history and its significance in modern society and culture always.",
    "expanded_word_count": 96
  },
  {
    "id": 819,
    "course_codes": "HISTORY 481 / JEWISHST 481",
    "course_title": "Graduate Research Seminar in Ottoman and Middle East History",
    "original_descr": "Student-selected research topics. May be repeated for credit",
    "original_word_count": 8,
    "expanded_descr": "In the Graduate Research Seminar in Ottoman and Middle East History, students explore student-selected research topics in-depth. Under faculty guidance, students develop and refine their research skills, analyzing primary sources and historiography. This seminar may be repeated for credit, allowing students to delve into new topics or further investigate previous research interests. Through presentations and discussions, students engage with peers and refine their arguments, culminating in a comprehensive research paper that showcases their expertise in Ottoman and Middle East history, preparing them for advanced academic or professional pursuits in the field with enhanced research capabilities.",
    "expanded_word_count": 95
  },
  {
    "id": 820,
    "course_codes": "HISTORY 468A",
    "course_title": "Graduate Research Seminar in U.S. History",
    "original_descr": "Graduate research seminar in U.S. history, Part I.",
    "original_word_count": 8,
    "expanded_descr": "In the Graduate Research Seminar in U.S. History, Part I, students delve into advanced historical research methods and techniques. Through in-depth analysis of primary sources and scholarly debates, participants develop critical thinking and writing skills. The seminar covers key themes and periods in U.S. history, fostering a deeper understanding of historical context and interpretation. Students produce original research papers, receiving feedback from peers and instructors. This rigorous course prepares graduate students for comprehensive exams and dissertation research, laying the foundation for a successful academic career in U.S. history, with expert guidance and support throughout the semester always.",
    "expanded_word_count": 97
  },
  {
    "id": 821,
    "course_codes": "PSYCH 269",
    "course_title": "Graduate Seminar in Affective Science",
    "original_descr": "May be repeated for credit. Prerequisite: graduate standing in Psychology.",
    "original_word_count": 10,
    "expanded_descr": "In the Graduate Seminar in Affective Science, students explore the complex realm of emotions and their underlying mechanisms. With graduate standing in Psychology, participants delve into theoretical frameworks, empirical findings, and methodological approaches. Through discussions, presentations, and critiques, students engage with cutting-edge research and debates. Repeating the course allows for in-depth examination of specialized topics, fostering expertise in affective science. By investigating the intricacies of emotional experience, students gain a deeper understanding of human behavior, preparing them for innovative research and applications in psychology and related fields, with a focus on advancing knowledge and professional development skills.",
    "expanded_word_count": 97
  },
  {
    "id": 822,
    "course_codes": "COMM 308 / POLISCI 321 / PSYCH 284",
    "course_title": "Graduate Seminar in Political Psychology",
    "original_descr": "For students interested in research in political science, psychology, or communication. Methodological techniques for studying political attitudes and behaviors. May be repeated for credit.",
    "original_word_count": 24,
    "expanded_descr": "In the Graduate Seminar in Political Psychology, students explore the intersection of politics, psychology, and communication. This interdisciplinary course delves into methodological techniques for analyzing political attitudes and behaviors, fostering research skills and critical thinking. Through discussions, case studies, and research projects, students examine the psychological factors influencing political decision-making and behavior. Repeatable for credit, this seminar offers a unique opportunity for in-depth exploration and specialization, preparing students for advanced research and academic pursuits in political science, psychology, and related fields, with a focus on empirical analysis and theoretical applications in a dynamic and interactive learning environment always.",
    "expanded_word_count": 98
  },
  {
    "id": 824,
    "course_codes": "GERMAN 397",
    "course_title": "Graduate Studies Colloquium",
    "original_descr": "Colloquium for graduate students in German Studies. Taught in English. May be repeated for credit.",
    "original_word_count": 15,
    "expanded_descr": "The Graduate Studies Colloquium is a dynamic forum for graduate students in German Studies, conducted in English. This repeatable course fosters intellectual exchange, critical thinking, and scholarly growth. Students engage with faculty and peers, exploring diverse topics and methodologies in German Studies. Through presentations, discussions, and workshops, participants refine research skills, develop academic writing, and prepare for professional careers. By repeating the course, students can deepen their expertise, expand their networks, and enhance their academic portfolios, ultimately enriching their graduate experience and future prospects in German Studies and related fields, with flexibility and academic rigor.",
    "expanded_word_count": 95
  },
  {
    "id": 825,
    "course_codes": "COMPLIT 397",
    "course_title": "Graduate Studies Colloquium",
    "original_descr": "Colloquium for graduate students in Comparative Literature. Taught in English. May be repeated for credit.",
    "original_word_count": 15,
    "expanded_descr": "The Graduate Studies Colloquium is a dynamic forum for Comparative Literature graduate students, taught in English. Students engage in discussions, debates, and presentations, exploring theoretical and methodological approaches. Repeating the course allows for in-depth examination of diverse topics and themes. Through active participation, students refine critical thinking, research, and communication skills, fostering a supportive academic community. This colloquium provides a unique opportunity for interdisciplinary exchange, intellectual growth, and professional development, preparing students for advanced research and scholarly pursuits in Comparative Literature, with the flexibility to repeat for continued exploration and credit. New perspectives emerge regularly.",
    "expanded_word_count": 95
  },
  {
    "id": 1953,
    "course_codes": "LINGUIST 197A",
    "course_title": "Undergraduate Research Seminar",
    "original_descr": "Senior capstone seminar. Joint readings in an annually varying topic, exploring the implications and importance of linguistic research for other domains of knowledge or practice.",
    "original_word_count": 25,
    "expanded_descr": "In the Undergraduate Research Seminar, seniors engage in a capstone experience exploring annually varying topics. Through joint readings and discussions, students examine the implications and importance of linguistic research for other domains, such as education, psychology, and sociology. This seminar fosters critical thinking, analysis, and research skills, allowing students to apply theoretical knowledge to real-world problems. Students develop a deeper understanding of linguistic research and its applications, preparing them for future academic or professional pursuits, and culminating in a comprehensive research project that showcases their skills and expertise in a specific area of linguistic study and research.",
    "expanded_word_count": 97
  },
  {
    "id": 863,
    "course_codes": "DANCE 59",
    "course_title": "Hip-Hop II",
    "original_descr": "Steps and styling in one of America's 21st-century vernacular dance forms. May be repeated for credit.",
    "original_word_count": 16,
    "expanded_descr": "In Hip-Hop II, students delve into advanced steps and styling of America's vibrant 21st-century vernacular dance form. Building on foundational skills, participants refine their technique, exploring intricate footwork, rhythmic nuances, and expressive performance quality. Through repetition and mastery, students develop a deeper understanding of hip-hop's cultural context and historical significance. With opportunities for improvisation and choreography, students can repeat the course for credit, further honing their skills and artistry in this dynamic and ever-evolving dance style, fostering creativity and self-expression in a supportive and engaging learning environment with expert instruction and feedback always available.",
    "expanded_word_count": 94
  },
  {
    "id": 866,
    "course_codes": "HISTORY 8N",
    "course_title": "History Goes Pop! Songwriting the Past",
    "original_descr": "Course description coming soon.",
    "original_word_count": 4,
    "expanded_descr": "In History Goes Pop! Songwriting the Past, students explore historical events through creative songwriting. By analyzing iconic songs, they'll learn to craft lyrics that capture the essence of past eras. Through workshops and collaborations, students will develop skills in storytelling, research, and melody creation. Guided by industry professionals, they'll produce original songs that bring history to life. This innovative course combines music, history, and creativity, offering a unique perspective on the past and fostering artistic expression, critical thinking, and historical understanding, resulting in a engaging and memorable learning experience for all participants every semester always.",
    "expanded_word_count": 95
  },
  {
    "id": 878,
    "course_codes": "AFRICAAM 200Y",
    "course_title": "Honors Thesis and Senior Thesis Research",
    "original_descr": "Winter. Required for students writing an Honors Thesis. Optional for Students writing a Senior Thesis.",
    "original_word_count": 15,
    "expanded_descr": "In Honors Thesis and Senior Thesis Research, students undertake in-depth research and writing under faculty guidance. Required for Honors Thesis writers and optional for Senior Thesis writers, this winter course fosters academic excellence and independence. Students refine research skills, develop a thesis proposal, and produce a polished manuscript. Through regular meetings and feedback, students hone critical thinking, analysis, and writing abilities, culminating in a comprehensive and original thesis that showcases their expertise and prepares them for post-graduate pursuits, with faculty support and mentorship every step of the way, ensuring a successful and enriching experience always.",
    "expanded_word_count": 95
  },
  {
    "id": 900,
    "course_codes": "CS 547",
    "course_title": "Human-Computer Interaction Seminar",
    "original_descr": "Weekly speakers on human-computer interaction topics. May be repeated for credit.",
    "original_word_count": 11,
    "expanded_descr": "In the Human-Computer Interaction Seminar, renowned weekly speakers share insights on human-computer interaction topics. Students engage with experts, exploring design, usability, and technology. Discussions cover user experience, interface design, and emerging trends. Through lectures and interactions, students gain a deeper understanding of human-computer interaction principles and applications. This seminar may be repeated for credit, allowing students to broaden their knowledge and stay updated on industry developments, fostering a community of scholars and practitioners in this dynamic field, with opportunities for networking and collaboration, and hands-on experience with cutting-edge technologies and innovative designs and methods always.",
    "expanded_word_count": 95
  },
  {
    "id": 913,
    "course_codes": "ITALIC 99SI",
    "course_title": "Immersion in the Arts",
    "original_descr": "Student-led courses in the arts. Topics change quarterly. Open to ALL students but current ITALIC students and alumni will be given priority.",
    "original_word_count": 22,
    "expanded_descr": "In Immersion in the Arts, student-led courses delve into various artistic disciplines, with topics changing quarterly. This dynamic program fosters creative exploration and innovation, open to all students. Current ITALIC students and alumni receive priority enrollment. Through hands-on experiences and collaborative projects, students will develop artistic skills, critical thinking, and self-expression. With a focus on experimentation and risk-taking, participants will immerse themselves in the artistic process, discovering new passions and talents, and contributing to a vibrant community of artists and creatives, guided by their peers and mentors in a supportive and stimulating environment, quarterly.",
    "expanded_word_count": 94
  },
  {
    "id": 918,
    "course_codes": "IMMUNOL 305",
    "course_title": "Immunology Journal Club",
    "original_descr": "Required of first- to third-year graduate students. Graduate students present and discuss recent papers in the literature. May be repeated for credit.",
    "original_word_count": 22,
    "expanded_descr": "In Immunology Journal Club, first- to third-year graduate students engage in discussions of recent immunology literature. Students present and critically analyze selected papers, fostering in-depth understanding of current research trends. Through repeated participation, students refine their presentation and critique skills, broadening their knowledge of immunological principles and mechanisms. This interactive forum encourages scholarly exchange, prepares students for research careers, and may be repeated for credit, allowing for continued growth and exploration of emerging topics in the field of immunology, under the guidance of experienced faculty mentors and peers. Active participation is expected and highly valued always.",
    "expanded_word_count": 96
  },
  {
    "id": 937,
    "course_codes": "CHEM 359",
    "course_title": "Inorganic Chemistry Seminar",
    "original_descr": "(Formerly 259) Required of graduate students majoring in inorganic chemistry.",
    "original_word_count": 10,
    "expanded_descr": "In the Inorganic Chemistry Seminar, graduate students majoring in inorganic chemistry engage in discussions and presentations on advanced topics. They explore recent research and developments, analyzing and interpreting complex data. Students develop critical thinking, public speaking, and scientific writing skills, preparing them for academic and professional careers. Faculty guidance and peer feedback foster a supportive environment, allowing students to refine their expertise and stay current in the field, enhancing their understanding of inorganic chemistry principles and applications, and promoting collaboration and networking among emerging experts in the discipline, with a focus on cutting-edge research and techniques always.",
    "expanded_word_count": 97
  },
  {
    "id": 956,
    "course_codes": "EPI 226",
    "course_title": "Intermediate Epidemiologic and Clinical Research Methods",
    "original_descr": "The principles of study design, measurement, confounding, effect modification, and strategies for minimizing bias in clinical and epidemiologic studies. Prerequisite: EPI 225 or consent of instructor.",
    "original_word_count": 26,
    "expanded_descr": "In Intermediate Epidemiologic and Clinical Research Methods, students explore study design, measurement, and bias minimization strategies. Building on foundational knowledge, participants analyze confounding, effect modification, and techniques to ensure validity. Through case studies and interactive discussions, students develop critical thinking and problem-solving skills. Prerequisite: EPI 225 or instructor consent. This course prepares students to design, implement, and critically evaluate clinical and epidemiologic studies, fostering a deeper understanding of research principles and methods to inform evidence-based practice and policy decisions in healthcare and public health settings with enhanced research literacy and expertise. Students apply theoretical concepts practically.",
    "expanded_word_count": 96
  },
  {
    "id": 1954,
    "course_codes": "MUSIC 123B",
    "course_title": "Undergraduate Seminar in Composition: Pitch Design",
    "original_descr": "Students compose weekly exercises to develop creative fluency and personal style. The course focuses on listening to examples, analysis and emulation of diverse compositional techniques involving pitch.",
    "original_word_count": 27,
    "expanded_descr": "In the Undergraduate Seminar in Composition: Pitch Design, students cultivate creative fluency and personal style through weekly composition exercises. The course explores diverse compositional techniques involving pitch, with in-depth analysis and emulation of various musical examples. Students develop their listening skills, analyzing and applying techniques from different genres and styles. Through hands-on composition and peer feedback, students refine their craft, fostering a unique musical voice and confidence in their artistic expression, while gaining a deeper understanding of pitch design principles and their application in music composition, leading to a comprehensive portfolio of original works by course completion effectively.",
    "expanded_word_count": 98
  },
  {
    "id": 967,
    "course_codes": "ENGLISH 192",
    "course_title": "Intermediate Poetry Writing",
    "original_descr": "Students will examine a diverse range of contemporary poetry. Students write and revise several poems that will develop into a larger poetic project.",
    "original_word_count": 23,
    "expanded_descr": "In Intermediate Poetry Writing, students delve into contemporary poetry's diverse forms and styles. Through workshops and discussions, they analyze and interpret poems, developing critical thinking and writing skills. Students craft and refine multiple poems, culminating in a cohesive poetic project. Guided by instructor feedback, they explore themes, tone, and language, experimenting with voice and style. This course fosters creative growth, helping students establish a unique poetic voice and prepare a polished portfolio of their work, ready for publication or further study, with a deeper understanding of poetry's power and expressive possibilities, and their own writing potential.",
    "expanded_word_count": 96
  },
  {
    "id": 973,
    "course_codes": "CHINLANG 42",
    "course_title": "Intermediate-to-Advanced Chinese Conversation, Second Quarter",
    "original_descr": "Continuation of CHINLANG 41. Repeatable once for units. Prerequisite: CHINLANG 23.",
    "original_word_count": 11,
    "expanded_descr": "In Intermediate-to-Advanced Chinese Conversation, Second Quarter, students build on CHINLANG 41, refining their speaking skills. Prerequisite CHINLANG 23 ensures a solid foundation. Through discussions, debates, and role-plays, learners engage with complex topics, idiomatic expressions, and nuanced language. Authentic materials and multimedia resources enhance cultural understanding. Repeatable once for units, this course fosters confident communication, preparing students for real-world interactions. Interactive activities and feedback promote progress, helping learners achieve advanced conversation proficiency in Chinese, enabling effective expression of thoughts, opinions, and ideas in various social and professional contexts, with improved fluency and accuracy, every day.",
    "expanded_word_count": 94
  }
]